{
  "id": "project-20260212-619207",
  "title": "Global Foundation for Transparent Collective Gatherings",
  "description": "Executive Brief\n\nGlobal Foundation for Transparent Collective Gatherings\n\nOverview\n\nThe Global Foundation for Transparent Collective Gatherings is a proposed non-profit institution designed to establish a global protocol for trust-based, ethically facilitated, and economically transparent collective experiences.\n\nAcross cities worldwide, immersive gatherings — including movement-based events, sonic experiences, and participatory communal spaces — are growing in cultural relevance. However, these gatherings often lack standardized governance, financial transparency, and independent accountability structures.\n\nThe Foundation addresses this structural gap.\n\n⸻\n\nCore Objective\n\nTo create and steward a globally recognized protocol that ensures:\n\t•\tTransparent economic reporting for all affiliated gatherings\n\t•\tEthical standards and accountability mechanisms for facilitators\n\t•\tDecentralized yet structured local governance\n\t•\tSustainable, non-extractive economic models\n\t•\tInclusive participation not limited by ability to pay\n\nA key objective is to foster economic solidarity within communities, enabling participants with greater financial capacity to support broader access — ensuring gatherings remain accessible while financially sustainable.\n\n⸻\n\nThe Problem\n\nThe current ecosystem of collective experiences often operates without:\n\t•\tClear financial disclosures\n\t•\tDefined surplus allocation models\n\t•\tIndependent ethical oversight\n\t•\tFormalized feedback and review processes\n\t•\tScalable governance structures\n\nAs participation increases, these gaps create risks including opacity, power concentration, ethical ambiguity, and erosion of trust.\n\n⸻\n\nThe Solution\n\nThe Foundation will:\n\t1.\tPublish and steward a public Charter defining:\n\t•\tFinancial transparency standards\n\t•\tEthical facilitation requirements\n\t•\tCommunity accountability processes\n\t•\tPre-declared surplus allocation structures\n\t2.\tVerify and register independent city-based “Nodes” that adopt the protocol.\n\t3.\tMaintain a transparent global governance framework with rotating stewardship.\n\t4.\tPublish annual institutional and financial reports.\n\n⸻\n\nOperating Model\n\nLocal Nodes\n\t•\tOperate autonomously\n\t•\tHost gatherings aligned with the Charter\n\t•\tPublish revenue, cost, and surplus breakdowns\n\t•\tImplement sliding-scale or solidarity-based pricing models\n\t•\tContribute a defined percentage to sustain global infrastructure\n\nGlobal Foundation\n\t•\tMaintains the protocol and brand integrity\n\t•\tOversees verification standards\n\t•\tFacilitates ethical review processes\n\t•\tManages a transparent global treasury\n\n⸻\n\nEconomic Framework\n\nThe Foundation does not extract private profit.\n\nEconomic principles include:\n\t•\tOpen ledger reporting at the gathering level\n\t•\tClearly defined surplus allocation\n\t•\tReasonable, disclosed compensation for institutional roles\n\t•\tCommunity-supported models that encourage equitable participation\n\nParticipation in gatherings should not be limited by financial capacity; solidarity-based pricing structures are encouraged as a core design principle.\n\n⸻\n\nLong-Term Vision\n\nTo establish a globally recognized trust standard for collective gatherings, where affiliation signals:\n\t•\tFinancial transparency\n\t•\tEthical accountability\n\t•\tCommunity governance\n\t•\tInclusive and sustainable economic practice\n\nThe Foundation is designed as durable institutional infrastructure — intended to outlast founders and operate through structured stewardship.",
  "status": "active",
  "created_at": "2026-02-12T13:56:59.207Z",
  "updated_at": "2026-02-12T14:20:57.318Z",
  "pipeline": {
    "current_phase": "concept",
    "phases": {
      "concept": {
        "phase": "concept",
        "sub_state": "review",
        "started_at": "2026-02-12T13:56:59.210Z",
        "step": "council_selection"
      }
    },
    "run_id": "pipeline-1770904619210-mvem",
    "updated_at": "2026-02-12T14:20:57.317Z"
  },
  "phase": "concept",
  "concept_thread_id": "thread-20260212-619211",
  "artifacts": {
    "refined_concept": "# Concept Summary: Global Foundation for Transparent Collective Gatherings\n\n## 1. Problem Statement\n\nImmersive collective gatherings (ecstatic dance, sound journeys, breathwork circles, conscious raves) are growing in cultural relevance globally, but operate in a fragmented ecosystem without:\n- Standardized financial transparency or disclosure\n- Ethical oversight and accountability mechanisms\n- Defined governance structures\n- Formalized community feedback systems\n- Trust signals for participants\n\nThis creates risks including opacity, power concentration, ethical ambiguity, and erosion of trust as participation scales.\n\n## 2. Target Users\n\n- **Event organizers**: Individual facilitators, established collectives, and venue owners currently operating in silos\n- **Participants**: Seekers of trustworthy, experience-driven active engagement events\n- **Initial cities**: Zurich, Bangalore, Goa, San Francisco (founders located in these hubs)\n\n## 3. Proposed Solution\n\nA non-profit Foundation that establishes and stewards a global protocol through:\n- **Public Charter** defining transparency, ethical, and governance standards\n- **City-based Nodes** (2-3 community ambassadors per city)\n- **Facilitator verification** with screening, trial events, and co-facilitation requirements\n- **Independent oversight** and accountability structures\n- **Economic transparency** requirements for all affiliated gatherings\n\n## 4. Key Features\n\n- **Tiered facilitator rating system**: Entry → Established → Distinguished → Elder (community-voted advancement)\n- **Post-event transparency loop**: Public disclosure of costs, surplus/deficit, with community input on future pricing\n- **Community ambassador network**: Local screening and quality assurance\n- **Better terms for quality**: Higher-rated facilitators get improved venue access and conditions\n- **Economic solidarity model**: Sliding scale pricing enabling broader access\n- **Curated discovery platform**: Navigate fragmented landscape with trust signals\n\n## 5. Differentiation\n\n- **Real-time economic feedback**: Unlike traditional event management, transparent post-event reporting allows community dialogue on pricing and sustainability\n- **Active participation focus**: Clear boundary—experience-driven engagement, not passive consumption\n- **Community-driven quality**: Participants vote to elevate facilitators, not top-down curation\n- **Unprecedented transparency**: Financial disclosure never seen in this space\n- **Decentralized governance**: City Nodes operate independently within protocol framework\n\n## 6. Success Criteria\n\n**Year 1 (12-month pilot):**\n- Launch operational Nodes in all 4 cities simultaneously\n- Verify initial cohort of facilitators per city\n- Achieve specific event volume and participant metrics\n- Demonstrate economic sustainability model\n- Establish functional community voting mechanisms\n\n## 7. Scope & Constraints\n\n**In Scope:**\n- Experience-driven active engagement events (movement, sonic, breathwork)\n- Transparent economic reporting and community feedback\n- Facilitator verification and tiered advancement\n- Multi-city launch with founders' local presence\n\n**Out of Scope:**\n- Passive consumption events (concerts, lectures)\n- Traditional profit-maximizing event management\n- Single-city pilot (launching 4 simultaneously)\n\n**Constraints:**\n- $200-300K Year 1 budget\n- Requires community management approach vs. traditional event management\n- Navigating fragmented current landscape of individual operators\n\n---\n\n**Council-ready with**: Risk mitigation strategies, financial projections, success metrics, and specific questions for feedback.",
    "selected_council": [
      {
        "agent_name": "Community Governance & Collective Decision-Making Agent",
        "role": "Governance Systems Design",
        "focus": "Evaluates the decentralized governance model, particularly the balance between city-based Node autonomy and global protocol coherence. Assesses voting mechanisms, power concentration risks, conflict resolution pathways, and how community voice translates into actual influence.",
        "evaluation_criteria": [
          "Governance structure clarity and enforceability",
          "Node autonomy vs. central protocol tension management",
          "Community voting mechanism robustness and manipulation resistance",
          "Conflict resolution and accountability escalation pathways",
          "Power distribution across facilitators, ambassadors, and participants"
        ]
      },
      {
        "agent_name": "Trust & Safety in Embodied Practices Agent",
        "role": "Participant Protection & Harm Mitigation",
        "focus": "Evaluates safety protocols for vulnerable, somatic, altered-state experiences. Assesses consent frameworks, trauma-informed facilitation standards, accountability mechanisms when harm occurs, and how the verification system addresses facilitator misconduct or participant boundary violations.",
        "evaluation_criteria": [
          "Consent and boundary protocols for intimate/vulnerable practices",
          "Screening effectiveness for identifying high-risk facilitators",
          "Trauma-informed facilitation requirements and enforcement",
          "Incident response and accountability when harm occurs",
          "Psychological safety infrastructure for participants"
        ]
      },
      {
        "agent_name": "Cross-Cultural Protocol Translation Agent",
        "role": "Multi-Geography Adaptation",
        "focus": "Evaluates the simultaneous 4-city launch strategy across radically different cultural contexts (Zurich, Bangalore, Goa, SF). Assesses which standards must remain universal vs. locally adapted, cultural translation risks, and whether the protocol framework is flexible enough for meaningful localization while maintaining coherence.",
        "evaluation_criteria": [
          "Universal vs. localized standard identification and justification",
          "Cultural translation risks in consent, pricing, governance norms",
          "City Node autonomy sufficiency for meaningful local adaptation",
          "Founder proximity impact and remote city sustainability",
          "Cross-city learning and protocol evolution mechanisms"
        ]
      },
      {
        "agent_name": "Economic Transparency & Solidarity Finance Agent",
        "role": "Alternative Economic Models",
        "focus": "Evaluates the economic transparency loop, sliding scale sustainability, and post-event financial disclosure systems. Assesses whether transparent pricing dialogues are genuinely generative or create participant fatigue, how facilitators sustain livelihoods under public scrutiny, and if the solidarity model achieves stated access goals without exploitation.",
        "evaluation_criteria": [
          "Financial disclosure mechanisms and community dialogue quality",
          "Sliding scale model sustainability for facilitators and venues",
          "Pricing dialogue productivity vs. community fatigue risk",
          "Economic viability for facilitators under transparency requirements",
          "Access equity achievement and subsidization sustainability"
        ]
      },
      {
        "agent_name": "Facilitator Credentialing & Quality Emergence Agent",
        "role": "Subjective Experience Quality Assurance",
        "focus": "Evaluates the tiered facilitator rating system and community-driven advancement model. Assesses how subjective, embodied experiences translate into measurable quality signals, risks of popularity contests vs. genuine skill recognition, and whether the screening/co-facilitation model identifies both competence and ethical fitness.",
        "evaluation_criteria": [
          "Quality criteria for subjective/somatic experiences",
          "Community voting manipulation and popularity bias resistance",
          "Screening effectiveness for both skill and ethical fitness",
          "Advancement pathway clarity and perceived fairness",
          "Diversity and inclusion in facilitator pipeline and rating systems"
        ]
      }
    ]
  }
}