{
  "id": "project-20260212-205431",
  "title": "Sentio",
  "description": "SENTIO AI\nTHE SOVEREIGN INSTRUMENT\n────────────────────────────────────────\nComprehensive Product Requirements Document\nFull Ecosystem Specification: Mobile App • Desktop Studio • Marketplace • Live Radio • Campfire Mode\n\nVersion 11.0  •  February 3, 2026  •  Pre-Development\n2-Month MVP Sprint  •  4 User Personas  •  Free + Pro Tiers\n\nTable of Contents\nThis document covers the complete Sentio AI ecosystem across 14 sections. Section 1–6 define the product. Sections 7–14 define the business, operations, and roadmap.\n\n1. Executive Summary\n2. Core Concepts: VibeBlocks, CoreKits & VibeBundles\n3. User Personas\n4. Technical Architecture\n5. Feature Specifications\n   5A. Sentio Mobile (The Performer)\n   5B. Sentio Studio Desktop (The Composer)\n   5C. Vibe Marketplace\n   5D. Live Radio\n   5E. Campfire Mode\n   5F. Ghost Producer (Style Transfer)\n6. AI Model Strategy\n7. Business Model & Pricing\n8. Revenue Architecture & Payment Strategy\n9. Marketplace Economics Deep Dive\n10. Competitive Landscape\n11. Phased Roadmap (8-Week MVP Sprint)\n12. Success Metrics & KPIs\n13. Risk Matrix & Mitigations\n14. Appendices & Research References\n\n\n1. Executive Summary\nThe music industry operates a broken value chain. Centralized streaming platforms use pro-rata payout models that incentivize bot farms and \"AI slop\" over genuine artistry. Independent artists face a \"path to pennies\"—investments of $100K+ into albums return as little as $1,200 in streaming royalties over 18 months. Identity verification failures enable fraud, while 30% platform taxes extract value from every transaction.\nSentio AI is a local-first generative audio ecosystem that structurally solves these problems. Rather than streaming audio files (50MB each), Sentio streams JSON instruction sets called VibeBlocks (<10KB)—a >1,000x reduction in data transfer. On-device AI models translate natural language and emotional intent into deterministic, royalty-free music compositions rendered locally from licensed sample libraries (CoreKits).\nThis architecture enables a 70/30 revenue split favoring creators, eliminates cloud compute costs, ensures complete user privacy (no prompts leave the device), and provides cryptographic proof of authorship (\"Audit Insurance\") that protects against copyright litigation—the existential threat that has crippled competitors like Udio.\n\nThe Win-Win-Win\nStakeholder\nCurrent Problem\nSentio Solution\nArtists\nPro-rata dilution, ~$0.003/stream, no ownership\n70% revenue share, asset sovereignty, cryptographic signing, direct-to-fan distribution\nConsumers\nPassive listening, subscription rent-seeking\nActive prosumerism: buy, remix, resell VibeBlocks. Own assets locally forever.\nIndustry\nBlack-box AI copyright risk, opaque attribution\nDeterministic generation from licensed CoreKits = clear chain of title. Full audit trail.\n\n\n2. Core Concepts: VibeBlocks, CoreKits & VibeBundles\nThe Sentio ecosystem is built on three foundational primitives. Understanding these is essential to understanding every feature described in this document.\n2.1 VibeBlock (The Atomic Unit)\nA VibeBlock is a JSON instruction set (<10KB) that defines a complete musical idea. It is not an audio file—it is a recipe that tells the local audio engine what to play, when, and how. Think of it as sheet music for an AI-powered instrument.\nVibeBlock Schema\nField\nType\nDescription\nExample\nid\nUUID\nUnique identifier, generated on-device\nvb_7f3a9c2e...\nversion\nsemver\nSchema version for forward compatibility\n1.0.0\nmeta.title\nstring\nHuman-readable name\n\"Midnight Drive\"\nmeta.author_id\nEd25519 pubkey\nCryptographic identity of creator\ned25519:abc123...\nmeta.signature\nEd25519 sig\nProves authorship, prevents forgery\nsig:def456...\nmeta.timestamp\nISO 8601\nCreation time (device clock)\n2026-02-03T12:00:00Z\nmeta.license\nenum\nRights declaration\nCC-BY-SA | PROPRIETARY | REMIX_OK\nmeta.parent_id\nUUID | null\nIf remixed, points to original for royalty chain\nvb_original_id\nmeta.tags\nstring[]\nSearchable genre/mood tags\n[\"lofi\", \"chill\", \"study\"]\ncomposition.bpm\nint (40–300)\nTempo\n85\ncomposition.key\nstring\nMusical key\nF#m\ncomposition.time_sig\nstring\nTime signature\n4/4\ncomposition.structure\nBlock[]\nArrangement sections\n[intro, verse, chorus, outro]\ncomposition.tracks[]\nTrack[]\nMulti-track layers\ndrums, bass, synth_pad, lead\ncomposition.tracks[].patterns\nPattern[]\nMIDI-like note events per track\nSee pattern schema below\ncomposition.tracks[].corekit_ref\nstring\nWhich CoreKit sample set to use\nck_lofi_essentials_v2\ncomposition.tracks[].fx_chain\nFX[]\nEffects pipeline per track\n[reverb, compression, delay]\ncomposition.tracks[].automation\nCurve[]\nParameter automation over time\nfilter_cutoff: 0.2→0.8\nmood\nobject\nValence/Arousal emotional mapping\n{valence: 0.3, arousal: 0.6}\nrendering_hints\nobject\nMicro-timing, swing, humanization\n{swing: 0.15, velocity_var: 0.1}\n\n\nKey Properties: VibeBlocks are deterministic (same block + same CoreKit = identical audio), portable (works on any device with the referenced CoreKit), and ownable (cryptographic signature = unforgeable proof of authorship). They are the fundamental tradeable asset of the Vibe Economy.\n2.2 CoreKit (The Sound Library)\nA CoreKit is a curated, licensed sample library stored locally on the user’s device. It contains the actual audio assets (one-shots, loops, synth patches, vocals) that the VibeBlock’s instructions reference. CoreKits are the reason Sentio can guarantee a clean chain of title—every sound is either royalty-free, CC-licensed, or created by a verified artist.\nCoreKit Types\nType\nSource\nSize\nUse Case\nFoundation Kit\nSentio (bundled with app)\n50–150MB\nEssential sounds for all genres: drums, bass, pads, FX. Ensures every user can render any VibeBlock.\nGenre Kit\nSentio + Partners\n30–100MB\nSpecialized: \"Lo-Fi Essentials\", \"Trap Arsenal\", \"Jazz Standards\", \"Orchestral Foundations\"\nArtist Kit\nVerified creators on marketplace\n20–80MB\n\"KARRA Vocal Kit\", \"Producer X Drum Collection\"—an artist’s signature sounds\nGhost Producer Kit\nUser-trained (LoRA)\n10–50MB\nPersonal style: user’s own audio files processed through Ghost Producer pipeline\n\n\nCoreKit Economics: Foundation Kit is free (bundled). Genre Kits are included in Pro tier or $2–$5 individual purchase. Artist Kits are priced by creators (typically $5–$25) with 70/30 revenue split. Ghost Producer Kits are generated locally and never leave the device.\nCoreKit Verification: Every CoreKit includes a manifest.json listing SHA-256 hashes of every sample. When a VibeBlock references a CoreKit, the rendering engine verifies hashes before playback—ensuring no tampered or unauthorized samples enter the chain of title.\n2.3 VibeBundles (Composing at Scale)\nA VibeBundles is an ordered collection of VibeBlocks that forms a complete musical work—a track, an EP, an album, or an infinite generative set. VibeBundles add structure metadata on top of individual blocks.\nVibeBundles Types\nBundle Type\nBlock Count\nPurpose\nExample\nSingle Track\n4–8 blocks\nA complete song with intro/verse/chorus/outro structure\n\"Midnight Drive\" (3:42)\nEP / Album\n16–64 blocks\nCollection of tracks with thematic coherence\n\"Neon Dreams EP\" (6 tracks)\nLive Set\n16–128 blocks\nDJ/performance set with transition logic\n\"Friday Night 2-Hour Mix\"\nRadio Stream\n∞ (generative)\nInfinite continuous playback with style constraints\n\"Lo-Fi Study Radio\"\nCampfire Session\nVariable\nCollaborative real-time bundle, multiple authors\n\"Jam @ SXSW 2026\"\n\n\nBundle Schema Additions: VibeBundles add transition_rules (crossfade durations, key-matching constraints), playback_mode (sequential, shuffle, generative), and a contributors[] array with per-block royalty splits. When a bundle contains blocks from multiple creators, the royalty attribution system automatically distributes payments according to the split ratios.\n\n3. User Personas\n3.1 The Explorer\n\"I want to feel something, not fiddle with knobs.\"\nDemographics: 16–35, casual music consumer, uses Spotify/Apple Music daily. No musical training. Discovers Sentio through TikTok or word-of-mouth. Primary device: iPhone/Android.\nPrimary use: Live Radio mode, browsing marketplace for mood-based VibeBlocks, casual remixing (changing tempo/key of purchased blocks). Campfire Mode at social gatherings.\nSuccess metric: Daily active usage >15 min. Converts from free to sharing VibeBlocks with friends within 7 days.\n3.2 The Artist\n\"I need to own my sound and get paid fairly.\"\nDemographics: 20–40, independent musician/vocalist/producer. Currently uses Spotify/Bandcamp/DistroKid. Frustrated by <$0.003/stream payouts and Content ID false claims. Has 1K–100K followers.\nPrimary use: Creating and selling CoreKits (their signature sounds), publishing VibeBlocks/VibeBundles on marketplace, direct-to-fan distribution via Campfire Mode at live shows, building recurring revenue through style adapters (Ghost Producer kits).\nSuccess metric: Monthly marketplace revenue exceeds Spotify royalties within 6 months.\n3.3 The Producer\n\"Give me precision tools that integrate with my DAW.\"\nDemographics: 22–45, semi-pro to professional music producer. Uses Ableton/Logic/FL Studio daily. Familiar with Splice, MIDI, audio processing. Owns mid-to-high-end hardware (M-series Mac or RTX GPU).\nPrimary use: Sentio Studio desktop app with VST3 integration. Ghost Producer for style transfer. Complex VibeBlock composition using 8B/14B models for advanced music theory (jazz reharmonization, modulation planning). Stem separation + audio-to-MIDI conversion. Creating and selling premium CoreKits and VibeBundles.\nSuccess metric: Integrates Sentio Studio into daily production workflow. Generates >50% of marketplace’s premium content.\n3.4 The Fan\n\"I want to collect, remix, and share my favorite artists’ vibes.\"\nDemographics: 14–30, active on social media, collects digital goods (NFTs, skins, merch). Values exclusivity and community. Attends live events.\nPrimary use: Buying artist CoreKits and VibeBlocks, personalizing/remixing them (changing instruments, tempo, key), sharing custom versions socially, collecting limited-edition Campfire Mode drops at live events (POAPs), participating in collaborative Campfire sessions.\nSuccess metric: Purchases >3 marketplace items/month. Creates >5 remixes/month. Drives organic referrals through social sharing.\n\n4. Technical Architecture\n4.1 Architecture Principles\nLocal-First: All AI inference, audio rendering, and asset storage happen on-device. The cloud is only used for marketplace indexing and payment processing.\nPrivacy-by-Default: No user prompts, creative data, or listening habits are transmitted to servers. Analytics are opt-in and anonymized.\nAsset Sovereignty: Users own their VibeBlocks, CoreKits, and VibeBundles. Canceling a subscription does not revoke access to purchased or created assets.\nDeterministic Rendering: Same VibeBlock + same CoreKit = identical audio output on any device. No cloud-side randomness.\nGPL-Free Stack: All dependencies are MIT, Apache 2.0, or commercially licensed. No GPL contamination to protect commercial sovereignty.\n4.2 Mobile Architecture (The Performer)\nComponent\nTechnology\nLicense\nPurpose\nLogic Engine\nQwen3 0.6B-Instruct (Int4, Q4_K_M)\nApache 2.0\nSemantic reasoning: translates natural language/mood into VibeBlock JSON. 397MB quantized.\nInference Runtime\nllama.rn + JSI Bridge\nMIT\nZero-copy C++ to JS data transfer. <10ms IPC latency.\nConstraint Layer\nGBNF Grammars\nMIT (llama.cpp)\nGuarantees 100% valid JSON output. Genre-specific grammars (Jazz, EDM, Lo-Fi, etc.)\nAudio Engine\nMiniaudio\nMIT-0\nLow-level audio I/O. CoreAudio (iOS) / AAudio (Android) backends.\nDSP\nSignalsmith Stretch\nMIT\nTime-stretching, pitch-shifting, real-time FX processing.\nLocal DB\nWatermelonDB + SQLite\nMIT\nStores VibeBlocks, CoreKit manifests, user preferences offline.\nVector Search\nsqlite-vec\nMIT\nSemantic similarity search over local VibeBlock library.\nSync\nSupabase Realtime\nApache 2.0\nMarketplace sync, Campfire signaling (when online).\nP2P\nMultipeer Connectivity (iOS) / Nearby Connections (Android)\nPlatform\nCampfire Mode local mesh. BLE + WiFi Direct.\n\n\n4.3 Desktop Architecture (The Composer)\nComponent\nTechnology\nLicense\nPurpose\nApp Framework\nTauri 2.0 + Rust backend\nMIT/Apache 2.0\n2.5–10MB binary. <500ms startup. Native audio APIs via cpal crate.\nPrimary Model\nChatMusician 7B or Qwen 2.5 14B\nMIT / Apache 2.0\nMusic-theory-aware generation. ABC notation + structured JSON output.\nHeavy Model\nQwen 2.5 32B-Coder (optional)\nApache 2.0\nComplex compositions: jazz reharmonization, orchestral arrangement. Requires 20GB+ VRAM.\nInference\nllama.cpp (server mode)\nMIT\nOut-of-process. HTTP/WebSocket IPC with Tauri frontend.\nNeural Synthesis\nRAVE / BRAVE (optional)\nMIT\nReal-time timbre transfer: beatbox → saxophone. Sub-10ms latency (BRAVE).\nLoRA Training\nUnsloth + QLoRA\nApache 2.0\nGhost Producer style training. 7B model in 30–60 min on RTX 3090 (24GB).\nStem Separation\nHT-Demucs\nMIT\nAudio-to-stems for importing existing tracks.\nAudio-to-MIDI\nBasic Pitch\nApache 2.0\nExtract melody/groove from audio into MIDI for VibeBlock integration.\nVST3 Bridge\nJUCE (out-of-process sidecar)\nCommercial\nDAW integration for Ableton/Logic/FL Studio. Lock-free ring buffer IPC.\n\n\n4.4 Cloud Architecture (The Marketplace)\nComponent\nTechnology\nLicense\nPurpose\nBackend/DB\nSupabase (Postgres)\nApache 2.0\nMarketplace index, user profiles, transaction records. NOT audio storage.\nSearch\nMeilisearch\nMIT\nTypo-tolerant, instant search over VibeBlock/CoreKit metadata.\nPayments\nStripe Connect\nCommercial\nSplit payments (creator/Sentio). Apple/Google IAP for mobile.\nAuth\nSupabase Auth (Google/Apple SSO)\nApache 2.0\nIdentity + Ed25519 key pair generation for cryptographic signing.\nPreview CDN\nCloudflare R2\nCommercial\nServes watermarked audio previews (\"Poisoned Previews\") for marketplace.\nRealtime\nSupabase Realtime + WebSocket\nApache 2.0\nCampfire Mode signaling, marketplace notifications.\n\n\n5. Feature Specifications\n5A. Sentio Mobile (The Performer)\nThe mobile app is the primary entry point for Explorers and Fans. It prioritizes instant gratification, emotional expression, and social sharing. The Qwen3 0.6B model enables real-time VibeBlock generation from natural language prompts with <200ms AI response time.\nCore Mobile Flows\nQuick Vibe: User types or speaks a mood (\"rainy Sunday morning\"). AI generates a VibeBlock. Audio renders locally in <2 seconds. User can save, share, or tweak.\nBrowse & Buy: Marketplace tab with curated collections, trending blocks, artist spotlights. One-tap purchase ($0.49–$2.99). Instant download (<10KB).\nRemix: Purchased VibeBlocks can be modified: change BPM, key, instruments, FX. Modified version is a new VibeBlock with parent_id linking to original for royalty attribution.\nVibe Match (Listen Mode): Hold phone near external audio source. Meyda.js analyzes tempo, key, energy. AI generates a similar VibeBlock using local CoreKit. Intentionally \"lossy\"—captures vibe, not exact copy.\n\n5B. Sentio Studio Desktop (The Composer)\nThe desktop application targets Producers and professional Artists. Built on Tauri 2.0 with Rust audio backend, it provides the computational headroom for complex music theory reasoning, LoRA fine-tuning, and DAW integration.\nDesktop-Exclusive Features\nMulti-Model Workflow: Quick draft with Qwen3 0.6B, then refine with ChatMusician 7B for music theory accuracy, then polish with Qwen 2.5 14B/32B for complex arrangements. Models hot-swappable.\nGhost Producer Pipeline: Drag audio folder → automatic LoRA fine-tuning on user’s style (30–60 min on RTX 3090) → AI generates new compositions in user’s signature sound. V1 feature.\nVST3/AU Sidecar: Sentio runs as out-of-process companion to DAWs. JUCE-based bridge communicates via lock-free ring buffers. MIDI input triggers AI generation; output routes back as audio/MIDI.\nIntelligent Stems: Import audio → HT-Demucs separates into stems → Basic Pitch converts melody to MIDI → AI uses extracted groove/melody as seed for new VibeBlock generation.\nNeural Timbre Transfer: RAVE/BRAVE integration: beatbox into mic → real-time transformation to saxophone, cello, or any trained timbre. Sub-10ms latency with BRAVE architecture.\nAdvanced Composition UI: Timeline view for VibeBundles, multi-track editing, automation curves, per-track CoreKit assignment, export to MIDI/WAV/STEM.\n\n5C. Vibe Marketplace\nThe marketplace is the economic engine of the Sentio ecosystem. It is a hybrid cloud platform: the instrument is 100% local, but discovery and commerce require a central index. Because assets are JSON text (<10KB), not audio files (50MB), cloud infrastructure costs are ~99% lower than Spotify/Splice.\nMarketplace Architecture\nLocal-First, Cloud-Sync: Users create VibeBlocks locally. When they tap \"Publish to Market\", WatermelonDB syncs the JSON to Supabase. The server verifies: (1) user’s Ed25519 signature is valid, (2) referenced CoreKit exists and is licensed, (3) listing fee is paid. Block appears in global search.\nWhat’s Sold on the Marketplace\nAsset Type\nPrice Range\nRevenue Split\nDescription\nVibeBlock (Single)\n$0.49–$2.99\n70/30 (creator/Sentio)\nA single musical idea. Buyer gets full JSON source + rights to remix.\nVibeBundles (Track/EP)\n$1.99–$14.99\n70/30\nComplete songs or collections. Includes transition rules and structure.\nCoreKit (Genre)\n$1.99–$4.99\n70/30\nCurated sample libraries for specific genres. Bundles of audio assets.\nCoreKit (Artist)\n$4.99–$24.99\n70/30\nArtist’s signature sounds. Premium pricing reflects exclusivity.\nGhost Producer Adapter\n$9.99–$49.99\n70/30\nLoRA weights trained on an artist’s style. Buyer generates unlimited compositions in that style.\nRemix VibeBlock\n$0.49–$1.99\n50/20/30 (remixer/original/Sentio)\nModified version of existing block. Auto-attributes to original creator.\n\n\nAnti-Piracy: The Poisoned Preview\nWhen a VibeBlock is listed, the server renders a 30-second audio preview embedded with an AudioSeal watermark at -15dB. The actual JSON source is encrypted and only decrypted upon purchase. This means:\nHumans can judge the vibe from the preview and decide to buy.\nAI (Vibe Match) gets corrupted analysis from the watermark—generating garbage approximations, not accurate copies.\nThe $0.99 Rule: History (Steam, iTunes) proves people pay for convenience. One-tap buy beats the 10-step piracy workaround every time.\nRoyalty Attribution Chain\nWhen a remixed VibeBlock is sold, the system traces the parent_id chain and automatically splits revenue. Example: Artist A creates Block X. Fan B remixes it into Block Y. Producer C remixes Block Y into Block Z. When Block Z sells for $2.99: Producer C gets $1.05 (50%), Artist A gets $0.30 (originator bonus), Fan B gets $0.30 (remix chain), Sentio gets $0.90 (30%). Maximum chain depth: 5 levels. Beyond that, deeper ancestors split the originator bonus proportionally.\nCold Start: Founder’s Packs\nTo solve the empty marketplace problem at launch, Sentio commissions 10–20 professional sound designers to create high-quality \"Founder’s Packs\"—curated CoreKits and VibeBundles across key genres (Lo-Fi, EDM, Hip-Hop, Ambient, Jazz). These are featured prominently and serve as templates for how artists should package their own offerings.\n\n5D. Live Radio\nLive Radio transforms Sentio from a creation tool into an infinite, personalized listening experience. Unlike Spotify’s static playlists or YouTube Music’s AI-curated stations (which still play pre-recorded tracks), Sentio’s Radio generates music in real-time on-device. Every listening session is unique. The music literally never existed before and will never exist again.\nHow It Works\nStation Selection: User selects a mood/genre station (\"Lo-Fi Study\", \"Deep House Workout\", \"Ambient Sleep\") or describes one in natural language (\"something for a rainy drive through the mountains\").\nContinuous Generation: The AI generates VibeBlocks in a pipeline—while Block N is playing, Block N+1 is being generated, and Block N+2 is in the inference queue. This ensures gapless playback.\nIntelligent Transitions: Each new block is constrained by GBNF grammar rules that enforce musical coherence with the previous block: compatible key (same key, relative major/minor, or smooth modulation), tempo within ±5 BPM (or gradual drift), and energy level following a macro \"arc\" (build→peak→cooldown→build).\nCrossfade Rendering: Signalsmith Stretch handles seamless crossfading between blocks (2–4 second transitions). Audio engine pre-buffers 10–15 seconds ahead.\nUser Interaction: Listeners can nudge the station in real-time: \"more energy\", \"add piano\", \"darker\". These modify the generation constraints for subsequent blocks without interrupting current playback.\nRadio Station Types\nStation\nStyle Constraints\nInteraction Level\nTarget Persona\nPure Generative\nAI-composed from scratch, mood-seeded\nPassive (nudge only)\nExplorers: ambient study, sleep, focus\nArtist Radio\nConstrained to specific artist’s CoreKit + style\nPassive—like an artist’s infinite mixtape\nFans: endless stream in artist’s sound\nCommunity Radio\nPlays from marketplace trending blocks + AI fills\nSocial—listeners can upvote blocks\nExplorers + Fans: discover new creators\nDJ Radio\nUser-curated seed blocks, AI transitions between them\nActive—user queues blocks, AI mixes\nProducers: live performance tool\n\n\nKey Differentiator: Every competitor (Spotify, YouTube Music, Endel) streams pre-recorded or server-rendered audio. Sentio Radio generates locally—meaning zero streaming bandwidth cost, works completely offline, and every session is provably unique.\nMonetization: Free tier gets 2 station types with ads between blocks (audio ads, also rendered locally from a lightweight text-to-speech system). Pro tier gets unlimited stations, no ads, and the ability to save any generated block to library or publish to marketplace.\n5E. Campfire Mode\nCampfire Mode is Sentio’s peer-to-peer, offline-first collaborative music creation and distribution feature. It restores the intimate, direct artist-to-fan connection that streaming destroyed—using local mesh networking to beam VibeBlocks between devices without touching the internet.\nThree Campfire Scenarios\nScenario 1: Artist Drop (Distribution)\nAn artist at a live venue activates Campfire broadcast mode. Their phone becomes a beacon, offering exclusive VibeBlocks to nearby devices. Fans within Bluetooth/WiFi Direct range (~30–100 feet) receive the drop directly. Each drop is signed with the artist’s Ed25519 key, creating a verifiable \"Proof of Attendance\" (POAP). These exclusive blocks are marked as Campfire Originals in the fan’s library—collectible, tradeable on marketplace later with provenance proof.\nScenario 2: Collaborative Jam (Creation)\n2–8 users in the same physical space start a Campfire Jam session. One device acts as the \"Host\" (sets BPM, key, CoreKit). Each participant contributes VibeBlocks to a shared VibeBundles that plays on all devices simultaneously. CRDT-based sync (Automerge) ensures conflict-free merging even with dropped connections. The resulting collaborative VibeBundles lists all contributors and auto-splits any future marketplace revenue.\nScenario 3: Fan Seeding (P2P Distribution)\nPopular VibeBlocks and CoreKits can be \"seeded\" by fans who already own them, similar to BitTorrent. When a new user wants to download a popular block, instead of pulling from the central server, nearby Campfire-enabled devices can serve it. This creates a decentralized CDN that scales with popularity—the more popular a block, the more seeders, the faster the download. Seeders earn micro-credits toward marketplace purchases.\nCross-Platform Technical Implementation\nPlatform\nTechnology\nRange\nMax Peers\nLimitation\niOS ↔ iOS\nMultipeer Connectivity (BLE + WiFi)\n30–100 ft\n8\nNative, no internet needed\nAndroid ↔ Android\nNearby Connections (BLE + WiFi Direct)\n30–100 ft\n8+\nNative, no internet needed\niOS ↔ Android\nShared WiFi network (WebSocket fallback)\nSame network\n20+\nRequires shared WiFi—no true offline cross-platform\nRemote (any)\nWebRTC P2P\nGlobal\n8–12\n50–150ms latency. Sufficient for collaboration, not real-time jamming.\n\n\nCritical Design Decision: True offline cross-platform (iOS ↔ Android without WiFi) is not possible with current OS APIs. For V1, Campfire defaults to same-platform P2P for offline, and shared WiFi / WebRTC for cross-platform. This is communicated clearly in UI: \"Connect to the same WiFi for cross-platform jam.\"\n5F. Ghost Producer (Style Transfer)\nGhost Producer is the desktop-only feature that converts Sentio from a generic instrument into your personal instrument. It uses LoRA (Low-Rank Adaptation) fine-tuning to teach the AI model a specific artist’s creative signature—their rhythmic swing, harmonic preferences, arrangement patterns, and sonic palette.\nPipeline\nIngest: User drags a folder of their audio files (stems, bounces, projects) into Sentio Studio.\nAnalyze: HT-Demucs separates stems. Basic Pitch extracts MIDI. Feature analysis captures: BPM distributions, key preferences, chord progression patterns, rhythmic swing values, arrangement structures, FX chain signatures.\nTrain: Unsloth + QLoRA fine-tunes a LoRA adapter on the extracted patterns. 7B model: 30–60 min on RTX 3090 (24GB VRAM, 6–8GB with QLoRA). Rank 8–16, learning rate 2e-4, 1–3 epochs.\nGenerate: User prompts AI as normal, but with LoRA adapter loaded. Output VibeBlocks reflect the user’s personal style signature.\nPackage (Optional): Artist can package their LoRA adapter as a \"Ghost Producer Kit\" for marketplace sale. Fans buy it to generate unlimited compositions in that artist’s style.\n\n6. AI Model Strategy\nSentio uses a multi-model architecture where different models serve different contexts. The core insight is that VibeBlock generation is fundamentally a structured JSON generation task, not an audio generation task. This means general-purpose LLMs with strong JSON/code capabilities are often better than music-specific models.\nRecommended Model Stack\nContext\nModel\nParameters\nSize (Quantized)\nLicense\nStrengths\nMobile (all users)\nQwen3 0.6B-Instruct\n600M\n397MB (Q4_K_M)\nApache 2.0\nGBNF grammar support, native JSON mode, 32K context, \"Thinking Mode\" for reasoning\nDesktop (standard)\nChatMusician 7B\n7B\n~4GB (Q4)\nMIT\nMusic-theory-trained on 4B tokens. ABC notation output. Chord/melody conditioning.\nDesktop (advanced)\nQwen 2.5 14B-Instruct\n14B\n~8GB (Q4)\nApache 2.0\nSuperior structured JSON output. 128K context. Function calling for complex compositions.\nDesktop (studio)\nQwen 2.5 32B-Coder\n32B\n~18GB (Q4)\nApache 2.0\nMaximum compositional quality. Jazz reharmonization, orchestral arrangement.\nText→MIDI (research)\nMIDI-LLM 1.47B\n1.47B\n~1.5GB (FP8)\nLlama Community\nState-of-art MIDI generation (FAD 0.173). Requires <700M MAU for commercial use.\nTimbre transfer\nBRAVE (RAVE variant)\n4.9M\n~20MB\nMIT\nSub-10ms real-time audio transformation. CPU-capable at 48kHz.\n\n\nModel Selection Logic: The app auto-detects available hardware. On mobile, only Qwen3 0.6B is loaded. On desktop, the default is ChatMusician 7B; users with 16GB+ VRAM get Qwen 2.5 14B recommended; 24GB+ VRAM unlocks the 32B option. Models are downloaded on-demand (not bundled) to keep initial install size small.\n\n7. Business Model & Pricing\n7.1 Pricing Tiers\nTier\nPrice\nIncludes\nTarget Persona\nFree (Explorer)\n$0/month\nQwen3 0.6B on mobile, Foundation CoreKit, 2 Radio stations, 5 VibeBlock generations/day, marketplace browsing, Campfire receive-only\nExplorers, trial users\nPro (Creator)\n$9.99/month\nEverything Free +: Unlimited generations, all Radio stations (no ads), full Campfire (send+receive+jam), 3 Genre CoreKits/month, remix & publish to marketplace, mobile priority support\nArtists, Fans, active creators\nStudio (Producer)\n$24.99/month\nEverything Pro +: Desktop Studio app, Ghost Producer pipeline, VST3/AU sidecar, ChatMusician 7B + Qwen 14B/32B models, advanced export (WAV/MIDI/Stems), 5 Genre CoreKits/month, Intelligent Stems\nProfessional producers\nEnterprise\nCustom\nVolume licensing, custom CoreKit commissioning, white-label integration, API access, dedicated support\nLabels, studios, brands\n\n\n7.2 Revenue Streams\nStream\nMechanism\nProjected Mix (Y1)\nNotes\nSubscriptions\nMonthly recurring (Pro + Studio)\n40%\nCore revenue. Target: 5% free→Pro conversion.\nMarketplace Commission\n30% of all marketplace sales\n30%\nScales with GMV. Low marginal cost (text, not audio).\nCoreKit Sales\nDirect sales of Sentio-produced genre kits\n15%\nHigh-margin. Sentio acts as publisher for curated packs.\nGhost Producer Kits\n30% commission on artist LoRA adapter sales\n10%\nHigh-value items ($9.99–$49.99). Grows with artist adoption.\nCampfire Credits\nMicro-transactions for seeding rewards\n5%\nEcosystem lubricant. Keeps P2P network healthy.\n\n\n8. Revenue Architecture & Payment Strategy\n8.1 Payment Processing Strategy\nSentio’s payment architecture is designed to minimize platform taxes while maintaining App Store compliance. The post-Epic v Apple landscape and EU Digital Markets Act create significant opportunities.\nPlatform-Specific Payment Routing\nPlatform\nPayment Method\nCommission Paid\nLegal Basis\niOS (US)\nExternal payment link to Stripe\n~3% (Stripe only)\nEpic v Apple ruling (April 2025): US developers can embed external payment links\niOS (EU)\nAlternative payment processor via DMA\n~10–12% (Apple CTF + Store Services)\nEU Digital Markets Act: Apple must accept alt payment systems\niOS (ROW)\nApple IAP\n15–30%\nStandard App Store commission. Small Business Program = 15%.\nAndroid (US)\nThird-party payment (Stripe)\n~3%\nGoogle Play injunction (Oct 2025): external checkout permitted through Nov 2027\nAndroid (ROW)\nGoogle Play Billing\n15%\nGoogle reduced to 15% for first $1M/year\nDesktop\nStripe Direct\n~3%\nNo platform commission. Direct payment processing.\nWeb\nStripe Direct\n~3%\nNo platform commission. Web marketplace portal.\n\n\nStrategic Priority: Desktop and web purchases should be promoted aggressively—they carry only 3% payment processing versus 15–30% on mobile stores. The marketplace web portal is the highest-margin sales channel.\n8.2 Payout Mechanics\nCreators receive payouts via Stripe Connect on a monthly cycle with $10 minimum threshold. Stripe Connect handles 1099 generation for US creators and international wire transfers. For remix chains, the attribution engine calculates splits at transaction time and records them immutably in the Supabase ledger—no retroactive reconciliation needed.\n\n9. Marketplace Economics Deep Dive\n9.1 Competitive Commission Benchmarking\nPlatform\nCommission\nCreator Payout\nAsset Type\nSentio Marketplace\n30%\n70%\nVibeBlocks, CoreKits, VibeBundles, LoRA Adapters\nSplice Sounds\n~50% (subscription model)\n~50%\nAudio samples, loops, presets\nBandcamp\n15% (10% after $5K)\n85–90%\nAudio files, physical merch\nBandcamp Fridays\n0%\n100%\nAudio files (monthly event)\nApp Store\n15–30%\n70–85%\nApps, digital goods\nGumroad\n10%\n90%\nDigital goods, creative files\nAudius\n10% (node operators)\n90%\nStreamed audio (blockchain)\n\n\nWhy 70/30 is the Sweet Spot: Sentio’s 30% commission is higher than Bandcamp (15%) but dramatically more generous than Splice (~50%) and the streaming economy (<1% effective payout). The 30% covers: marketplace infrastructure (Supabase, Meilisearch, CDN), payment processing (3–5%), preview rendering + watermarking, customer support, and Sentio’s operating margin. Importantly, Sentio’s infrastructure costs are ~99% lower than audio-streaming competitors because VibeBlocks are text, not audio.\n9.2 Marketplace Flywheel\nThe marketplace creates a self-reinforcing cycle: More creators → more/better CoreKits → more interesting VibeBlocks → more listeners (Radio) → more purchases → higher creator revenue → attracts more creators. The critical insight is that Radio is the discovery engine for the marketplace. Community Radio stations surface trending VibeBlocks to passive listeners, converting Explorers into Fans who then purchase blocks and CoreKits.\n9.3 Sentio Fridays\nInspired by Bandcamp Fridays (which generated $154M+ for artists since 2020), Sentio launches \"Vibe Fridays\"—a monthly event where Sentio’s 30% commission drops to 0%. Artists keep 100% of sales (minus Stripe’s ~3% processing). This drives concentrated marketplace activity, generates social media buzz, and builds goodwill with the creator community.\n\n10. Competitive Landscape\nCompetitor\nModel\nKey Strength\nKey Weakness\nSentio Advantage\nSuno\nCloud, $2.45B valuation, ~$200M ARR\nBest vocal synthesis, Warner deal\nCloud-only, copyright lawsuits, per-generation cost\nOn-device, zero compute cost, no litigation risk\nUdio\nCloud, settled with UMG/Warner\nStrong generation quality\nDownloads disabled, pivot away from creation\nFull ownership, download/remix/resell\nSplice\nCloud marketplace, 3M+ users\nLargest sample marketplace, $105M funded\nAudio files = expensive hosting, ~50% commission\nJSON text = near-zero hosting, 70/30 split\nEndel\nOn-device ambient, $22.5M funded\nApple Watch AOTY, biometric integration\nAmbient-only, no creation tools, no marketplace\nFull music creation + marketplace + collaboration\nBeatoven.ai\nCloud, Fairly Trained certified\nEthical positioning, licensed training data\nCloud-only, limited to background music\nOn-device + full genre range + marketplace\nWotja\nOn-device generative, 2-person team\n30-year history, cross-platform\nNiche audience, no marketplace, no AI/LLM\nLLM-powered natural language, marketplace, social\n\n\nCore Strategic Moat: Sentio is the only platform combining on-device AI generation (privacy + zero compute cost), a structured JSON asset format (enabling remixing, trading, and near-zero hosting costs), and a creator-first marketplace (70/30 split). No competitor has all three. Suno has the AI but not the privacy or marketplace. Splice has the marketplace but not the AI. Endel has on-device but not creation tools or commerce.\n\n11. Phased Roadmap (8-Week MVP Sprint)\nThe 2-month timeline demands ruthless prioritization. The MVP must prove the core thesis: on-device AI can generate musically coherent VibeBlocks from natural language, rendered locally from CoreKit samples, with a working marketplace for trading them.\nPhase 1: Foundation (Weeks 1–3)\nGoal: Core engine works on mobile. User can prompt → get music.\nIntegrate Qwen3 0.6B (Q4_K_M) via llama.rn with JSI bridge\nImplement GBNF grammar constraints for VibeBlock JSON schema\nBuild Foundation CoreKit (drums, bass, pads, FX across 4 genres)\nImplement Miniaudio + Signalsmith Stretch rendering pipeline\nWatermelonDB local storage for VibeBlocks and CoreKit manifests\nBasic UI: prompt input, playback controls, VibeBlock library\nExit Criteria: User types \"chill lo-fi beat\" → AI generates valid VibeBlock → audio plays within 3 seconds on iPhone 12.\nPhase 2: Marketplace + Radio (Weeks 4–6)\nGoal: Users can discover, buy, and sell VibeBlocks. Radio provides passive listening.\nSupabase backend: auth, marketplace index, real-time sync\nStripe Connect integration: purchase flow, creator payouts, split logic\nMeilisearch for marketplace discovery (mood, genre, BPM, key)\nPoisoned Preview system: server-side render + AudioSeal watermark\nLive Radio: Pure Generative + Community Radio station types\nCommission Founder’s Packs from 10 sound designers\nEd25519 key generation + VibeBlock signing on device\nExit Criteria: Full purchase flow works. Radio plays continuously for 1 hour without interruption. 50+ VibeBlocks live on marketplace.\nPhase 3: Social + Polish (Weeks 7–8)\nGoal: Campfire Mode works. Desktop Studio alpha. Ready for beta launch.\nCampfire Mode: same-platform P2P (iOS Multipeer / Android Nearby Connections)\nRemix flow: modify purchased VibeBlocks, publish with parent_id attribution\nTauri 2.0 desktop shell + llama.cpp server mode with ChatMusician 7B\nGhost Producer V1: drag folder → analyze → LoRA train → style-aligned generation\nFree/Pro tier gating, onboarding flow, analytics (PostHog, privacy-first)\nBug fixes, performance optimization, TestFlight / internal beta distribution\nExit Criteria: Beta-ready build. Campfire works in same room. Desktop generates VibeBlocks with 7B model. Ghost Producer trains successfully on 20-file folder.\nPost-MVP Roadmap (Months 3–12)\nMonth\nFeature\nPriority\n3–4\nVST3/AU sidecar for DAW integration (JUCE)\nHigh\n3–4\nCross-platform Campfire via WebRTC\nHigh\n4–5\nArtist Radio stations + Artist Kit marketplace\nHigh\n5–6\nIntelligent Stems (HT-Demucs + Basic Pitch)\nMedium\n5–6\nRAVE/BRAVE neural timbre transfer\nMedium\n6–8\nVibe Fridays (0% commission events)\nMedium\n6–8\nFan seeding / P2P CDN with micro-credit rewards\nMedium\n8–12\nQwen 2.5 32B integration for studio tier\nLow\n8–12\nMIDI-LLM 1.47B for direct MIDI export\nLow\n10–12\nEnterprise API + white-label partnerships\nLow\n\n\n12. Success Metrics & KPIs\nMetric\nMVP Target (Week 8)\nMonth 6 Target\nYear 1 Target\nTotal Downloads\n1,000\n50,000\n500,000\nDAU / MAU\n15% DAU/MAU ratio\n20%\n25%\nFree → Pro Conversion\n3%\n5%\n7%\nAvg Session Duration\n8 min\n15 min\n20 min\nMarketplace GMV\n$500\n$25,000/month\n$150,000/month\nCreator Payouts\n$350\n$17,500/month\n$105,000/month\nMarketplace Listings\n50 VibeBlocks\n2,000\n20,000\nActive Creators (sellers)\n10\n200\n2,000\nRadio Sessions / Day\n100\n5,000\n50,000\nCampfire Sessions / Week\n20\n500\n5,000\nAI Generation Latency (mobile)\n<3s (p95)\n<2s (p95)\n<1.5s (p95)\nApp Crash Rate\n<2%\n<0.5%\n<0.1%\n\n\n13. Risk Matrix & Mitigations\nRisk\nSeverity\nLikelihood\nMitigation\nAI output sounds bad / generic\nCritical\nMedium\nGBNF grammars enforce music-theory correctness. Foundation CoreKit quality is gate-kept. Ghost Producer personalizes output.\nMarketplace cold start (no content)\nHigh\nHigh\nFounder’s Packs from 10–20 commissioned sound designers. Sentio team creates seed content. Free tier generates organic content.\nMobile device overheating\nHigh\nMedium\nQwen3 0.6B Int4 is specifically optimized for mobile thermal envelopes. Background inference throttled. Audio rendering is lightweight (sample playback, not synthesis).\nCopyright claims against generated music\nHigh\nLow\nDeterministic rendering from licensed CoreKits = clear chain of title. Cryptographic audit trail. \"Audit Insurance\" positioning.\nApple/Google reject app or mandate IAP\nMedium\nMedium\nDesktop + web are primary purchase channels. Mobile uses IAP as fallback. Legal team monitors DMA/Epic case developments.\nCross-platform Campfire doesn’t work well\nMedium\nHigh\nV1 is same-platform only for offline. Cross-platform via shared WiFi. Set clear UX expectations.\nCompetitors copy JSON-recipe approach\nMedium\nLow\nFirst-mover network effects. Marketplace lock-in. CoreKit ecosystem moat. Patent strategy for GBNF grammar enforcement.\nUser confusion (too many concepts)\nMedium\nMedium\nOnboarding flow explains VibeBlock/CoreKit simply. Explorer persona sees minimal complexity—just mood → music.\n\n\n14. Appendices & Research References\nA. Key Research Papers\nMIDI-LLM: Adapting Large Language Models for Text-to-MIDI Music Generation (arXiv 2511.03942, Nov 2025)\nChatMusician: Understanding and Generating Music Intrinsically with LLM (m-a-p, HuggingFace)\nNotaGen: Pre-training + Fine-tuning + RL for Symbolic Music Generation (MIT License)\nMidiTok: A Python package for MIDI file tokenization (arXiv 2310.17202)\nRAVE: A variational autoencoder for fast and high-quality neural audio synthesis (IRCAM, ICLR 2022)\nBRAVE: Low-latency variant of RAVE for real-time instrumental interaction (March 2025)\nEmotion-driven Piano Music Generation via Two-stage Disentanglement (Huang et al., July 2024)\ntext2midi: Text-conditioned MIDI generation (AMAAI Lab, HuggingFace, Apache 2.0)\nB. Licensing Summary\nComponent\nLicense\nCommercial OK?\nRestrictions\nQwen3 0.6B\nApache 2.0\nYes\nNone\nChatMusician 7B\nMIT\nYes\nNone\nQwen 2.5 14B/32B\nApache 2.0\nYes\nNone\nMIDI-LLM 1.47B\nLlama Community\nYes\n<700M MAU\nllama.cpp / llama.rn\nMIT\nYes\nNone\nMiniaudio\nMIT-0\nYes\nNone (public domain equivalent)\nSignalsmith Stretch\nMIT\nYes\nNone\nTauri 2.0\nMIT/Apache 2.0\nYes\nNone\nSupabase\nApache 2.0\nYes\nSelf-hosted or cloud\nMeilisearch\nMIT\nYes\nNone\nHT-Demucs\nMIT\nYes\nNone\nUnsloth\nApache 2.0\nYes\nNone\nJUCE (VST3)\nCommercial License\nYes\nRequires paid license for closed-source\n\n\nC. Document History\nVersion\nDate\nAuthor\nChanges\nv1–v5\nDec 2025\nVimo\nInitial concept through marketplace architecture\nv6\nDec 23, 2025\nVimo\nPremium Curated Marketplace pivot, Sentio Pulse wearable\nv7–v9\nDec 26–31, 2025\nVimo\nTechnical validation, Qwen3 selection, audio engine refinement\nv10\nJan 2, 2026\nVimo\n\"Sovereign Instrument\" vision, Vibe Economy architecture\nv11\nFeb 3, 2026\nVimo + Claude\nFull ecosystem PRD: marketplace deep dive, Live Radio, Campfire Mode, business model, model strategy, 8-week roadmap\n\n\n───  END OF DOCUMENT  ───",
  "status": "active",
  "created_at": "2026-02-12T13:00:05.431Z",
  "updated_at": "2026-02-12T13:14:07.735Z",
  "pipeline": {
    "current_phase": "concept",
    "phases": {
      "concept": {
        "phase": "concept",
        "sub_state": "review",
        "started_at": "2026-02-12T13:00:05.434Z",
        "step": "council_review"
      }
    },
    "run_id": "pipeline-1770901205434-0whr",
    "updated_at": "2026-02-12T13:14:07.734Z"
  },
  "phase": "concept",
  "concept_thread_id": "thread-20260212-205438",
  "artifacts": {
    "refined_concept": "# Sentio AI Concept Summary\n\n## 1. Problem Statement\nThe music industry operates a broken value chain where centralized streaming platforms use pro-rata payout models that incentivize bot farms and \"AI slop\" over genuine artistry. Independent artists face a \"path to pennies\"—investments of $100K+ into albums return as little as $1,200 in streaming royalties over 18 months (~$0.003/stream). Identity verification failures enable fraud, 30% platform taxes extract value from every transaction, and cloud-based AI music tools expose creators to copyright litigation risk and computational costs that don't scale.\n\n## 2. Target Users\n\n- **The Explorer** (16-35): Casual music consumer, no musical training, discovers through social media, wants to feel something without fiddling with knobs\n- **The Artist** (20-40): Independent musician/producer frustrated by streaming payouts, needs to own their sound and get paid fairly, has 1K-100K followers\n- **The Producer** (22-45): Semi-pro to professional, uses DAWs daily, needs precision tools that integrate with existing workflow\n- **The Fan** (14-30): Collects digital goods, values exclusivity and community, wants to collect, remix, and share favorite artists' vibes\n\n## 3. Proposed Solution\n\nA **local-first generative audio ecosystem** that fundamentally restructures music distribution by streaming JSON instruction sets (VibeBlocks, <10KB) instead of audio files (50MB)—a >1,000x data reduction. On-device AI models translate natural language and emotional intent into deterministic, royalty-free music compositions rendered locally from licensed sample libraries (CoreKits). This architecture eliminates cloud compute costs, ensures complete user privacy (no prompts leave the device), and provides cryptographic proof of authorship via Ed25519 signatures.\n\n**Core mechanism**: User prompts \"rainy Sunday morning\" → Qwen3 0.6B generates VibeBlock JSON → local audio engine renders music from CoreKit samples → result is ownable, remixable, and tradeable.\n\n## 4. Key Features\n\n- **VibeBlocks**: JSON instruction sets (<10KB) that define complete musical ideas—the atomic tradeable unit\n- **CoreKits**: Curated, licensed sample libraries stored locally (Foundation/Genre/Artist/Ghost Producer variants)\n- **Sentio Mobile** (The Performer): Natural language music generation, marketplace browsing, remix tools, Live Radio\n- **Sentio Studio Desktop** (The Composer): Multi-model workflows, Ghost Producer style transfer via LoRA, VST3/AU DAW integration, stem separation\n- **Vibe Marketplace**: Creator-first economy with 70/30 revenue split, royalty attribution chains for remixes, anti-piracy via \"poisoned previews\"\n- **Live Radio**: Infinite generative streaming with real-time style nudging, entirely on-device\n- **Campfire Mode**: P2P mesh networking for offline artist drops, collaborative jams, and fan-driven distribution\n- **Ghost Producer**: LoRA fine-tuning to capture a user's creative signature and generate in their style\n\n## 5. Differentiation\n\nSentio is the **only platform combining**:\n- **On-device AI generation** (privacy + zero cloud compute cost)\n- **Structured JSON asset format** (enables remixing, trading, near-zero hosting costs)\n- **Creator-first marketplace** (70/30 split vs. industry standard ~50% or streaming's <1%)\n\n**vs. Suno/Udio**: Local-first (no cloud lock-in), full ownership, no copyright lawsuits  \n**vs. Splice**: JSON text storage (99% cheaper than audio hosting), better creator economics  \n**vs. Endel**: Full music creation + marketplace + collaboration (not just ambient)  \n**vs. Streaming**: Artists earn 70% not 0.3%, fans own assets forever not rent access\n\nCore strategic moat: **Deterministic rendering from licensed CoreKits = clear chain of title**, solving the existential copyright risk that has crippled cloud AI music competitors.\n\n## 6. Success Criteria\n\n**MVP (Week 8)**: 1,000 downloads, 15% DAU/MAU, 3% free→Pro conversion, $500 marketplace GMV, <3s generation latency  \n**Month 6**: 50,000 downloads, 20% DAU/MAU, 5% conversion, $25K/month GMV, 2,000 marketplace listings  \n**Year 1**: 500,000 downloads, 25% DAU/MAU, 7% conversion, $150K/month GMV, 20,000 listings, 2,000 active creators\n\n**Qualitative**: Artist monthly marketplace revenue exceeds their Spotify royalties within 6 months. Producers integrate Sentio Studio into daily workflow. Fans purchase >3 items/month and create >5 remixes/month.\n\n## 7. Scope & Constraints\n\n**In Scope (8-week MVP)**:\n- Mobile app with Qwen3 0.6B on-device inference\n- Foundation CoreKit + GBNF grammar-constrained generation\n- Marketplace backend (Supabase, Stripe Connect, Meilisearch)\n- Live Radio (2 station types: Pure Generative + Community)\n- Campfire Mode (same-platform P2P only)\n- Desktop Studio alpha with ChatMusician 7B + Ghost Producer V1\n\n**Out of Scope (Post-MVP)**:\n- Cross-platform Campfire (requires WebRTC)\n- VST3/AU sidecar for DAW integration\n- Advanced models (32B for studio tier)\n- MIDI-LLM integration for direct MIDI export\n- Enterprise API + white-label partnerships\n\n**Key Constraints**:\n- GPL-free software stack (commercial sovereignty)\n- <400MB mobile app download size\n- <3s generation latency on iPhone 12-class hardware\n- Must comply with App Store requirements while minimizing IAP commissions via external payment links (Epic ruling) and DMA (EU)",
    "selected_council": [
      {
        "agent_name": "Music Copyright & Sample Licensing Specialist",
        "role": "Intellectual Property Risk Assessment",
        "focus": "Evaluates whether the 'licensed CoreKit + deterministic rendering' model actually provides legal safe harbor against copyright claims, and whether the royalty attribution chain for remixes is enforceable. This is the existential risk that has destroyed Suno/Udio's ability to scale commercially.",
        "evaluation_criteria": [
          "CoreKit licensing enforceability (can sample library licenses survive user-generated remixes and resale?)",
          "Chain of title clarity (does JSON provenance actually prove authorship in court?)",
          "Marketplace liability exposure (is platform responsible for user-uploaded infringing VibeBlocks?)",
          "Remix royalty attribution feasibility (can 70/30 split cascade through derivative works without breaking?)",
          "Regulatory compliance across jurisdictions (DMCA safe harbor, EU DSM Directive Article 17)"
        ]
      },
      {
        "agent_name": "On-Device AI Performance Engineer",
        "role": "Edge Inference Feasibility",
        "focus": "Assesses whether the promised <3s latency on iPhone 12-class hardware with 0.6B-7B models is achievable at acceptable quality levels, and whether the <400MB app size constraint is compatible with model weights + CoreKit storage. Battery drain and thermal throttling on sustained use (Live Radio) are critical failure modes.",
        "evaluation_criteria": [
          "Model size vs. output quality trade-off (will 0.6B Qwen3 produce music users actually want?)",
          "Inference optimization viability (quantization, GGML/Core ML performance on target hardware)",
          "Storage architecture feasibility (CoreKit compression, on-demand loading, update delivery)",
          "Battery and thermal sustainability (can Live Radio run for hours without killing the device?)",
          "Cross-platform consistency (Android/iOS fragmentation, chipset variance)"
        ]
      },
      {
        "agent_name": "Creator Monetization & Marketplace Liquidity Analyst",
        "role": "Platform Economics Validation",
        "focus": "Evaluates whether the 70/30 revenue split and GMV targets ($500 week 8 → $150K/month year 1) are realistic given the intangible nature of JSON instruction sets vs. traditional audio files, and whether artists will actually earn more than Spotify within 6 months. Cold-start problem for two-sided marketplaces is a known killer.",
        "evaluation_criteria": [
          "Pricing psychology for VibeBlocks (will users pay for <10KB JSON when piracy is trivial?)",
          "Anti-piracy effectiveness ('poisoned previews' and Ed25519 signatures vs. screenshot/screen-record)",
          "Creator acquisition cost vs. lifetime value (can you get 2,000 active creators at realistic CAC?)",
          "Marketplace liquidity bootstrapping (how do you solve chicken-egg with no buyers or sellers at launch?)",
          "Competitive creator economics (does 70% of $2.99 VibeBlock beat Spotify $0.003/stream in practice?)"
        ]
      },
      {
        "agent_name": "Mobile Platform & Distribution Risk Manager",
        "role": "App Store Compliance & Platform Lock-In",
        "focus": "Assesses exposure to Apple/Google policy changes that could kill the business model—particularly external payment links (Epic precedent is fragile), content moderation requirements for user-generated music, and GPL-free stack constraints. Platform rejection at launch or retroactive policy enforcement are existential risks.",
        "evaluation_criteria": [
          "App Store review risk (does AI music generation violate content policy? What about user-uploaded samples?)",
          "In-app purchase circumvention sustainability (will Apple/Google close external payment loopholes?)",
          "Platform commission exposure (if forced back to 30% IAP, does the 70/30 creator split collapse?)",
          "GPL contamination risk (is the 'GPL-free' constraint actually achievable with LLaMA derivatives, audio libs?)",
          "Update velocity vs. review latency (can you ship model improvements without week-long approval delays?)"
        ]
      },
      {
        "agent_name": "Music Production Quality & Workflow Integration Specialist",
        "role": "Creative Tool Viability Assessment",
        "focus": "Evaluates whether the output quality from on-device models meets the emotional/aesthetic bar for the Explorer persona and the technical bar for the Producer persona. Can JSON instruction sets actually compete with traditional DAW workflows, or is this a toy that professionals will ignore?",
        "evaluation_criteria": [
          "Subjective quality benchmarking (does output from 0.6B Qwen3 sound 'good enough' vs. Spotify baseline?)",
          "Professional workflow integration (will VST3/AU sidecar actually get adopted, or is this friction too high?)",
          "Creative control granularity (can Producers get the precision they need from natural language + JSON?)",
          "Genre/style coverage (can Foundation CoreKit serve all target personas, or do you need 50+ genre kits?)",
          "Remix fidelity preservation (do VibeBlock modifications degrade quality, or maintain original intent?)"
        ]
      }
    ],
    "council_progress": {
      "started_at": "2026-02-12T13:10:44.286Z",
      "agents": [
        {
          "agent_name": "Music Copyright & Sample Licensing Specialist",
          "status": "completed",
          "started_at": "2026-02-12T13:10:44.295Z",
          "completed_at": "2026-02-12T13:12:05.736Z",
          "evaluation": {
            "agent_name": "Music Copyright & Sample Licensing Specialist",
            "score": 4,
            "reasoning": "The 'licensed CoreKit + deterministic rendering' model addresses some copyright risks but contains critical legal vulnerabilities that could still result in existential litigation exposure:\n\n**CoreKit Licensing Enforceability (CRITICAL FLAW):** Standard sample library licenses explicitly prohibit the core business model. Most commercial sample licenses (Splice, Loopmasters, etc.) forbid: (1) reselling samples in recognizable form, (2) creating derivative sample libraries, (3) transferring usage rights to third parties. When users sell VibeBlocks referencing CoreKit samples, they're arguably violating these restrictions. Ed25519 signatures prove WHO created the JSON, not WHETHER they had legal right to commercialize those samples. The 'clean chain of title' claim conflates cryptographic provenance with legal licensing rights.\n\n**Platform Liability (MAJOR GAP):** Under EU DSM Directive Article 17, Sentio would NOT qualify for safe harbor as an 'online content-sharing service provider.' The directive explicitly removed protection for platforms hosting user-uploaded content unless they obtain licenses OR implement 'best efforts' prevention. The marketplace model creates direct liability exposure. DMCA safe harbor requires designated agent registration, takedown procedures, and repeat infringer policies—none explicitly addressed. The document mentions watermarking but no compliance infrastructure.\n\n**Remix Royalty Attribution (LEGALLY UNENFORCEABLE):** The 50/20/30 cascading split is a platform policy, not copyright law. Problems: (1) Doesn't address whether remix creator legally had right to make derivative work, (2) No mechanism to verify remixer obtained permission from original creator, (3) Unenforceable if user sells remix off-platform, (4) Doesn't account for separate composition vs. recording copyrights, (5) Maximum 5-level chain depth is arbitrary and may not satisfy actual rights holders.\n\n**Chain of Title (INSUFFICIENT):** JSON provenance with cryptographic signatures proves creation timestamp and authorship but NOT: (1) Copyright ownership, (2) License compliance, (3) Rights to create derivatives, (4) Rights to commercialize. A court would require actual license documentation, permissions, and chain of title evidence—not just blockchain-style signatures. The 'Audit Insurance' positioning is legally misleading.\n\n**Regulatory Compliance Gaps:** (1) No mention of mechanical licensing for musical compositions, (2) No PRO (ASCAP/BMI/SESAC) licenses for public performance, (3) Ghost Producer LoRA training on user audio creates liability if users don't own training data rights, (4) No content moderation system for detecting unlicensed samples in user-uploaded CoreKits, (5) Cross-border sales complicate jurisdiction and applicable law.\n\n**Compared to Suno/Udio:** While Suno/Udio face direct training data infringement claims, Sentio's marketplace liability may be equally existential. The shift from 'AI trained on copyrighted music' to 'users trading recipes using licensed samples' doesn't eliminate liability—it redistributes it across users AND platform. Every marketplace transaction creates potential license violation and platform facilitation liability.\n\n**Partial Strengths:** On-device generation limits server-side evidence exposure. Clear sample attribution is better than black-box AI. Deterministic rendering enables verification. Foundation Kit (if properly licensed) reduces some risk. But these don't address the core marketplace licensing conflict.",
            "concerns": [
              "Sample library licenses typically prohibit resale/redistribution—CoreKit marketplace model likely violates standard licensing terms",
              "Ed25519 signatures prove authorship but NOT license rights or copyright ownership—'chain of title' claim is cryptographically sound but legally insufficient",
              "EU Article 17 removes safe harbor for content-sharing platforms—requires licenses or 'best efforts' prevention not evidenced in architecture",
              "No DMCA compliance infrastructure described (designated agent, takedown procedures, repeat infringer policy)",
              "Remix royalty splits are contractual obligations within platform but don't address underlying derivative work rights under copyright law",
              "Ghost Producer LoRA training creates secondary liability if users train on audio they don't own rights to",
              "No mechanical licensing strategy for musical compositions (separate from recording rights)",
              "Marketplace enables users to upload custom CoreKits with no verification those samples are properly licensed",
              "70/30 revenue split assumes platform can legally facilitate these transactions—may be moot if underlying licenses prohibit the use case",
              "International sales across jurisdictions with different copyright regimes (US DMCA vs EU Article 17 vs others) creates compliance complexity not addressed"
            ]
          }
        },
        {
          "agent_name": "On-Device AI Performance Engineer",
          "status": "completed",
          "started_at": "2026-02-12T13:10:44.305Z",
          "completed_at": "2026-02-12T13:12:35.831Z",
          "evaluation": {
            "agent_name": "On-Device AI Performance Engineer",
            "score": 3,
            "reasoning": "The on-device AI performance claims are severely optimistic and contain critical feasibility gaps that threaten the entire product thesis:\n\n**Model Quality vs. Size (Critical Flaw)**: A 0.6B parameter model is fundamentally too small for creative music generation that users will want. While GBNF grammars constrain output to valid JSON, they cannot compensate for lack of musical understanding. ChatMusician needs 7B parameters trained on 4B music tokens specifically because music composition requires deep pattern knowledge. The PRD acknowledges this by requiring 7B-32B models for 'complex compositions' on desktop, yet expects mobile users to be satisfied with 10x smaller model output. Result: Likely produces repetitive, template-filled outputs that feel robotic.\n\n**Latency Claims Are Mathematically Impossible**: The PRD claims <3s total latency with '<200ms AI response time' for Qwen3 0.6B. However, the VibeBlock JSON schema shown requires 100-300+ tokens of structured output (tracks, patterns, FX chains, automation). At realistic mobile inference speeds (20-30 tokens/sec for Q4 quantized models), this requires 3-15 seconds of generation time alone—before adding GBNF grammar validation overhead (20-50% penalty) and audio rendering. First-token latency might hit 200ms, but complete VibeBlock generation will take 5-20 seconds on iPhone 12.\n\n**Storage Constraint Already Violated**: The PRD mentions '<400MB app size' but their own specifications total 477-597MB minimum (397MB model + 50-150MB Foundation CoreKit + 30-50MB app binary). iOS warns users about >200MB cellular downloads. This forces either: (1) Breaking the constraint, or (2) Making Foundation CoreKit a post-install download, degrading first-time UX.\n\n**Live Radio Is Thermally Unsustainable**: The 'killer feature' of hours-long continuous AI-generated radio cannot work on mobile hardware. The pipeline requires generating Block N+1 while N plays, meaning sustained LLM inference for hours. Reality check: iPhone 12 (2815mAh battery) running continuous inference at 1-3W = 3-10 hour battery drain from AI alone. Thermal throttling will begin within 5-15 minutes of sustained load, reducing A14 performance to ~70%, breaking the generation pipeline faster than playback, causing gaps. The PRD provides zero mitigation strategy for this physics problem.\n\n**Cross-Platform Fragmentation Ignored**: The PRD assumes uniform performance but Android reality is brutal: flagship Snapdragon chips might match iPhone 12, but mid-range devices (50%+ of Android market) will be 50-70% slower. Budget Android phones may not run the model at all with 4GB RAM after OS overhead. The '5 VibeBlocks/day' free tier limit seems designed to hide performance problems.\n\n**Inference Stack Unvalidated**: Critical dependency on llama.rn with JSI bridge for GBNF grammar support is mentioned but not validated. Does llama.rn actually support GBNF? Performance benchmarks? The entire product relies on constrained generation working efficiently on mobile—this needs proof-of-concept before claiming feasibility.\n\n**What Could Work**: The desktop Studio app (Tauri + 7B+ models + GPU) is feasible. The marketplace economics (JSON vs. audio files) are sound. But the mobile experience—which is the primary user entry point—will likely ship as a frustrating, battery-draining app that produces mediocre music slowly.",
            "concerns": [
              "0.6B model will produce musically repetitive/simplistic outputs that fail to attract/retain users—no amount of GBNF constraints can compensate for insufficient musical knowledge in the weights",
              "Actual generation latency will be 5-20 seconds (not <3s), making the 'instant gratification' value prop false and UX feel sluggish compared to cloud competitors like Suno",
              "Live Radio thermal/battery sustainability is physically impossible—sustained inference for hours will drain battery in 3-10 hours and throttle performance within 15 minutes, causing playback gaps",
              "App size already exceeds stated constraint (477-597MB vs. <400MB), forcing users onto WiFi for initial download and limiting distribution",
              "Android mid-range device performance will be 50-70% slower than iPhone 12 baseline, creating severe UX fragmentation that damages brand and drives refunds",
              "llama.rn + GBNF grammar support is unvalidated critical dependency—if grammar constraints don't work efficiently or at all, the entire deterministic generation thesis collapses",
              "CoreKit storage management not designed—users accumulating GBs of samples over months with no compression/cleanup strategy will hit device limits",
              "No fallback strategy when on-device generation is too slow—competitors fall back to cloud, but Sentio's privacy-first positioning boxes them in"
            ]
          }
        },
        {
          "agent_name": "Creator Monetization & Marketplace Liquidity Analyst",
          "status": "completed",
          "started_at": "2026-02-12T13:10:44.316Z",
          "completed_at": "2026-02-12T13:12:07.209Z",
          "evaluation": {
            "agent_name": "Creator Monetization & Marketplace Liquidity Analyst",
            "score": 4,
            "reasoning": "The 70/30 split and GMV targets face five critical structural challenges that make the projections highly optimistic:\n\n**1. Pricing Psychology - Fundamental Mismatch (Score: 3/10)**\nThe '$0.99 convenience rule' cited from Steam/iTunes breaks down here because those ecosystems sold *finished, consumable products* (games, songs). VibeBlocks are *intermediate goods* - JSON recipes requiring CoreKits to render. The value proposition is muddled: am I buying music or buying code? Comparable markets show harsh realities:\n- Sample packs on Splice: $7.99-29.99 for hundreds of sounds\n- Bandcamp tracks: $1-15 for finished, portable audio\n- VibeBlocks at $0.49-2.99 for <10KB JSON that requires proprietary software is competing against 'right-click save' culture for code/recipes. The 'poisoned preview' assumes buyers can't just screen-record the 30s audio preview and loop it, or train their own AI to generate similar vibes from the preview. Crypto/NFT markets proved people won't pay for easily-reproducible digital scarcity without strong social signaling value.\n\n**2. Anti-Piracy - Trivially Circumventable (Score: 2/10)**\nAudioSeal watermarking at -15dB will survive lossy compression, but the threat model is wrong:\n- Screen recording bypasses watermarks entirely (analog hole)\n- The JSON itself, once purchased by one user, can be shared on Discord/Pastebin\n- Ed25519 signatures prove authorship but don't prevent distribution - you can verify the creator while still pirating it\n- CoreKits (the actual valuable audio assets) will leak - 50-150MB files shared via BitTorrent are the real piracy vector, not 10KB JSON\n- 'Vibe Match' deterrence assumes AI can't work around watermarks, but adversarial training defeats audio watermarks routinely\n\n**3. Creator CAC/LTV - Underwater Unit Economics (Score: 4/10)**\nTarget: 2,000 active creators by Year 1. Math doesn't work:\n- Projected marketplace GMV Year 1: $150K/month = $1.8M annual\n- At 70% to creators: $1.26M total creator earnings\n- Divided by 2,000 creators: $630/creator/year average\n- Top 1% will earn 50%+ of that, meaning median creator earns <$200/year\n- Compare to Gumroad (10% commission): median creator makes $0. Top 1% makes $100K+\n- Creator CAC via content marketing: $50-200 per acquisition\n- At $630 LTV with 30% churn, payback is 3-12 months IF they stay active\n\nThe 'beat Spotify in 6 months' claim requires each artist to sell only 250 VibeBlocks at $2.99 (70% = $2.09) to match $500 Spotify royalties. But with 2,000 creators competing, that's 500,000 total sales, or 42,000/month - requiring 140,000+ marketplace visitors/month at 30% conversion (impossible) or 1.4M at 3% (realistic but enormous for Year 1).\n\n**4. Marketplace Liquidity - Cold Start Death Spiral (Score: 3/10)**\nThe 'Founder's Packs' strategy (10-20 commissioned designers) is insufficient:\n- Splice launched with 100,000+ samples from established labels\n- Bandcamp succeeded because artists brought existing fanbases\n- Sentio asks artists to create in a new format (VibeBlocks) with no installed base\n- Network effects are negative early: few buyers → low creator revenue → creators leave → even fewer buyers\n- Radio as discovery only works if generated music is *good enough* that listeners buy the recipe to modify it - but if Radio already gave them infinite music, why buy?\n- Campfire Mode (P2P distribution) cannibalizes marketplace sales by enabling free viral spread\n\n**5. Competitive Creator Economics - Overstated (Score: 5/10)**\nThe Spotify comparison is real ($0.003-0.004/stream is accurate), but:\n- Artists on Spotify can reach 100M+ listeners; Sentio Year 1 maybe reaches 50K\n- Spotify is *discovery*; artists make money from tours/merch afterward\n- 70% of $2.99 = $2.09 per VibeBlock vs. $3-4 per 1,000 streams means artist needs to sell 1 VibeBlock per 1,500 streams to break even. BUT: streams are passive (playlist inclusion = scale), sales require active buyer intent (much harder)\n- Bandcamp (85-90% split) is the real competition, and they have 15 years of network effects\n- Audius (blockchain, 90% to artists) failed to gain traction despite better economics\n\nBetter economics ≠ user adoption. MySpace paid better than Facebook; failed anyway.\n\n**GMV Projection Reality Check:**\n- Week 8 target: $500 GMV (3-5 high-value sales total) - achievable with beta testers\n- Month 6: $25K/month requires ~10,000 transactions at $2.50 avg - needs 30K+ MAU at 33% purchase rate (Bandcamp is ~5%) or 200K MAU at realistic 5% rate\n- Year 1: $150K/month = $1.8M annual GMV requires 60K monthly transactions - comparable to a mid-tier Gumroad creator, but spread across an entire marketplace\n\n**What Could Work:**\nThe technology is sound. The user experience is innovative. But the revenue model confuses *tools* (should be SaaS subscription) with *assets* (marketplace commodities). Successful path:\n1. Focus on subscriptions ($9.99-24.99/mo) as primary revenue - predictable, scales with users\n2. Marketplace as secondary - takes pressure off cold start\n3. Price VibeBlocks at $0.00-0.49 to drive virality, upsell CoreKits at $9.99-49.99\n4. Make Ghost Producer Kits the premium item ($99-499) - real scarcity, high value\n5. Partner with 3-5 mid-tier artists (50K-500K followers) for launch exclusives\n\nWithout these pivots, you'll hit $500 Week 8, struggle to $5K by Month 6 (not $25K), and cap at $30K-50K/month by Year 1 as liquidity never materializes.",
            "concerns": [
              "VibeBlocks are intermediate goods (recipes) not finished products - pricing psychology from Steam/iTunes doesn't transfer to code/JSON artifacts",
              "Anti-piracy relies on watermarking audio previews, but screen recording (analog hole) and JSON sharing on forums defeats the entire model",
              "Creator unit economics are underwater: $630 average annual earnings won't retain 2,000 creators when median is <$200 after power law distribution",
              "Cold start strategy (10-20 Founder's Packs) is 100-1000x too small compared to successful sample marketplaces like Splice (100K+ samples at launch)",
              "GMV targets require 200K+ MAU by Month 6 (for $25K GMV at 5% conversion) but projected user acquisition is 50K total - 4x shortfall",
              "Marketplace cannibalization: Live Radio gives infinite free music, Campfire Mode enables P2P viral spread - both reduce purchase intent",
              "Spotify revenue comparison ignores scale asymmetry: artists can reach 100M listeners on Spotify vs maybe 50K on Sentio Year 1",
              "Bandcamp (15% commission, 85% to creators) with 15 years of network effects is the real competitor, not Spotify - and Sentio is worse deal than Bandcamp",
              "Two-sided marketplace with zero installed base asking creators to produce in new format (VibeBlocks) without existing audience is highest-risk cold start scenario",
              "Revenue model confusion: treats creation tools (should be SaaS) as marketplace commodity, creating misaligned incentives"
            ]
          }
        },
        {
          "agent_name": "Mobile Platform & Distribution Risk Manager",
          "status": "completed",
          "started_at": "2026-02-12T13:10:44.328Z",
          "completed_at": "2026-02-12T13:13:00.404Z",
          "evaluation": {
            "agent_name": "Mobile Platform & Distribution Risk Manager",
            "score": 4,
            "reasoning": "Sentio faces severe structural platform risks that could cripple the business model at multiple points. The payment routing strategy is built on legally fragile assumptions—the Epic v Apple 'external payment link' ruling remains contested, with Apple imposing 27% commissions on external transactions that render the economics unworkable. The EU DMA offers a path but requires 10-12% Apple fees plus Core Technology Fee exposure. If forced to standard IAP (15-30%), the 70/30 creator split collapses mathematically: 30% Apple + 3% Stripe = 33% total take, leaving negative 3% for Sentio operations. The mitigation—driving users to desktop/web purchases—is unproven and fights platform UX gravity. On content policy: AI music generation exists in a policy gray zone. While on-device generation with licensed CoreKits provides legal cover, the 'Ghost Producer' feature allowing users to upload their own audio for style training creates an unmoderated content pipeline that Apple will likely flag under App Store Review Guideline 1.2 (user-generated content requires moderation). The 'Campfire Mode' P2P distribution of VibeBlocks could be interpreted as sideloading digital goods, violating IAP requirements. GPL risk appears managed (MIT/Apache stack), but audio library dependency chains are notoriously complex—one transitive GPL dependency contaminates the entire commercial license. Update velocity is structurally disadvantaged: server-side competitors (Suno, Udio) ship model improvements instantly; Sentio requires 1-7 day App Store review for every model update, creating a permanent innovation lag. The core architectural bet—on-device inference—is the source of both the privacy value prop AND the platform lock-in vulnerability.",
            "concerns": [
              "Payment routing strategy assumes Epic v Apple outcomes (April 2025 ruling, external links) that are legally contested and may never materialize as described; Apple's 27% external purchase commission makes the math unworkable",
              "If forced to standard IAP (even 15% Small Business rate), the 70/30 creator split is mathematically impossible: 15% Apple + 3% Stripe = 18% total cost, leaving only 12% for operations and creator payouts",
              "Ghost Producer feature (user-uploaded audio training) creates unmoderated content pipeline that violates App Store Guideline 1.2 requirement for user-generated content moderation systems",
              "Campfire Mode P2P distribution of purchasable digital goods (VibeBlocks) likely violates IAP requirements—Apple may classify this as sideloading/circumvention",
              "On-device model architecture means every model improvement requires App Store review (1-7 days), creating permanent competitive disadvantage vs. server-side competitors who ship updates instantly",
              "Marketplace 'Remix' chain and royalty attribution system may be flagged as cryptocurrency/blockchain-adjacent (immutable ledger, split payments) triggering additional review scrutiny",
              "GPL contamination risk understated: audio processing chains have complex dependency trees; one transitive GPL dependency contaminates entire commercial license",
              "'Founder's Packs' commissioning strategy frontloads content moderation risk—if any commissioned CoreKit contains unlicensed samples, Apple liability concerns trigger rejection",
              "No contingency plan if Apple/Google classify AI-generated music as requiring explicit content warnings or age-gating (precedent: AI chatbot apps now require 17+ rating)",
              "Desktop/web purchase promotion mitigation assumes users will friction-switch platforms for transactions—historically, mobile-first users stay mobile despite price incentives (see: Fortnite user retention post-store removal)"
            ]
          }
        },
        {
          "agent_name": "Music Production Quality & Workflow Integration Specialist",
          "status": "completed",
          "started_at": "2026-02-12T13:10:44.348Z",
          "completed_at": "2026-02-12T13:12:05.200Z",
          "evaluation": {
            "agent_name": "Music Production Quality & Workflow Integration Specialist",
            "score": 5,
            "reasoning": "Sentio presents an architecturally clever approach—generating JSON instructions rather than audio—but this creates a critical quality paradox: the system is only as good as its CoreKit samples, yet the PRD provides zero technical specifications for sample recording, mixing, or mastering standards. A 0.6B general-purpose LLM (Qwen3) generating musically coherent compositions is unproven at scale; while GBNF grammars enforce syntactic validity, they cannot guarantee aesthetic quality. The Foundation CoreKit at 50–150MB cannot compete with professional libraries (Kontakt/Splice offerings are 10–100GB) across 'all genres'—this is impossibly broad. For the Explorer persona, lo-fi/ambient/background music may clear the emotional bar, but for the Producer persona, this faces a steep credibility gap: why abandon Ableton + Splice for a sidecar process with unknown sample quality? The VST3/AU integration adds workflow friction without a clear value proposition—producers already have sample libraries and MIDI sequencers. The Ghost Producer (LoRA style transfer) is genuinely innovative, but HT-Demucs stem separation and Basic Pitch audio-to-MIDI have known accuracy limitations that will frustrate professionals expecting precision. Genre coverage claims are unrealistic: 30–100MB Genre Kits cannot match specialized libraries (e.g., a single snare drum multi-sample in pro libraries can be 500MB). Remix fidelity depends on Signalsmith Stretch quality, which degrades under extreme tempo/pitch shifts. The marketplace could solve the sample quality problem long-term through crowdsourcing, but the cold start with 'Founder's Packs' is a massive execution risk. The deterministic JSON format is brilliant for collaboration/versioning, but the listening experience quality remains unvalidated.",
            "concerns": [
              "Zero technical specs for CoreKit sample quality (recording standards, bit depth, mixing/mastering). Professional producers need 24-bit/96kHz multi-sampled instruments with round-robin and velocity layers—no evidence this exists.",
              "0.6B LLM generating musically coherent compositions is unproven. No FAD scores, no MUSHRA tests, no blind A/B comparisons vs. human-composed music. GBNF grammars enforce syntax, not aesthetics.",
              "Foundation CoreKit at 50–150MB for 'all genres' is orders of magnitude smaller than professional libraries. Splice has 5M+ samples; Output Arcade is 30GB+. Cannot compete on breadth or depth.",
              "VST3/AU sidecar integration introduces workflow friction without clear win over existing tools. Producers already use Splice/Arcade/Loopcloud inside their DAWs. Why switch to out-of-process JSON generation?",
              "Creative control granularity gap: natural language → JSON is lossy. How does a producer specify sample-accurate timing, precise velocity curves, per-note articulations? No MIDI controller/MPE/hardware sequencer integration mentioned.",
              "Stem separation (HT-Demucs) and audio-to-MIDI (Basic Pitch) have known accuracy limitations. Professionals will be frustrated by artifacts, missed transients, incorrect pitch detection.",
              "Genre/style coverage requires 50+ specialized kits to serve diverse Producer needs (jazz, trap, orchestral, ethnic, experimental). Marketplace cold start is brutal—needs critical mass of high-quality creator submissions.",
              "Remix fidelity preservation: changing BPM/key re-renders from samples via time-stretch/pitch-shift. Signalsmith Stretch is excellent but not magic—extreme changes (85→140 BPM) degrade quality noticeably.",
              "No AAX support (Pro Tools industry standard). Desktop-only Ghost Producer excludes mobile-first producers (huge growth segment in hip-hop/electronic).",
              "Quality perception risk: if 0.6B model output sounds 'generic' or 'AI-slop', the Explorer persona churns and the Product persona never adopts. The entire thesis rests on unvalidated sample quality + untested compositional AI."
            ]
          }
        }
      ],
      "synthesis_status": "completed",
      "completed_count": 5,
      "total_count": 5
    },
    "council_verdict": {
      "recommendation": "reject",
      "overall_score": 4,
      "evaluations": [
        {
          "agent_name": "Music Copyright & Sample Licensing Specialist",
          "score": 4,
          "reasoning": "The 'licensed CoreKit + deterministic rendering' model addresses some copyright risks but contains critical legal vulnerabilities that could still result in existential litigation exposure:\n\n**CoreKit Licensing Enforceability (CRITICAL FLAW):** Standard sample library licenses explicitly prohibit the core business model. Most commercial sample licenses (Splice, Loopmasters, etc.) forbid: (1) reselling samples in recognizable form, (2) creating derivative sample libraries, (3) transferring usage rights to third parties. When users sell VibeBlocks referencing CoreKit samples, they're arguably violating these restrictions. Ed25519 signatures prove WHO created the JSON, not WHETHER they had legal right to commercialize those samples. The 'clean chain of title' claim conflates cryptographic provenance with legal licensing rights.\n\n**Platform Liability (MAJOR GAP):** Under EU DSM Directive Article 17, Sentio would NOT qualify for safe harbor as an 'online content-sharing service provider.' The directive explicitly removed protection for platforms hosting user-uploaded content unless they obtain licenses OR implement 'best efforts' prevention. The marketplace model creates direct liability exposure. DMCA safe harbor requires designated agent registration, takedown procedures, and repeat infringer policies—none explicitly addressed. The document mentions watermarking but no compliance infrastructure.\n\n**Remix Royalty Attribution (LEGALLY UNENFORCEABLE):** The 50/20/30 cascading split is a platform policy, not copyright law. Problems: (1) Doesn't address whether remix creator legally had right to make derivative work, (2) No mechanism to verify remixer obtained permission from original creator, (3) Unenforceable if user sells remix off-platform, (4) Doesn't account for separate composition vs. recording copyrights, (5) Maximum 5-level chain depth is arbitrary and may not satisfy actual rights holders.\n\n**Chain of Title (INSUFFICIENT):** JSON provenance with cryptographic signatures proves creation timestamp and authorship but NOT: (1) Copyright ownership, (2) License compliance, (3) Rights to create derivatives, (4) Rights to commercialize. A court would require actual license documentation, permissions, and chain of title evidence—not just blockchain-style signatures. The 'Audit Insurance' positioning is legally misleading.\n\n**Regulatory Compliance Gaps:** (1) No mention of mechanical licensing for musical compositions, (2) No PRO (ASCAP/BMI/SESAC) licenses for public performance, (3) Ghost Producer LoRA training on user audio creates liability if users don't own training data rights, (4) No content moderation system for detecting unlicensed samples in user-uploaded CoreKits, (5) Cross-border sales complicate jurisdiction and applicable law.\n\n**Compared to Suno/Udio:** While Suno/Udio face direct training data infringement claims, Sentio's marketplace liability may be equally existential. The shift from 'AI trained on copyrighted music' to 'users trading recipes using licensed samples' doesn't eliminate liability—it redistributes it across users AND platform. Every marketplace transaction creates potential license violation and platform facilitation liability.\n\n**Partial Strengths:** On-device generation limits server-side evidence exposure. Clear sample attribution is better than black-box AI. Deterministic rendering enables verification. Foundation Kit (if properly licensed) reduces some risk. But these don't address the core marketplace licensing conflict.",
          "concerns": [
            "Sample library licenses typically prohibit resale/redistribution—CoreKit marketplace model likely violates standard licensing terms",
            "Ed25519 signatures prove authorship but NOT license rights or copyright ownership—'chain of title' claim is cryptographically sound but legally insufficient",
            "EU Article 17 removes safe harbor for content-sharing platforms—requires licenses or 'best efforts' prevention not evidenced in architecture",
            "No DMCA compliance infrastructure described (designated agent, takedown procedures, repeat infringer policy)",
            "Remix royalty splits are contractual obligations within platform but don't address underlying derivative work rights under copyright law",
            "Ghost Producer LoRA training creates secondary liability if users train on audio they don't own rights to",
            "No mechanical licensing strategy for musical compositions (separate from recording rights)",
            "Marketplace enables users to upload custom CoreKits with no verification those samples are properly licensed",
            "70/30 revenue split assumes platform can legally facilitate these transactions—may be moot if underlying licenses prohibit the use case",
            "International sales across jurisdictions with different copyright regimes (US DMCA vs EU Article 17 vs others) creates compliance complexity not addressed"
          ]
        },
        {
          "agent_name": "On-Device AI Performance Engineer",
          "score": 3,
          "reasoning": "The on-device AI performance claims are severely optimistic and contain critical feasibility gaps that threaten the entire product thesis:\n\n**Model Quality vs. Size (Critical Flaw)**: A 0.6B parameter model is fundamentally too small for creative music generation that users will want. While GBNF grammars constrain output to valid JSON, they cannot compensate for lack of musical understanding. ChatMusician needs 7B parameters trained on 4B music tokens specifically because music composition requires deep pattern knowledge. The PRD acknowledges this by requiring 7B-32B models for 'complex compositions' on desktop, yet expects mobile users to be satisfied with 10x smaller model output. Result: Likely produces repetitive, template-filled outputs that feel robotic.\n\n**Latency Claims Are Mathematically Impossible**: The PRD claims <3s total latency with '<200ms AI response time' for Qwen3 0.6B. However, the VibeBlock JSON schema shown requires 100-300+ tokens of structured output (tracks, patterns, FX chains, automation). At realistic mobile inference speeds (20-30 tokens/sec for Q4 quantized models), this requires 3-15 seconds of generation time alone—before adding GBNF grammar validation overhead (20-50% penalty) and audio rendering. First-token latency might hit 200ms, but complete VibeBlock generation will take 5-20 seconds on iPhone 12.\n\n**Storage Constraint Already Violated**: The PRD mentions '<400MB app size' but their own specifications total 477-597MB minimum (397MB model + 50-150MB Foundation CoreKit + 30-50MB app binary). iOS warns users about >200MB cellular downloads. This forces either: (1) Breaking the constraint, or (2) Making Foundation CoreKit a post-install download, degrading first-time UX.\n\n**Live Radio Is Thermally Unsustainable**: The 'killer feature' of hours-long continuous AI-generated radio cannot work on mobile hardware. The pipeline requires generating Block N+1 while N plays, meaning sustained LLM inference for hours. Reality check: iPhone 12 (2815mAh battery) running continuous inference at 1-3W = 3-10 hour battery drain from AI alone. Thermal throttling will begin within 5-15 minutes of sustained load, reducing A14 performance to ~70%, breaking the generation pipeline faster than playback, causing gaps. The PRD provides zero mitigation strategy for this physics problem.\n\n**Cross-Platform Fragmentation Ignored**: The PRD assumes uniform performance but Android reality is brutal: flagship Snapdragon chips might match iPhone 12, but mid-range devices (50%+ of Android market) will be 50-70% slower. Budget Android phones may not run the model at all with 4GB RAM after OS overhead. The '5 VibeBlocks/day' free tier limit seems designed to hide performance problems.\n\n**Inference Stack Unvalidated**: Critical dependency on llama.rn with JSI bridge for GBNF grammar support is mentioned but not validated. Does llama.rn actually support GBNF? Performance benchmarks? The entire product relies on constrained generation working efficiently on mobile—this needs proof-of-concept before claiming feasibility.\n\n**What Could Work**: The desktop Studio app (Tauri + 7B+ models + GPU) is feasible. The marketplace economics (JSON vs. audio files) are sound. But the mobile experience—which is the primary user entry point—will likely ship as a frustrating, battery-draining app that produces mediocre music slowly.",
          "concerns": [
            "0.6B model will produce musically repetitive/simplistic outputs that fail to attract/retain users—no amount of GBNF constraints can compensate for insufficient musical knowledge in the weights",
            "Actual generation latency will be 5-20 seconds (not <3s), making the 'instant gratification' value prop false and UX feel sluggish compared to cloud competitors like Suno",
            "Live Radio thermal/battery sustainability is physically impossible—sustained inference for hours will drain battery in 3-10 hours and throttle performance within 15 minutes, causing playback gaps",
            "App size already exceeds stated constraint (477-597MB vs. <400MB), forcing users onto WiFi for initial download and limiting distribution",
            "Android mid-range device performance will be 50-70% slower than iPhone 12 baseline, creating severe UX fragmentation that damages brand and drives refunds",
            "llama.rn + GBNF grammar support is unvalidated critical dependency—if grammar constraints don't work efficiently or at all, the entire deterministic generation thesis collapses",
            "CoreKit storage management not designed—users accumulating GBs of samples over months with no compression/cleanup strategy will hit device limits",
            "No fallback strategy when on-device generation is too slow—competitors fall back to cloud, but Sentio's privacy-first positioning boxes them in"
          ]
        },
        {
          "agent_name": "Creator Monetization & Marketplace Liquidity Analyst",
          "score": 4,
          "reasoning": "The 70/30 split and GMV targets face five critical structural challenges that make the projections highly optimistic:\n\n**1. Pricing Psychology - Fundamental Mismatch (Score: 3/10)**\nThe '$0.99 convenience rule' cited from Steam/iTunes breaks down here because those ecosystems sold *finished, consumable products* (games, songs). VibeBlocks are *intermediate goods* - JSON recipes requiring CoreKits to render. The value proposition is muddled: am I buying music or buying code? Comparable markets show harsh realities:\n- Sample packs on Splice: $7.99-29.99 for hundreds of sounds\n- Bandcamp tracks: $1-15 for finished, portable audio\n- VibeBlocks at $0.49-2.99 for <10KB JSON that requires proprietary software is competing against 'right-click save' culture for code/recipes. The 'poisoned preview' assumes buyers can't just screen-record the 30s audio preview and loop it, or train their own AI to generate similar vibes from the preview. Crypto/NFT markets proved people won't pay for easily-reproducible digital scarcity without strong social signaling value.\n\n**2. Anti-Piracy - Trivially Circumventable (Score: 2/10)**\nAudioSeal watermarking at -15dB will survive lossy compression, but the threat model is wrong:\n- Screen recording bypasses watermarks entirely (analog hole)\n- The JSON itself, once purchased by one user, can be shared on Discord/Pastebin\n- Ed25519 signatures prove authorship but don't prevent distribution - you can verify the creator while still pirating it\n- CoreKits (the actual valuable audio assets) will leak - 50-150MB files shared via BitTorrent are the real piracy vector, not 10KB JSON\n- 'Vibe Match' deterrence assumes AI can't work around watermarks, but adversarial training defeats audio watermarks routinely\n\n**3. Creator CAC/LTV - Underwater Unit Economics (Score: 4/10)**\nTarget: 2,000 active creators by Year 1. Math doesn't work:\n- Projected marketplace GMV Year 1: $150K/month = $1.8M annual\n- At 70% to creators: $1.26M total creator earnings\n- Divided by 2,000 creators: $630/creator/year average\n- Top 1% will earn 50%+ of that, meaning median creator earns <$200/year\n- Compare to Gumroad (10% commission): median creator makes $0. Top 1% makes $100K+\n- Creator CAC via content marketing: $50-200 per acquisition\n- At $630 LTV with 30% churn, payback is 3-12 months IF they stay active\n\nThe 'beat Spotify in 6 months' claim requires each artist to sell only 250 VibeBlocks at $2.99 (70% = $2.09) to match $500 Spotify royalties. But with 2,000 creators competing, that's 500,000 total sales, or 42,000/month - requiring 140,000+ marketplace visitors/month at 30% conversion (impossible) or 1.4M at 3% (realistic but enormous for Year 1).\n\n**4. Marketplace Liquidity - Cold Start Death Spiral (Score: 3/10)**\nThe 'Founder's Packs' strategy (10-20 commissioned designers) is insufficient:\n- Splice launched with 100,000+ samples from established labels\n- Bandcamp succeeded because artists brought existing fanbases\n- Sentio asks artists to create in a new format (VibeBlocks) with no installed base\n- Network effects are negative early: few buyers → low creator revenue → creators leave → even fewer buyers\n- Radio as discovery only works if generated music is *good enough* that listeners buy the recipe to modify it - but if Radio already gave them infinite music, why buy?\n- Campfire Mode (P2P distribution) cannibalizes marketplace sales by enabling free viral spread\n\n**5. Competitive Creator Economics - Overstated (Score: 5/10)**\nThe Spotify comparison is real ($0.003-0.004/stream is accurate), but:\n- Artists on Spotify can reach 100M+ listeners; Sentio Year 1 maybe reaches 50K\n- Spotify is *discovery*; artists make money from tours/merch afterward\n- 70% of $2.99 = $2.09 per VibeBlock vs. $3-4 per 1,000 streams means artist needs to sell 1 VibeBlock per 1,500 streams to break even. BUT: streams are passive (playlist inclusion = scale), sales require active buyer intent (much harder)\n- Bandcamp (85-90% split) is the real competition, and they have 15 years of network effects\n- Audius (blockchain, 90% to artists) failed to gain traction despite better economics\n\nBetter economics ≠ user adoption. MySpace paid better than Facebook; failed anyway.\n\n**GMV Projection Reality Check:**\n- Week 8 target: $500 GMV (3-5 high-value sales total) - achievable with beta testers\n- Month 6: $25K/month requires ~10,000 transactions at $2.50 avg - needs 30K+ MAU at 33% purchase rate (Bandcamp is ~5%) or 200K MAU at realistic 5% rate\n- Year 1: $150K/month = $1.8M annual GMV requires 60K monthly transactions - comparable to a mid-tier Gumroad creator, but spread across an entire marketplace\n\n**What Could Work:**\nThe technology is sound. The user experience is innovative. But the revenue model confuses *tools* (should be SaaS subscription) with *assets* (marketplace commodities). Successful path:\n1. Focus on subscriptions ($9.99-24.99/mo) as primary revenue - predictable, scales with users\n2. Marketplace as secondary - takes pressure off cold start\n3. Price VibeBlocks at $0.00-0.49 to drive virality, upsell CoreKits at $9.99-49.99\n4. Make Ghost Producer Kits the premium item ($99-499) - real scarcity, high value\n5. Partner with 3-5 mid-tier artists (50K-500K followers) for launch exclusives\n\nWithout these pivots, you'll hit $500 Week 8, struggle to $5K by Month 6 (not $25K), and cap at $30K-50K/month by Year 1 as liquidity never materializes.",
          "concerns": [
            "VibeBlocks are intermediate goods (recipes) not finished products - pricing psychology from Steam/iTunes doesn't transfer to code/JSON artifacts",
            "Anti-piracy relies on watermarking audio previews, but screen recording (analog hole) and JSON sharing on forums defeats the entire model",
            "Creator unit economics are underwater: $630 average annual earnings won't retain 2,000 creators when median is <$200 after power law distribution",
            "Cold start strategy (10-20 Founder's Packs) is 100-1000x too small compared to successful sample marketplaces like Splice (100K+ samples at launch)",
            "GMV targets require 200K+ MAU by Month 6 (for $25K GMV at 5% conversion) but projected user acquisition is 50K total - 4x shortfall",
            "Marketplace cannibalization: Live Radio gives infinite free music, Campfire Mode enables P2P viral spread - both reduce purchase intent",
            "Spotify revenue comparison ignores scale asymmetry: artists can reach 100M listeners on Spotify vs maybe 50K on Sentio Year 1",
            "Bandcamp (15% commission, 85% to creators) with 15 years of network effects is the real competitor, not Spotify - and Sentio is worse deal than Bandcamp",
            "Two-sided marketplace with zero installed base asking creators to produce in new format (VibeBlocks) without existing audience is highest-risk cold start scenario",
            "Revenue model confusion: treats creation tools (should be SaaS) as marketplace commodity, creating misaligned incentives"
          ]
        },
        {
          "agent_name": "Mobile Platform & Distribution Risk Manager",
          "score": 4,
          "reasoning": "Sentio faces severe structural platform risks that could cripple the business model at multiple points. The payment routing strategy is built on legally fragile assumptions—the Epic v Apple 'external payment link' ruling remains contested, with Apple imposing 27% commissions on external transactions that render the economics unworkable. The EU DMA offers a path but requires 10-12% Apple fees plus Core Technology Fee exposure. If forced to standard IAP (15-30%), the 70/30 creator split collapses mathematically: 30% Apple + 3% Stripe = 33% total take, leaving negative 3% for Sentio operations. The mitigation—driving users to desktop/web purchases—is unproven and fights platform UX gravity. On content policy: AI music generation exists in a policy gray zone. While on-device generation with licensed CoreKits provides legal cover, the 'Ghost Producer' feature allowing users to upload their own audio for style training creates an unmoderated content pipeline that Apple will likely flag under App Store Review Guideline 1.2 (user-generated content requires moderation). The 'Campfire Mode' P2P distribution of VibeBlocks could be interpreted as sideloading digital goods, violating IAP requirements. GPL risk appears managed (MIT/Apache stack), but audio library dependency chains are notoriously complex—one transitive GPL dependency contaminates the entire commercial license. Update velocity is structurally disadvantaged: server-side competitors (Suno, Udio) ship model improvements instantly; Sentio requires 1-7 day App Store review for every model update, creating a permanent innovation lag. The core architectural bet—on-device inference—is the source of both the privacy value prop AND the platform lock-in vulnerability.",
          "concerns": [
            "Payment routing strategy assumes Epic v Apple outcomes (April 2025 ruling, external links) that are legally contested and may never materialize as described; Apple's 27% external purchase commission makes the math unworkable",
            "If forced to standard IAP (even 15% Small Business rate), the 70/30 creator split is mathematically impossible: 15% Apple + 3% Stripe = 18% total cost, leaving only 12% for operations and creator payouts",
            "Ghost Producer feature (user-uploaded audio training) creates unmoderated content pipeline that violates App Store Guideline 1.2 requirement for user-generated content moderation systems",
            "Campfire Mode P2P distribution of purchasable digital goods (VibeBlocks) likely violates IAP requirements—Apple may classify this as sideloading/circumvention",
            "On-device model architecture means every model improvement requires App Store review (1-7 days), creating permanent competitive disadvantage vs. server-side competitors who ship updates instantly",
            "Marketplace 'Remix' chain and royalty attribution system may be flagged as cryptocurrency/blockchain-adjacent (immutable ledger, split payments) triggering additional review scrutiny",
            "GPL contamination risk understated: audio processing chains have complex dependency trees; one transitive GPL dependency contaminates entire commercial license",
            "'Founder's Packs' commissioning strategy frontloads content moderation risk—if any commissioned CoreKit contains unlicensed samples, Apple liability concerns trigger rejection",
            "No contingency plan if Apple/Google classify AI-generated music as requiring explicit content warnings or age-gating (precedent: AI chatbot apps now require 17+ rating)",
            "Desktop/web purchase promotion mitigation assumes users will friction-switch platforms for transactions—historically, mobile-first users stay mobile despite price incentives (see: Fortnite user retention post-store removal)"
          ]
        },
        {
          "agent_name": "Music Production Quality & Workflow Integration Specialist",
          "score": 5,
          "reasoning": "Sentio presents an architecturally clever approach—generating JSON instructions rather than audio—but this creates a critical quality paradox: the system is only as good as its CoreKit samples, yet the PRD provides zero technical specifications for sample recording, mixing, or mastering standards. A 0.6B general-purpose LLM (Qwen3) generating musically coherent compositions is unproven at scale; while GBNF grammars enforce syntactic validity, they cannot guarantee aesthetic quality. The Foundation CoreKit at 50–150MB cannot compete with professional libraries (Kontakt/Splice offerings are 10–100GB) across 'all genres'—this is impossibly broad. For the Explorer persona, lo-fi/ambient/background music may clear the emotional bar, but for the Producer persona, this faces a steep credibility gap: why abandon Ableton + Splice for a sidecar process with unknown sample quality? The VST3/AU integration adds workflow friction without a clear value proposition—producers already have sample libraries and MIDI sequencers. The Ghost Producer (LoRA style transfer) is genuinely innovative, but HT-Demucs stem separation and Basic Pitch audio-to-MIDI have known accuracy limitations that will frustrate professionals expecting precision. Genre coverage claims are unrealistic: 30–100MB Genre Kits cannot match specialized libraries (e.g., a single snare drum multi-sample in pro libraries can be 500MB). Remix fidelity depends on Signalsmith Stretch quality, which degrades under extreme tempo/pitch shifts. The marketplace could solve the sample quality problem long-term through crowdsourcing, but the cold start with 'Founder's Packs' is a massive execution risk. The deterministic JSON format is brilliant for collaboration/versioning, but the listening experience quality remains unvalidated.",
          "concerns": [
            "Zero technical specs for CoreKit sample quality (recording standards, bit depth, mixing/mastering). Professional producers need 24-bit/96kHz multi-sampled instruments with round-robin and velocity layers—no evidence this exists.",
            "0.6B LLM generating musically coherent compositions is unproven. No FAD scores, no MUSHRA tests, no blind A/B comparisons vs. human-composed music. GBNF grammars enforce syntax, not aesthetics.",
            "Foundation CoreKit at 50–150MB for 'all genres' is orders of magnitude smaller than professional libraries. Splice has 5M+ samples; Output Arcade is 30GB+. Cannot compete on breadth or depth.",
            "VST3/AU sidecar integration introduces workflow friction without clear win over existing tools. Producers already use Splice/Arcade/Loopcloud inside their DAWs. Why switch to out-of-process JSON generation?",
            "Creative control granularity gap: natural language → JSON is lossy. How does a producer specify sample-accurate timing, precise velocity curves, per-note articulations? No MIDI controller/MPE/hardware sequencer integration mentioned.",
            "Stem separation (HT-Demucs) and audio-to-MIDI (Basic Pitch) have known accuracy limitations. Professionals will be frustrated by artifacts, missed transients, incorrect pitch detection.",
            "Genre/style coverage requires 50+ specialized kits to serve diverse Producer needs (jazz, trap, orchestral, ethnic, experimental). Marketplace cold start is brutal—needs critical mass of high-quality creator submissions.",
            "Remix fidelity preservation: changing BPM/key re-renders from samples via time-stretch/pitch-shift. Signalsmith Stretch is excellent but not magic—extreme changes (85→140 BPM) degrade quality noticeably.",
            "No AAX support (Pro Tools industry standard). Desktop-only Ghost Producer excludes mobile-first producers (huge growth segment in hip-hop/electronic).",
            "Quality perception risk: if 0.6B model output sounds 'generic' or 'AI-slop', the Explorer persona churns and the Product persona never adopts. The entire thesis rests on unvalidated sample quality + untested compositional AI."
          ]
        }
      ],
      "synthesized_reasoning": "Sentio presents an architecturally innovative approach—JSON instruction sets instead of audio files, local-first inference, deterministic rendering from licensed samples—but faces compounding critical failures across five independent domains that create existential risk:\n\n**Legal/Copyright (Score: 4/10):** The 'clean chain of title' claim conflates cryptographic provenance with legal licensing rights. Standard sample library licenses explicitly prohibit the core business model: reselling samples, creating derivative libraries, and transferring usage rights. When users sell VibeBlocks referencing CoreKit samples, they likely violate these restrictions. Ed25519 signatures prove authorship but NOT license compliance. EU Article 17 removes safe harbor for content-sharing platforms, creating direct liability. The marketplace model shifts from Suno/Udio's training data risk to per-transaction licensing violations—equally existential, just distributed differently.\n\n**Technical Performance (Score: 3/10):** Physics and math invalidate core claims. A 0.6B model cannot produce quality music composition—ChatMusician needs 7B specifically for music. Claimed <3s latency is impossible: 100-300 token VibeBlock generation at 20-30 tok/sec = 5-20 seconds actual latency. Live Radio—the 'killer feature'—is thermally unsustainable: continuous inference drains iPhone 12 battery in 3-10 hours and triggers throttling within 15 minutes, breaking the generation pipeline. No mitigation strategy exists for these physics constraints. App size already exceeds stated limits (477-597MB vs <400MB target).\n\n**Marketplace Economics (Score: 4/10):** Unit economics are underwater. Projected $1.8M Year 1 GMV / 2,000 creators = $630/creator/year average, with median <$200 after power law distribution. This won't retain creators. GMV targets require 200K+ MAU by Month 6, but projections show only 50K total—a 4x shortfall. The $0.99 'convenience rule' from Steam/iTunes doesn't apply to intermediate goods (JSON recipes requiring proprietary software). Anti-piracy via watermarked previews is defeated by screen recording and JSON sharing. Cold start with 10-20 Founder's Packs is 100-1000x too small vs Splice's 100K+ samples at launch. Marketplace cannibalizes itself: Live Radio provides infinite free music, Campfire Mode enables P2P viral spread—both reduce purchase intent.\n\n**Platform Risk (Score: 4/10):** Payment routing strategy assumes Epic v Apple outcomes that remain legally contested. If forced to standard IAP, the math breaks: 15-30% platform tax + 3% Stripe = 18-33% total cost, making 70/30 creator split impossible. Ghost Producer (user-uploaded audio training) violates App Store Guideline 1.2 requiring content moderation for UGC. Campfire P2P distribution may be classified as sideloading/IAP circumvention. On-device architecture creates permanent innovation lag: every model update requires 1-7 day App Store review while competitors ship server-side updates instantly.\n\n**Quality/Workflow (Score: 5/10):** Zero technical specs for CoreKit sample quality. Foundation Kit at 50-150MB for 'all genres' is orders of magnitude smaller than professional libraries (Splice: 5M+ samples, Output Arcade: 30GB+). 0.6B LLM compositional quality is unproven—no FAD scores, no blind A/B tests. VST3 sidecar adds friction without clear value over existing DAW workflows. If output sounds generic, Explorers churn and Producers never adopt.\n\n**Cross-Cutting Failure Mode:** The product conflates technical innovation (clever architecture) with market viability (unvalidated assumptions about legal compliance, performance feasibility, creator economics, and quality perception). The 'local-first' positioning solves privacy but creates unsolvable thermal/latency constraints and platform lock-in. The 70/30 split is meaningless if underlying sample licenses prohibit the use case, platform taxes consume the margin, or marketplace liquidity never materializes.",
      "next_steps": [
        "STOP: Do not proceed with current architecture. Critical dependencies are unvalidated (llama.rn + GBNF performance, 0.6B music quality, sample license compatibility with resale).",
        "Legal: Obtain written confirmation from 3+ major sample library providers (Splice, Loopmasters, Native Instruments) that their licenses permit the CoreKit marketplace model. If prohibited, pivot to 100% original Sentio-owned samples or subscription-only (no resale).",
        "Technical: Build thermal sustainability proof-of-concept for Live Radio on iPhone 12. Run continuous inference for 2 hours, measure battery drain and throttling. If unsustainable, remove Live Radio from MVP or require plugged-in + cooling.",
        "Economics: Redesign revenue model around subscriptions ($9.99-24.99/mo) as primary revenue, marketplace as secondary. Price VibeBlocks at $0-0.49 for virality, upsell CoreKits at $9.99-49.99, make Ghost Producer Kits the premium tier ($99-499). Partner with 3-5 mid-tier artists (50K-500K followers) for launch exclusives to solve cold start.",
        "Platform: Assume worst-case IAP enforcement (30% tax). Recalculate unit economics with 30% platform + 3% Stripe = 33% cost. If margins don't work, negotiate enterprise B2B deals (labels, studios) that bypass app stores entirely.",
        "Quality: Commission blind A/B listening test: 0.6B Qwen3-generated music vs human-composed lofi/ambient tracks. If <60% prefer AI or rate it <6/10, upgrade to minimum 3B model or partner with music-specific model (ChatMusician mandatory, not optional).",
        "Pivot Option: Reframe as a B2B tool for game developers / content creators (background music generation for videos/games with clear commercial licensing). Avoid consumer marketplace complexity, charge per-seat SaaS ($49-199/mo), provide legal indemnification via licensed CoreKits.",
        "If pivots are rejected and current direction is mandated: Reduce scope to desktop-only Studio app (eliminates mobile thermal/latency problems), target only Producer persona (eliminate Explorer/Fan complexity), launch with 3 curated Genre Kits (not marketplace), prove model quality first before attempting marketplace liquidity challenge."
      ],
      "council_composition": [
        "Music Copyright & Sample Licensing Specialist",
        "On-Device AI Performance Engineer",
        "Creator Monetization & Marketplace Liquidity Analyst",
        "Mobile Platform & Distribution Risk Manager",
        "Music Production Quality & Workflow Integration Specialist"
      ]
    }
  }
}