{
  "id": "project-20260212-669487",
  "title": "Global Foundation for Transparent Collective Gatherings",
  "description": "FOUNDATIONAL DESIGN DOCUMENT\nGlobal Foundation for Transparent Collective Gatherings\n\nVersion 2.0  —  February 2026\nIntegrating Meeting Notes, Design Research, and Systems Architecture\n\n\n\n\n\nLaunch Cities: Zurich  ·  Bangalore  ·  Goa  ·  San Francisco\n\nTable of Contents\n\n\n\n1. Vision and Problem Statement\n1.1 The Opportunity\nImmersive collective gatherings such as ecstatic dance, sound journeys, breathwork circles, and conscious raves are growing in cultural relevance globally. They represent a shift toward experience-driven active engagement and community connection in an era of digital isolation. Yet this growing movement operates in a deeply fragmented ecosystem, with facilitators running events through personal WhatsApp groups, word-of-mouth networks, and inconsistent pricing structures.\n1.2 The Problem\nThe current landscape lacks standardized financial transparency or disclosure, ethical oversight and accountability mechanisms, defined governance structures, formalized community feedback systems, and trust signals for participants. This creates compounding risks: opacity around where money goes, power concentration among popular facilitators without accountability, ethical ambiguity in vulnerable settings (breathwork, sound healing), and erosion of trust as participation scales beyond intimate circles.\n1.3 The Core Insight\nThe digital world has been pulling physical communities into virtual spaces (Facebook groups, Instagram followings). This platform inverts that dynamic: it uses digital infrastructure to strengthen and scale physical community gathering. The whole purpose of the digital layer is to facilitate physical togetherness, not to replace it with screen time. Nothing on this platform is virtual. Everything leads to people being in the same room together.\n\n2. Target Users and Launch Cities\n2.1 Primary User Groups\nEvent Facilitators: Individual practitioners, established collectives, and venue owners currently operating in isolation. They use personal messaging apps, lack discovery tools for new audiences, and handle all financial logistics manually. The platform gives them a community to be discovered by, transparent financial infrastructure, and the ability to travel to new cities and be visible to local communities instantly.\nParticipants: Seekers of trustworthy, experience-driven active engagement events. They currently rely on word of mouth, have no way to verify facilitator quality, and lack visibility into event economics. The platform gives them trust signals, community-driven quality ratings, and the power to shape the events they attend.\nCommunity Ambassadors: Local stewards (2–3 per city) who facilitate facilitator verification through screening, trial events, and co-facilitation requirements. They are the bridge between the global protocol and local community culture.\n2.2 Launch Cities\nThe four initial cities were chosen because the founders have local presence and existing community connections in each. This is critical because the platform requires physical community management, not remote administration.\nCity\nContext\nPurchasing Power Index\nKey Considerations\nZurich\nHigh-trust society, direct democracy culture, established wellness scene\nHigh (baseline)\nStrong overpayment potential, high governance participation expected\nSan Francisco\nLargest existing conscious events community, tech-savvy early adopters\nHigh (similar to Zurich)\nHighest initial adoption potential, competitive landscape\nBangalore\nRapidly growing urban wellness market, tech hub, price-sensitive\nLow (5–6x gap vs. Zurich)\nDual pricing challenge, strong community culture in apartment complexes like Brigade\nGoa\nTourist economy with dual-pricing norms, established retreat culture\nLow (similar to Bangalore)\nSeasonal demand cycles, transient vs. resident population split\n\n\n2.3 Community Structure Within Cities\nBased on the design discussions, the community hierarchy operates across three levels. City-level is the primary organizational unit, with all facilitators and participants indexed by city. Interest-based subcommunities form within each city, grouping around activity types such as sound healing, ecstatic dance, breathwork, and painting. Location-based clusters emerge organically within interest groups, reflecting physical neighborhoods like the Brigade apartment complex in Bangalore, where multiple facilitators may offer similar services and participants choose based on proximity, ratings, and personal preference.\nThis means a participant in Brigade who wants sound healing will see the Bangalore sound healing subcommunity filtered by proximity, with multiple facilitators to choose from, each with their own ratings, verification tier, and transparent pricing history.\n\n3. Proposed Solution\nA nonprofit Foundation that establishes and stewards a global protocol for transparent, community-governed collective gatherings. The Foundation operates through a public charter defining transparency, ethical, and governance standards, city-based nodes with local community ambassadors, facilitator verification with progressive trust levels, independent oversight and accountability structures, economic transparency requirements for all affiliated gatherings, a skills and talent marketplace connecting facilitators with communities, and community crowdfunding to enable demand-driven event programming.\n3.1 Technical Foundation\nThe platform builds on Open Collective’s MIT-licensed open-source codebase, which provides battle-tested transparent financial infrastructure. Open Collective already enables real-time financial dashboards, expense submissions with receipts, transparent budget tracking, and fiscal hosting capabilities. The Foundation will fork this codebase and build additional layers on top: the facilitator verification and rating system, the community governance and voting mechanisms, the skills marketplace and crowdfunding engine, the event management and post-event transparency loop, and the dual-token reputation and governance system.\nOpen Collective’s existing model also aligns philosophically: when a collective on their platform does not charge for events, Open Collective does not charge either. When money flows, they take 15% of the facilitator’s share. This same principle can be adopted and refined for this platform.\n3.2 Data and Infrastructure Approach\nThe platform is intentionally lightweight on data. There is no video streaming, no audio hosting, no heavy media storage. Content is external: facilitators link to their YouTube, Instagram, or SoundCloud profiles. The platform stores primarily text, images, transaction records, and ratings. This means infrastructure costs remain low even at millions of users. A peer-to-peer or federated node architecture is feasible, where city nodes can host portions of the platform on local infrastructure, reducing centralization and keeping costs distributed.\n\n4. Economic Model and Surplus Distribution\n4.1 The Pay-What-Feels-Right Model\nThe economic model operates through a transparent sliding-scale mechanism designed in collaboration with research from Harvard Business School (which found that cost transparency increases purchase likelihood by 21%) and pay-what-you-want literature (which shows that combining PWYW with a charitable component nearly doubles average payment).\nThe participant experience unfolds across four phases. In the pre-event phase, participants see an estimated cost breakdown and a suggested average contribution. The facilitator publishes expected costs including venue rental, materials, collaborator fees, and their own time. Participants register with a commitment to pay after the event. During the event itself, the facilitator and any collaborators deliver the experience. Costs accumulate in real time on the platform as the facilitator logs actual expenses with receipts and invoices. In the post-event settlement phase, which occurs within 24 hours, participants receive a dashboard showing actual costs incurred and the average share per participant. Each participant chooses to pay at, below, or above the average, using a clear sliding scale interface. A live dashboard shows collection progress in real time. Finally, during a reconciliation window that lasts 24 hours after the event, a final summary is published. If there is a deficit, the community is invited to make up the difference. If there is a surplus, the predefined redistribution rules apply automatically. After 24 hours, no further payments are requested.\n4.2 Per-Event Revenue Flow\nDrawing from cooperative economics models used by Stocksy, Resonate, Fairbnb, and the Mondragon Corporation, the following revenue distribution applies to every event on the platform.\nRevenue Layer\nAllocation\nRationale\nFacilitator compensation\n65% of ticket revenue\nCreators capture the majority of value (Stocksy/Resonate principle)\nVenue and production costs\n15–20% (pass-through)\nActual costs verified by uploaded invoices/receipts\nPlatform fee\n15–20%\nSplit into four transparent sub-buckets detailed below\n\n\n4.3 Platform Fee Allocation\nThe platform fee itself is allocated transparently across four sub-buckets, each serving a distinct purpose in the ecosystem. Every participant can see exactly where their contribution goes.\nSub-bucket\nShare of Platform Fee\nPurpose\nPrecedent\nPlatform operations\n50%\nTechnology, administration, insurance, staff salaries\nFairbnb operational share model\nCity community fund\n25%\nLocal community initiatives, accessibility subsidies, venue improvements\nFairbnb 50/50 local community model\nGlobal commons fund\n15%\nCross-city platform development, knowledge sharing, global governance\nMondragon 14% central contribution\nReserve fund\n10%\nEmergency buffer, indivisible cooperative reserves\nICA Cooperative Principles\n\n\n4.4 Surplus Redistribution\nWhen an event collects more than its costs (including facilitator compensation), the surplus follows a predefined and transparent redistribution path. This is not arbitrary: every participant knows before the event exactly what will happen with any surplus. The facilitator receives a bonus of 30% of the surplus, recognizing that popular and high-quality facilitation should be rewarded. The city community fund receives 40%, supporting local community initiatives, subsidizing access for lower-income participants, and building shared resources. The global commons fund receives 20%, enabling cross-city knowledge transfer, platform development, and supporting newer nodes. Finally, 10% enters the reserve fund as an indivisible buffer that can never be distributed, ensuring long-term organizational resilience.\nParticipants who contributed above the average receive karma tokens proportional to their generosity, which serve as reputation signals rather than financial instruments. These tokens are detailed in Section 6.\n4.5 Expense Transparency Requirements\nEvery facilitator must upload actual cost documentation to the platform. For material costs such as venue rental, equipment, and supplies, facilitators provide invoices or receipts. For labor and time, facilitators declare hours and rates in a standardized format. The platform may incorporate expense-scanning functionality similar to tools like Fyle, reading uploaded receipts and auto-populating cost breakdowns. The community can see all expense documentation for every event, and when one facilitator charges significantly more than another for comparable venues or materials, the comparison becomes self-evident through the transparency layer.\n4.6 Can a Facilitator Make a Living?\nYes. A popular facilitator running sessions across multiple neighborhoods or cities full-time can sustain themselves because the platform fee is proportional, not fixed per event. A facilitator who runs three sessions per week at an average of 20 participants paying an average of CHF 30 in Zurich would earn approximately CHF 5,850 per month from facilitation alone (65% of gross). In Bangalore, at equivalent purchasing-power-adjusted rates of approximately 500 INR per participant, the same activity pattern yields roughly INR 78,000 per month. The platform also does not create incentives to take communities off-platform, because the facilitator gains discovery, reputation, cross-city visibility, and financial infrastructure they cannot replicate with a WhatsApp group.\n\n5. Skills Marketplace and Community Crowdfunding\n5.1 The Marketplace Concept\nThe skills and talent marketplace is a discovery layer where facilitators create rich profiles showcasing their abilities, experience, and body of work. It serves three critical functions. First, it solves the cold-start problem for facilitators traveling to new cities: a Distinguished sound healer from Goa becomes instantly visible to the Zurich community without needing to build a local WhatsApp network from scratch. Second, it enables communities to browse available talent when commissioning events through crowdfunding. Third, it creates a portfolio and reputation layer that makes facilitator quality visible and comparable.\n5.2 Facilitator Profile Structure\nEach marketplace profile contains several layers of information. The identity and verification layer shows the facilitator’s name, photo, location and travel availability, verification tier (Entry, Established, Distinguished, or Elder), and verification date. The skills and modalities section lists what they offer, whether that is ecstatic dance DJ sets, sound healing with singing bowls and gongs, holotropic breathwork facilitation, cacao ceremonies, movement therapy, or art workshops. The portfolio section links to external content such as YouTube videos, Instagram reels, SoundCloud mixes, and personal websites, as well as any on-platform event recordings or photo galleries. The platform track record shows the number of events facilitated, average participant rating, community endorsements from other verified facilitators, and transparent pricing history including average cost per participant across past events. Finally, the availability and rates section shows the facilitator’s calendar, base rate expectations, and willingness to accept crowdfunded or sliding-scale-only events.\nProfiles exist in two states. An unverified profile is open to anyone and clearly marked as such, allowing facilitators to showcase their work and be discovered but with a visible trust gap. A verified profile requires completing the platform’s onboarding process of screening, trial events, and co-facilitation, and carries the corresponding tier badge. Communities can engage either type, but verified facilitators naturally attract more trust and crowdfunding support.\n5.3 Community Crowdfunding\nThis mechanism flips the traditional event model. Instead of a facilitator announcing an event and hoping people come, a community collectively decides what experience they want and funds it into existence. The flow works as follows.\nIn the proposal phase, any community member can propose an event concept, for example: \"We want a cacao ceremony with live music in Brigade next Saturday evening.\" The proposal includes the type of experience, preferred date and location, and an estimated budget range. In the crowdfunding phase, community members pledge contributions toward the event’s minimum viable budget, which covers venue, materials, and a guaranteed facilitator base fee. The sliding-scale model applies to pledges, so participants contribute what feels right. A progress bar shows funding status, and the event activates once the minimum budget is reached. During the matching phase, once funded, the community either selects a specific facilitator from the marketplace or opens it to proposals from interested facilitators. The community can review marketplace profiles, watch portfolio content, and compare transparent pricing histories before selecting. In the case of multi-provider events, a lead facilitator can assemble an ensemble from the marketplace, for example pairing a sound healer with a live musician. The full team and cost breakdown are visible to funders before final confirmation. After the event, the standard post-event transparency loop applies: actual costs are disclosed, the sliding scale settles individual contributions, and any surplus follows the predefined redistribution rules.\n5.4 Cross-City Commissioning\nOne of the most powerful features enabled by the marketplace is cross-city commissioning. The Zurich community can crowdfund bringing a Distinguished facilitator from Goa for a special event, with the marketplace handling discovery and the platform handling transparent economics including travel cost allocation. This creates opportunities for facilitators to build a global following and for communities to access talent beyond their local pool, while keeping all economics visible and community-governed.\n5.5 Interaction with the Token System\nThe marketplace creates additional surfaces for the reputation economy. Community members who contribute to crowdfunding campaigns earn karma for community building. Facilitators who accept crowdfunded gigs, which may pay less than private bookings, earn karma for accessibility and community service. Facilitators who offer reduced rates or donate their time earn karma that translates into better platform visibility, accelerated tier progression, and stronger governance participation rights. The marketplace and crowdfunding layer thus reinforce the platform’s core value proposition: the more you contribute to the community, the more the community recognizes and elevates you.\n\n6. Dual Token System: Karma and Voice\nThe platform uses two distinct token types to separate reputation from governance power. This design is grounded in research from SourceCred’s dual-token architecture, a16z’s framework for reputation-based systems, and the universal cooperative principle that money must never buy votes.\n6.1 Karma Tokens (Reputation)\nKarma tokens are non-transferable reputation signals that reflect a member’s contribution to the community. They cannot be bought, sold, or traded. They are earned exclusively through verified actions on the platform.\nKarma is earned through several channels. Attendance consistency rewards regular event participation, with recurring attendance earning more than sporadic visits. Financial generosity recognizes those who pay above the sliding-scale average, without exposing exact amounts; the system shows that someone was generous, not how generous. Volunteering covers practical community contributions like event setup, teardown, greeting, sound checks, and space holding. Community building recognizes bringing new members to the platform and facilitating connections. Crowdfunding contribution rewards those who fund community-proposed events through the marketplace. Content contribution covers sharing playlists, writing event guidelines, creating community resources, and facilitating knowledge exchange.\nA critical design principle is that karma must decay over time. An exponential decay with a 90-day half-life ensures that governance rights reflect current engagement rather than historical accumulation. Reputation earned three months ago counts half as much as today’s contribution. This prevents early adopters from permanently dominating governance and keeps the system oriented toward active participation. Weekly earning caps per category prevent binge-accumulation, and the financial generosity category is specifically capped at 2x the standard contribution equivalent to prevent wealthy participants from gaming the reputation system.\n6.2 Voice Tokens (Governance)\nVoice tokens represent governance participation rights. They are activated by reaching a karma threshold, not by purchasing them. The activation criteria require a minimum of three events attended and contributions in at least two karma categories. Once activated, the baseline principle for constitutional decisions is one-member-one-vote, following the universal cooperative principle that decouples governance from capital contribution.\nFor resource allocation and prioritization decisions, the platform uses quadratic voting, where each member receives a budget of voice credits that convert to votes via square root. Casting one vote costs one credit, but casting two votes on the same issue costs four credits and three votes costs nine. This means a person with 100 times the resources gets only 10 times the voting power, significantly reducing the influence of concentrated interests while still allowing people to express intensity of preference.\nFor ongoing community decisions, conviction voting allows members to stake their voice tokens on proposals, with conviction accumulating over time like a capacitor charging. This transforms vote-buying into continuous-cost vote-renting and ensures that long-held community preferences accumulate more weight than sudden interventions. These mechanisms are not blockchain-dependent; they can be implemented as database-level logic on the Open Collective codebase.\n6.3 What Tokens Are Not\nTo be explicit about boundaries: karma tokens are not cryptocurrency and have no monetary value. They cannot be traded on any exchange. Voice tokens are not shares and confer no ownership or profit rights. Neither token type can be purchased with money. The platform is deliberately positioned outside the blockchain and cryptocurrency ecosystem to avoid association with speculative token economics and to maintain focus on real-world community building.\n6.4 Practical Token Uses\nBeyond governance, karma tokens unlock practical benefits. They can be redeemed for discounted or free event access, essentially functioning as community credit for future experiences. Facilitators with high karma earn priority in marketplace visibility and tier advancement. Community members with strong karma can access ambassador roles and event co-facilitation opportunities. Volunteers who accumulate karma through service can attend events funded by the community fund at reduced or zero cost, creating an economic solidarity loop.\n\n7. Facilitator Verification and Tiered Advancement\n7.1 Tier System\nTier\nRequirements\nBenefits\nAdvancement\nEntry\nComplete screening, submit portfolio, run one trial event with co-facilitation\nListed in marketplace (with Entry badge), access to community events calendar, basic financial tools\nAutomatic after 5+ rated events with average rating above threshold\nEstablished\n5+ successful events, consistent positive ratings, expense transparency compliance\nPriority marketplace visibility, access to premium venues through platform partnerships, featured in city discovery\nCommunity nomination plus 10+ events with strong ratings\nDistinguished\n10+ events, community nomination, demonstrated contribution to community beyond facilitation\nCross-city visibility, eligible for crowdfunded travel commissions, mentoring role for Entry facilitators\nCommunity-wide vote with 2/3 supermajority\nElder\nSustained distinguished-level contribution, recognized by multiple city nodes\nGovernance advisory role, shape platform evolution, priority access to all venue partnerships, ambassador eligibility\nGlobal community vote\n\n\n7.2 Onboarding Flow\nA new facilitator joins the platform by creating a marketplace profile with their skills, modalities, portfolio links, and availability. They undergo an initial screening by city community ambassadors, which includes a conversation about the platform’s principles and economic model. They then run a trial event, co-facilitated with an Established or higher-tier facilitator, where participants provide structured feedback. Upon successful completion, they receive their Entry tier badge and full marketplace access. One design option discussed is requiring new facilitators to bring at least 10 participants to their first platform event, serving as a built-in community-building requirement and ensuring that every new facilitator immediately contributes to platform growth.\n7.3 Quality Assurance\nQuality is maintained through multiple feedback mechanisms. Post-event ratings from participants are structured to capture specific dimensions of the experience rather than a single star rating. Community ambassadors conduct periodic reviews of facilitator compliance with transparency and ethical standards. The marketplace’s transparent pricing history naturally exposes facilitators who consistently overcharge relative to their peers. And the tier advancement system, which requires community votes for the highest levels, ensures that sustained quality and contribution are recognized and rewarded.\n8. Constitutional Framework and Governance\nThe platform’s governance operates through a four-layer document architecture with escalating amendment thresholds, drawing from Burning Man’s 10 Principles, B Corp certification standards, Enspiral’s agreements framework, and sociocratic consent-based decision-making.\n8.1 Layer 1: Core Values (Hardest to Change)\nThe foundational values emerge from the organic culture of the ecstatic dance and conscious events community. They are aspirational and cultural, not prescriptive rules. The initial proposed values include Embodiment (prioritizing physical, present, sensory experience), Radical Inclusivity (accessible to all regardless of economic status, background, or ability), Consent Culture (clear boundaries in all interactions, especially in vulnerable settings), Transparent Economics (every financial flow visible to every participant), Community Sovereignty (decisions made by participants, not centralized management), Ecological Stewardship (every event considers its sustainability footprint), and Active Participation (everyone contributes, no one is merely an audience). Amending core values requires 80% or higher supermajority approval with a 6-month deliberation period and at least 50% quorum of active members.\n8.2 Layer 2: Charter and Bylaws\nThe charter defines the Foundation’s legal structure, membership classes (facilitators, participants, platform workers), one-member-one-vote provisions, board composition with staggered terms, and the economic model’s structural parameters. This layer follows the B Corp model of Foundation Requirements (universal prerequisites) plus Impact Topics (context-dependent standards that can evolve). Amending the charter requires a two-thirds supermajority with a 30-day notification period.\n8.3 Layer 3: Agreements and Policies\nOperational agreements function as community legislation, following Enspiral’s model where any member can raise a formal decision at any time. A decision passes when the majority agrees and nobody blocks. A block is a strong form of disagreement requiring the blocker to explain their concern and propose improvements. This consent-based approach, borrowed from sociocracy, shifts the question from whether everyone agrees to whether there are reasons not to proceed. Decisions are framed as good enough for now and safe enough to try, with all agreements carrying a scheduled review date.\n8.4 Layer 4: Guidelines and Guides\nNon-binding best practices updated by working groups or designated stewards. The ecstatic dance community has already developed remarkably consistent guidelines globally: no shoes on the dance floor, substance-free space, no talking on the dance floor, no phones, consent-based touch. These function as cultural norms rather than enforceable rules and evolve organically as communities grow.\n8.5 Scope Boundary and Evolution\nThe initial scope boundary defines what belongs on the platform. In scope: experience-driven active engagement events where participants are physically present and actively involved. This includes movement practices such as ecstatic dance, contact improvisation, and movement therapy; sonic experiences such as sound healing, live music circles, and chanting; breathwork in all its forms; creative workshops such as painting, pottery, and collaborative art; wellness practices such as yoga, meditation, and cacao ceremonies; nature-based experiences such as forest bathing and outdoor movement; community gatherings with an active component such as potlucks with shared cooking or community gardening; and family and child-friendly activities. Out of scope: passive consumption events where the primary mode is watching or listening without active engagement, such as concerts, lectures, and film screenings. Also out of scope: traditional profit-maximizing event management, events that violate core values such as substance use, lack of consent culture, or closed governance, and purely virtual events with no physical gathering component.\nWhen a community member proposes expanding the scope to include a new activity type, a structured process applies. First, a values alignment check tests the proposal against Layer 1 core values. Then a 4–6 week community deliberation period allows discussion and refinement. A 6-month pilot with defined success metrics can be approved by simple majority. Finally, a formal vote on permanent inclusion based on pilot data requires a two-thirds supermajority. Activities that would violate core values can only be added through the Layer 1 amendment process requiring 80% approval.\n\n9. Organizational Sustainability\n9.1 The Non-Profit Commitment\nThe Foundation is structured as a non-profit. There are no shares and no shareholders. Nobody gets paid because equity increases in value. Founders and staff are compensated with salaries for the value they create, not for ownership stakes. The organization is not optimizing for an exit or acquisition. It is designed to eventually be governed entirely by its communities.\n9.2 Revenue Model\nThe Foundation sustains itself through the platform fee on each event transaction (15–20% of ticket revenue, with 50% of that fee covering operations). For free events where no money changes hands, the platform charges nothing, following the Open Collective principle. Additional revenue streams may include premium venue partnership commissions, optional premium tools for high-volume facilitators, and grants or donations from aligned foundations and organizations. The Foundation publishes quarterly financial reports with full narrative context, following Enspiral’s practice of storytelling alongside accounting.\n9.3 Path to Community Governance\nThe founding team governs the platform during Year 1 while establishing the initial community and testing assumptions. In Year 2, governance transitions begin: city nodes gain autonomy over local decisions, facilitator and participant representatives join the governing board, and community voting mechanisms activate for policy decisions. By Year 3 and beyond, the Foundation is governed by its communities through the constitutional framework described in Section 8, with the founding team holding no more authority than any other active community members.\n\n10. Assumptions Testing Framework\nBefore building any technology, the platform must validate its core assumptions through structured experiments. The following framework identifies the riskiest assumptions, designs minimum viable experiments to test each one, and defines clear success criteria. All initial testing should be conducted using existing tools: Google Forms for registration, WhatsApp for community coordination, Google Sheets for transparent economics, and in-person events for the actual gatherings.\n10.1 The Five Core Experiments\nExperiment 1: Sliding-Scale Willingness to Pay\nAssumption: People will voluntarily pay at or above the average cost when given a transparent cost breakdown and a sliding scale.\nDesign: Run an A/B test across 10+ events in two cities. Group A pays a fixed price set at the intended scale’s midpoint. Group B uses a sliding scale with a transparent cost breakdown showing venue, facilitator, platform, and community fund allocations. Group C uses a sliding scale without the breakdown, showing only the range.\nMetrics: Average payment per group, percentage paying at minimum, percentage paying above midpoint, total revenue per event, and post-event satisfaction scores.\nSuccess Criteria: Average payment in the transparent sliding-scale group (B) reaches 90% or more of the fixed-price group (A), with 25% or fewer paying at minimum and 15% or more paying above midpoint.\nMinimum Sample: 30 attendees per condition per city.\nExperiment 2: Facilitator Acceptance and Sustainability\nAssumption: Facilitators will accept transparent economics, community ratings, and sliding-scale impact on their income.\nDesign: Interview 15–20 facilitators across cities about concerns with transparency and community oversight. Then offer 5–8 facilitators a 3-event pilot with a guaranteed minimum fee plus sliding-scale upside.\nSuccess Criteria: 60% or more of interviewed facilitators express interest, 80% or more of pilot facilitators complete all three events, and average compensation reaches 90% or more of their typical rate.\nExperiment 3: Transparency’s Effect on Payment Behavior\nAssumption: Showing a detailed cost breakdown increases willingness to pay above the minimum.\nDesign: Within the sliding-scale condition from Experiment 1, compare the full cost breakdown group (B) against the scale-only group (C). Track whether seeing where money goes changes payment behavior.\nSuccess Criteria: The transparent condition yields 10% or higher average payment than the non-transparent sliding scale. This directly validates the Harvard Business School finding in a live events context.\nExperiment 4: Governance Participation Rates\nAssumption: Community members will actively participate in governance decisions, not just attend events passively.\nDesign: Implement a progressive engagement funnel. Start with a 2-minute post-event feedback form targeting 50% or higher completion. Introduce monthly online polls on event decisions targeting 25% or higher participation. Hold quarterly community meetings targeting 10% or higher attendance. Conduct annual governance votes targeting 15% or higher turnout.\nSuccess Criteria: Meeting or exceeding each funnel target within the first 6 months of operation. Begin with tangible, low-stakes decisions like choosing next month’s event genre before graduating to financial allocation decisions.\nExperiment 5: Platform Discovery vs. Informal Networks\nAssumption: The platform provides meaningful discovery value beyond existing WhatsApp groups and word-of-mouth.\nDesign: Run 5–10 events using only existing tools before building any technology. Track what percentage of attendees discover events through the platform’s channels versus personal networks. Measure whether the platform’s trust signals, such as facilitator ratings and transparency, influence attendance decisions.\nSuccess Criteria: 20% or more of discovery through platform channels by event 5, repeat attendance at 40% or higher, and Net Promoter Score at 50 or above.\n10.2 Crowdfunding Assumption Test\nAssumption: Communities will proactively propose and crowdfund events rather than waiting for facilitators to announce them.\nDesign: After 10+ standard events have established a participant base, post 3 community proposals in a WhatsApp group with simple Google Forms pledge forms. Proposals should span different activity types and budget levels. Track pledge rates, funding completion speed, and whether the resulting events have higher satisfaction than facilitator-initiated events.\nSuccess Criteria: At least 2 of 3 proposals reach minimum funding within 7 days, with average pledges at or above the sliding-scale midpoint.\n10.3 The North Star Metric\nAcross all experiments, track revenue-weighted repeat attendance: the sliding-scale revenue contributed by returning attendees. This single metric captures both financial sustainability (are people paying enough?) and community health (are they coming back?). Supplement with facilitator NPS (would they recommend the platform to peers?), community fund generation per event, and governance participation rates at each funnel level.\n\n11. Success Criteria and Year 1 Timeline\n11.1 Year 1 Milestones\nQuarter\nMilestone\nKey Deliverables\nQ1\nAssumptions Testing\nRun 5 core experiments across Bangalore and one other city using existing tools. Validate sliding-scale economics, facilitator acceptance, and governance participation. Document learnings.\nQ2\nMVP Platform Launch\nFork Open Collective codebase. Build minimum viable marketplace, event creation, post-event transparency dashboard, and basic rating system. Launch operational nodes in 2 cities.\nQ3\nMulti-City Expansion\nExpand to all 4 cities. Onboard initial cohort of verified facilitators per city. Launch community crowdfunding. Activate karma token tracking.\nQ4\nGovernance Activation\nImplement community voting mechanisms. Conduct first community-wide governance decisions. Publish first annual transparency report. Assess Year 2 strategy based on data.\n\n\n11.2 Year 1 Success Criteria\nBy the end of Year 1, the platform should have launched operational nodes in all 4 cities simultaneously, verified an initial cohort of at least 10 facilitators per city, achieved a minimum of 50 events with 20 or more participants each, demonstrated that the sliding-scale model sustains facilitator compensation at 90% or more of market rates, established functional community voting with 15% or higher participation, generated measurable community fund balances in each city node, and onboarded at least 20 facilitator profiles in the marketplace with at least one successful cross-city crowdfunded event.\n11.3 Budget\nYear 1 budget is estimated at $200,000–$300,000, covering platform development (forking and building on Open Collective), community ambassador stipends across 4 cities, legal setup for the non-profit Foundation, initial event subsidies during the testing phase, and operational overhead. Detailed financial projections will be developed following assumptions testing in Q1.\n\n12. Position on AI and Technology\nThe platform takes a deliberate and cautious approach to artificial intelligence. While AI tools can help facilitators with operational tasks like creating event descriptions, generating social media posts, or analyzing feedback patterns, the platform does not position AI as a core feature or selling point. This is a conscious decision for several reasons.\nThe community this platform serves values human connection, embodiment, and present-moment experience. Foregrounding AI risks creating associations with opacity and algorithmic control that contradict the platform’s transparency values. The current cultural discourse around AI includes concerns about data centers, energy consumption, and job displacement that could alienate the target community. The platform’s core value proposition is community-controlled governance, and introducing AI-driven recommendation or curation systems would undermine that principle.\nAI may be used behind the scenes for tasks like expense receipt scanning, automated compliance checking when events are created (ensuring they meet community guidelines), or helping facilitators draft event descriptions. But it should remain invisible infrastructure, not a marketed feature. The platform’s intelligence comes from its community, not its algorithms.\n\n13. What We Do Not Do\nDefining boundaries is as important as defining features. The platform explicitly does not host passive consumption events where the primary mode is watching or listening without active participation. It does not operate as a traditional profit-maximizing event management company. It does not launch as a single-city pilot but rather launches across 4 cities simultaneously to test multi-city dynamics from day one. It does not host purely virtual events or replace physical gathering with digital interaction. It does not use blockchain tokens, cryptocurrency, or any speculative token economics. It does not sell user data or display advertising. It does not create algorithmic recommendation systems that override community-driven discovery. And it does not allow any individual, including founders, to accumulate ownership equity or profit from the platform’s growth beyond fair salary compensation for value created.\n\n14. Next Steps\nThe immediate next actions coming out of this document are as follows. First, design the first event in Bangalore as a structured assumptions test, incorporating the sliding-scale A/B framework from Experiment 1 and basic transparency mechanics using Google Sheets and WhatsApp. Second, draft the Platform Charter (Layer 2 document) defining the legal structure, membership classes, and amendment procedures. Third, conduct facilitator interviews across all four cities to validate Experiment 2 assumptions. Fourth, deep-dive into the Open Collective codebase to assess forking feasibility and identify the technical effort required for marketplace and crowdfunding extensions. Fifth, begin writing the community constitution (Layer 1 values document) as a living draft open for community input from the earliest participants. Sixth, develop detailed financial projections for Year 1 based on assumptions testing outcomes.\n\nEnd of Foundational Design Document  —  Version 2.0",
  "status": "active",
  "created_at": "2026-02-12T17:17:49.487Z",
  "updated_at": "2026-02-12T18:40:41.932Z",
  "pipeline": {
    "current_phase": "concept",
    "phases": {
      "concept": {
        "phase": "concept",
        "sub_state": "review",
        "started_at": "2026-02-12T17:17:49.492Z",
        "step": "council_review"
      }
    },
    "run_id": "pipeline-1770916669492-euzm",
    "updated_at": "2026-02-12T18:40:41.929Z"
  },
  "phase": "concept",
  "concept_thread_id": "thread-20260212-669498",
  "artifacts": {
    "refined_concept": "# Concept Summary: Transparent Collective Gatherings Platform\n\n## 1. Problem Statement\n\nThe immersive collective gatherings ecosystem (ecstatic dance, breathwork, sound healing, conscious raves) is experiencing cultural growth but operates in a fragmented, opaque environment. Current pain points:\n- **Financial opacity**: No standardized pricing or transparency about money flows\n- **Lack of accountability**: No ethical oversight mechanisms in vulnerable settings\n- **Fragmented coordination**: Facilitators operate through personal WhatsApp groups and word-of-mouth\n- **Erosion of trust**: As gatherings scale beyond intimate circles, trust mechanisms break down\n- **No governance structure**: Power concentration among popular facilitators without formal accountability\n\n## 2. Target Users\n\n- **Primary**: Event facilitators (individual practitioners, established collectives, venue owners)\n- **Secondary**: Participants in immersive collective gatherings\n- **Geographic focus**: Zurich, San Francisco, Bangalore, Goa (launch cities reflecting diverse cultural and economic contexts)\n\n## 3. Proposed Solution\n\nA digital platform designed to **strengthen physical community gatherings** (not replace them with virtual experiences). Core principle: Nothing on the platform is virtual—everything leads to people being in the same room together. The digital layer exists solely to facilitate physical togetherness.\n\n**Core mechanism**: Transparent sliding-scale pricing with visible surplus redistribution + formal governance structures.\n\n## 4. Key Features\n\n- **Transparent sliding-scale pricing** with publicly visible financial flows\n- **Dual-token system** separating reputation from governance power\n- **Distributed governance** with facilitator accountability\n- **Community feedback systems** formalized and integrated\n- **Financial transparency dashboards** showing where money goes\n- **Ethical oversight mechanisms** for vulnerable settings\n- **Multi-city coordination** while respecting local cultural contexts\n\n## 5. Differentiation\n\n- **Inverts digital-physical dynamic**: Uses digital infrastructure to serve physical community, not extract attention into virtual spaces\n- **Transparency-first**: Financial flows and governance visible vs. current opacity\n- **Formal accountability**: Structured oversight vs. informal trust networks\n- **Dual-token innovation**: Separates reputation (earned) from governance power (distributed)\n- **Cross-cultural design**: Launches simultaneously in economically and culturally diverse cities\n\n## 6. Success Criteria\n\n*(Implied from conversation)*\n- Facilitator adoption across 4 launch cities\n- Participants engage with transparent pricing model\n- Active community participation in feedback and governance mechanisms\n- Validation of core assumptions (willingness to pay transparently, care about governance, use feedback systems)\n- Beta audience demonstrates platform value before broader rollout\n\n## 7. Scope & Constraints\n\n**In scope for beta:**\n- Full system MVP built using AI agent teams (Claude Code Opus 4.6)\n- Multi-city launch infrastructure (4 cities)\n- Complete feature set including pricing, governance, transparency, and feedback\n\n**Out of scope initially:**\n- Low-tech validation phase (originally planned, now bypassed)\n- Phased rollout (going straight to multi-city beta)\n\n**Constraints:**\n- Need comprehensive technical specification for \"council\" review\n- Tension between thorough validation and rapid build-out (resolved in favor of full AI-powered build)\n- Managing operational complexity across 4 culturally diverse cities simultaneously during beta\n\n**Open questions:**\n- Timeline and resource requirements for AI build\n- Definition of \"council\" stakeholders and approval process\n- Feature prioritization: beta MVP vs. future phases\n- How to maintain data quality and comparable metrics across culturally different contexts",
    "selected_council": [
      {
        "agent_name": "Community Governance & Token Mechanism Designer",
        "role": "Web3 Governance & Incentive Systems",
        "focus": "Evaluates the dual-token model separating reputation from governance power, and the distributed accountability mechanisms. Critical for assessing whether the governance structure can actually prevent power concentration while maintaining facilitator quality in intimate, vulnerable settings.",
        "evaluation_criteria": [
          "Token economic viability (reputation vs governance separation)",
          "Governance mechanism resistance to capture/gaming",
          "Accountability enforcement mechanisms",
          "Scalability of distributed decision-making",
          "Facilitator incentive alignment"
        ]
      },
      {
        "agent_name": "Trust & Safety in Embodied Practice Spaces",
        "role": "Ethical Oversight & Harm Prevention",
        "focus": "Assesses the platform's ability to protect participants in vulnerable states (breathwork, psychedelic-adjacent experiences, intimate touch work). Evaluates formal accountability structures against current informal systems and potential for abuse in consciousness-altering contexts.",
        "evaluation_criteria": [
          "Incident reporting & resolution systems",
          "Power dynamic safeguards (facilitator-participant)",
          "Consent framework robustness",
          "Community accountability vs facilitator autonomy balance",
          "Trauma-informed design principles"
        ]
      },
      {
        "agent_name": "Transparent Pricing & Financial Behavior Analyst",
        "role": "Behavioral Economics & Payment Psychology",
        "focus": "Evaluates the radical transparency model—public financial flows, visible surplus redistribution, and sliding-scale pricing. Assesses whether transparency increases or decreases willingness to pay, and whether the model is financially sustainable for facilitators across different economic contexts.",
        "evaluation_criteria": [
          "Sliding-scale participation patterns",
          "Transparency impact on payment behavior",
          "Financial sustainability for facilitators",
          "Cross-cultural pricing psychology (Zurich vs Goa)",
          "Surplus redistribution effectiveness"
        ]
      },
      {
        "agent_name": "Cross-Cultural Platform Coordination Specialist",
        "role": "Multi-City Operations & Cultural Adaptation",
        "focus": "Assesses the operational complexity of simultaneous launch in Zurich, San Francisco, Bangalore, and Goa—cities with radically different economic contexts, community norms, and gathering cultures. Evaluates whether a single platform can maintain cultural sensitivity while enforcing shared governance/transparency principles.",
        "evaluation_criteria": [
          "Cultural norm conflicts with core transparency model",
          "Economic disparity management (pricing across cities)",
          "Local governance adaptation requirements",
          "Operational coordination complexity",
          "Data quality comparability across contexts"
        ]
      },
      {
        "agent_name": "Physical-Digital Integration Architect",
        "role": "Anti-Extractive Platform Design",
        "focus": "Evaluates the core design principle that 'nothing is virtual—everything leads to physical togetherness.' Assesses whether the platform successfully avoids extracting attention into digital spaces while still providing sufficient digital infrastructure to coordinate, govern, and build trust at scale.",
        "evaluation_criteria": [
          "Engagement pattern analysis (digital vs physical time investment)",
          "Network effects alignment with physical gathering frequency",
          "Feature set necessity (each feature justifies its digital footprint)",
          "Community cohesion impact (digital layer strengthens vs fragments)",
          "Attention economy resistance"
        ]
      }
    ],
    "council_progress": {
      "started_at": "2026-02-12T18:38:12.808Z",
      "agents": [
        {
          "agent_name": "Community Governance & Token Mechanism Designer",
          "status": "completed",
          "started_at": "2026-02-12T18:38:12.870Z",
          "completed_at": "2026-02-12T18:39:01.613Z",
          "evaluation": {
            "agent_name": "Community Governance & Token Mechanism Designer",
            "score": 5,
            "reasoning": "The dual-token architecture (Karma/Voice) shows theoretical sophistication by separating reputation from governance power, which addresses the core cooperative principle that money shouldn't buy votes. However, the design contains several critical vulnerabilities:\n\n**Token Economics (Mixed):**\n- The karma decay mechanism (90-day half-life) is sound and prevents legacy accumulation\n- Weekly earning caps per category help prevent gaming\n- BUT: The 2x cap on financial generosity is gameable by wealthy participants who can max out multiple categories simultaneously\n- The 'three events + two categories' threshold for Voice activation is low and creates sybil attack surface\n\n**Governance Capture Risks (High):**\n- Popular facilitators will naturally accumulate karma faster through attendance consistency, content creation, and community building\n- The system lacks protection against facilitator cartels: 3-5 established facilitators could coordinate to dominate all governance decisions\n- No mechanism described to prevent vote buying through off-platform social pressure in tight-knit communities\n- The 'Elder' verification tier creates a privileged class with unclear accountability\n\n**Accountability Mechanisms (Weak):**\n- Financial transparency is strong (Open Collective fork)\n- BUT: No clear dispute resolution process for ethical violations\n- Community feedback is mentioned but not structurally enforced in governance\n- Facilitator removal process undefined\n- 'Community Ambassadors' have gatekeeping power (verification) without defined accountability to the community they serve\n\n**Scalability Concerns (Significant):**\n- Launching 4 cities simultaneously with manual community management (2-3 ambassadors per city) creates operational fragility\n- No clear mechanism for how city-level governance interfaces with global protocol decisions\n- The 25% city fund / 15% global fund split could create city-vs-platform conflicts as cities grow\n- Cross-city facilitator mobility creates karma portability questions: does reputation earned in Goa transfer to Zurich?\n\n**Facilitator Incentive Alignment (Moderate):**\n- 65% revenue share is competitive\n- Surplus redistribution (30% facilitator bonus) rewards quality\n- BUT: No protection against facilitators building reputation on-platform then moving high-value clients off-platform\n- Platform fee of 15-20% may be high relative to WhatsApp (free) for established facilitators with existing communities\n\n**Fatal Flaw:**\nThe governance system assumes rational, good-faith participation but operates in vulnerable, intimate settings where social dynamics, charisma, and power imbalances are heightened. A popular breathwork facilitator with 500+ karma could dominate governance in ways that aren't visible to participants who lack context about the power dynamics.",
            "concerns": [
              "Sybil attack surface: Low barrier to Voice activation (3 events) allows coordinated groups to manufacture governance power",
              "Facilitator cartel risk: No structural protection against coordination by established facilitators to exclude newcomers or capture governance",
              "Ambassador accountability gap: Gatekeepers (community ambassadors) have verification power without clear community oversight or removal mechanisms",
              "Karma gaming via multi-category maxing: Wealthy participants can hit caps in financial generosity + volunteering + content simultaneously",
              "Off-platform vote buying: Tight-knit communities create social pressure vectors that the token system can't see or prevent",
              "Cross-city governance conflicts: Unclear how city-level priorities (using 25% local fund) interface with global protocol decisions requiring coordination",
              "Facilitator exit risk: Platform builds reputation for facilitators but has no lock-in once they've established local community—what prevents them moving high-value relationships off-platform?",
              "Dispute resolution vacuum: Ethical violations in vulnerable settings (breathwork, bodywork) lack clear adjudication process or appeals mechanism",
              "Operational fragility: 4-city simultaneous launch with manual community management creates single points of failure (what if one ambassador quits?)",
              "Karma portability ambiguity: Does reputation earned facilitating in Bangalore transfer when traveling to Zurich? If yes, creates gaming incentive; if no, reduces facilitator mobility benefit"
            ]
          }
        },
        {
          "agent_name": "Trust & Safety in Embodied Practice Spaces",
          "status": "completed",
          "started_at": "2026-02-12T18:38:12.880Z",
          "completed_at": "2026-02-12T18:39:10.479Z",
          "evaluation": {
            "agent_name": "Trust & Safety in Embodied Practice Spaces",
            "score": 4,
            "reasoning": "This platform addresses real coordination and transparency problems in collective gatherings, but demonstrates critical blind spots in participant protection systems. While it explicitly acknowledges 'vulnerable settings' and 'ethical oversight mechanisms,' it provides almost no concrete infrastructure for preventing or addressing harm. The 41,000+ character document dedicates extensive detail to financial flows, token economics, and governance structures, but remains dangerously vague on safety protocols. The verification system for facilitators focuses on community reputation and trial events, but nowhere specifies trauma-informed training requirements, contraindications screening competency, or boundary ethics. There is no described incident reporting pathway independent of the facilitators' own community networks—meaning someone harmed by a 'Distinguished' facilitator must report through systems that elevated that person. The post-event rating system is reactive, not preventive, and financial transparency does nothing to surface boundary violations, consent failures, or psychological harm. The dual-token reputation system could actually amplify risk: popular facilitators accumulating karma and governance power creates the exact power concentration the platform claims to address, without corresponding accountability structures for misconduct. Community ambassadors perform 'screening,' but screening criteria aren't specified. The platform will operate across cultures with vastly different consent norms (Zurich vs. Goa) with no articulated framework for navigating those differences in high-stakes intimate settings.",
            "concerns": [
              "No formal incident reporting mechanism for boundary violations, consent failures, or psychological harm independent of facilitator networks",
              "Verification tiers emphasize reputation and community endorsement but don't specify safety training, trauma-informed practice competency, or ethics requirements",
              "No informed consent protocols for practices that alter consciousness (breathwork, sound healing) or involve physical vulnerability",
              "No contraindications screening requirements (mental health history, trauma, medications that interact with intense breathwork)",
              "Reputation system (karma tokens) could concentrate power among charismatic facilitators without corresponding accountability for misconduct",
              "Post-event ratings are reactive; no preventive mechanisms to identify facilitators with patterns of boundary violations before widespread harm",
              "Cross-cultural launch (Zurich/SF/Bangalore/Goa) with no articulated framework for consent and touch norms that vary dramatically across these contexts",
              "No emergency response protocols for psychological crises during sessions (panic attacks, dissociation, trauma activation)",
              "Community ambassadors as gatekeepers creates local power concentration without clear checks; who watches the watchers?",
              "Platform incentivizes facilitator popularity (marketplace visibility, crowdfunding) but doesn't balance with participant vulnerability protection",
              "No clear process for removing facilitators who cause harm, especially if they've achieved 'Distinguished' or 'Elder' status with governance power",
              "Financial transparency is emphasized but safety/consent transparency is not—no requirement to disclose facilitator's training, insurance, safety track record"
            ]
          }
        },
        {
          "agent_name": "Transparent Pricing & Financial Behavior Analyst",
          "status": "completed",
          "started_at": "2026-02-12T18:38:12.897Z",
          "completed_at": "2026-02-12T18:40:04.971Z",
          "evaluation": {
            "agent_name": "Transparent Pricing & Financial Behavior Analyst",
            "score": 4,
            "reasoning": "The transparent pricing model shows theoretical sophistication but faces severe practical sustainability risks. **Strengths:** Post-consumption PWYW performs better than pre-payment; charitable surplus component can increase contributions 40-90% per research; separating costs from peer payments reduces social comparison anxiety. **Critical concerns:** (1) **Free-rider problem scales badly** - PWYW research shows payments decline as group size and anonymity increase; intimate 12-person circles subsidize 50-person events. (2) **Facilitator income volatility is unsustainable** - claiming CHF 5,850/month assumes consistent 20-person turnout at CHF 30 average, but PWYW payments typically start 70-80% of suggested price and decline 15-30% over 6-12 months as novelty fades and norms shift downward. A facilitator earning CHF 390/session (65% of CHF 600 gross) one week might earn CHF 180 the next with identical delivery. (3) **Transparency paradox** - visible cost breakdowns can anchor expectations downward if facilitator time seems undervalued OR create resistance if costs seem inflated vs. competitors. Real-time surplus dashboards create perverse late-payer advantage (wait to see if event is already funded before contributing). (4) **Cross-cultural mismatch** - Zurich's high-trust, reserved culture vs. Goa's dual-pricing tourism economy vs. Bangalore's price-sensitive, community-oriented norms will produce incomparable data and create internal arbitrage pressure. (5) **Cognitive burden** - asking participants post-event to review expense documentation, calculate fair share, consider governance implications, and allocate karma is massive friction when people just want to integrate their experience and go home. (6) **Surplus incentive distortion** - facilitators receive 30% of surplus, creating motivation to underestimate costs; participants who pay early lack information late payers have about funding status.",
            "concerns": [
              "Free-rider problem will compound as events scale beyond intimate circles (15-20 people); anonymity increases defection rates significantly",
              "Facilitator income volatility makes professional facilitation unsustainable; PWYW payments typically decline 15-30% over first year as norms shift",
              "Transparent cost comparisons across facilitators may create race-to-bottom pressure on rates, harming facilitator sustainability",
              "Cross-cultural payment psychology varies dramatically (collectivist guilt vs individualist fairness vs tourist-local dynamics); launching 4 cities simultaneously makes pattern recognition nearly impossible",
              "Real-time surplus visibility creates strategic late-payer behavior (wait to see if event is funded before contributing minimally)",
              "Post-event cognitive burden is high: participants must engage with expense documentation, sliding scales, governance, and karma systems when they want to integrate and leave",
              "Surplus distribution (30% to facilitator) creates perverse incentive to underestimate costs or inflate attendance projections",
              "Model assumes stable average payments over time; behavioral research shows PWYW contributions decay as novelty fades and lower-payment norms become established",
              "No plan for handling systemic underfunding; 24-hour deficit appeals may normalize shortfalls and train community to wait for others to cover gaps"
            ]
          }
        },
        {
          "agent_name": "Cross-Cultural Platform Coordination Specialist",
          "status": "completed",
          "started_at": "2026-02-12T18:38:12.912Z",
          "completed_at": "2026-02-12T18:39:13.996Z",
          "evaluation": {
            "agent_name": "Cross-Cultural Platform Coordination Specialist",
            "score": 4,
            "reasoning": "The simultaneous 4-city launch faces severe operational and cultural challenges that could undermine core platform assumptions. **Economic disparity** (5-6x purchasing power gap) creates fundamental tension: transparent pricing visibility across cities risks resentment ('Why do Zurich participants pay 6x what I pay?') and confusion about fairness. The document acknowledges this but doesn't solve it—currency conversion, visible 'suggested contributions,' and cross-city comparisons will be constant friction. **Cultural norm conflicts** are understated: Switzerland's direct democracy and high-trust culture is ideal for transparency, but India's more hierarchical society, strong financial privacy norms, and established bargaining culture may resist the 'pay-what-feels-right-and-show-everyone' model. Goa's tourist dual-pricing economy directly contradicts the platform's transparency ethos. **Operational coordination** with 4 cities from day 1 is extremely ambitious—different time zones (SF to Bangalore = 13.5 hours), manual facilitator verification ('screening, trial events, co-facilitation') managed by 2-3 ambassadors per city, and platform moderation across languages/contexts. This requires massive coordination bandwidth before proving product-market fit. **Local governance adaptation** isn't addressed: Swiss nonprofit law ≠ US ≠ Indian regulations; tax implications vary wildly; decision-making culture differs (Swiss consensus vs. US majority-rule vs. Indian hierarchical). A single global governance model may not translate. **Data quality comparability** is problematic: expense transparency assumes comparable cost structures, but venue rental in Zurich vs. Bangalore means nothing—what's 'fair' facilitator compensation varies 5-6x, making cross-city ratings/karma/metrics culturally non-comparable. The document states 'founders have local presence in each city,' which is critical, but beta-phase simultaneous launch means debugging these issues across 4 contexts at once rather than iterating in one city first.",
            "concerns": [
              "5-6x purchasing power disparity creates cross-city resentment when prices are visible globally—transparent economics may backfire across economic contexts",
              "Cultural resistance to financial transparency in India (privacy norms, bargaining culture, hierarchical society) conflicts with Swiss/US high-trust assumptions",
              "Operational bandwidth: 4 cities × 2-3 ambassadors × manual verification processes × time zone coordination from day 1 beta = unsustainable workload",
              "Legal/regulatory adaptation not addressed—Swiss nonprofit law vs. US vs. Indian tax/governance implications require separate entity structures",
              "Data comparability: ratings, karma, expense 'fairness' judgments are culturally relative—metrics mean different things in Bangalore vs. Zurich, undermining platform-wide reputation system",
              "Goa's tourist dual-pricing economy directly contradicts transparency principle—how do you reconcile local norms with global protocol?",
              "Single global governance model (one-member-one-vote) may not translate to hierarchical Indian community culture or Swiss consensus traditions"
            ]
          }
        },
        {
          "agent_name": "Physical-Digital Integration Architect",
          "status": "completed",
          "started_at": "2026-02-12T18:38:12.925Z",
          "completed_at": "2026-02-12T18:39:45.886Z",
          "evaluation": {
            "agent_name": "Physical-Digital Integration Architect",
            "score": 6,
            "reasoning": "The platform demonstrates genuine commitment to physical-first design by avoiding content hosting, social networking features, and algorithmic feeds. The digital-to-physical time ratio (1:6 to 1:18) is favorable, and the economic model thoughtfully resists extraction. However, the governance complexity (dual tokens with decay mechanics, quadratic voting) and transparency maximalism (real-time dashboards, detailed expense auditing) create ongoing digital engagement requirements that undermine the anti-extractive principle. The marketplace risks becoming a browsing destination rather than simple discovery tool. Most critically, the platform solves coordination-at-scale problems using mechanisms (token-based reputation, distributed governance) that inherently require sustained platform engagement—creating a structural tension between stated values and implementation. This works for power users but may extract more attention from casual participants than necessary to serve their actual need (find trustworthy gatherings, pay fairly, show up).",
            "concerns": [
              "Karma token decay (90-day half-life) pressures continuous platform engagement even for users whose natural gathering rhythm is less frequent",
              "Governance complexity (dual tokens, quadratic voting) requires cognitive overhead disproportionate to casual participant needs",
              "Marketplace with rich facilitator profiles and portfolio links creates browsing rabbit holes—especially when comparing options across cities",
              "Real-time transparency dashboards during 24-hour settlement window risk compulsive checking behavior",
              "Verification tier system (Entry → Distinguished → Elder) combined with transparent ratings creates attention concentration around high-status facilitators",
              "Platform reputation lock-in (karma, ratings, verification tier) makes leaving costly, creating structural dependency that feels voluntary but is coercive",
              "Cross-city discovery optimizes for 'distinguished' imported facilitators over local community builders, potentially fragmenting rather than strengthening neighborhood-level gathering culture",
              "Transparency maximalism (detailed expense audits, surplus tracking) creates work that most users don't want and doesn't meaningfully improve trust compared to simpler 'certified fair' verification"
            ]
          }
        }
      ],
      "synthesis_status": "completed",
      "completed_count": 5,
      "total_count": 5
    },
    "council_brief": "## Refined Concept Summary\n\n# Concept Summary: Transparent Collective Gatherings Platform\n\n## 1. Problem Statement\n\nThe immersive collective gatherings ecosystem (ecstatic dance, breathwork, sound healing, conscious raves) is experiencing cultural growth but operates in a fragmented, opaque environment. Current pain points:\n- **Financial opacity**: No standardized pricing or transparency about money flows\n- **Lack of accountability**: No ethical oversight mechanisms in vulnerable settings\n- **Fragmented coordination**: Facilitators operate through personal WhatsApp groups and word-of-mouth\n- **Erosion of trust**: As gatherings scale beyond intimate circles, trust mechanisms break down\n- **No governance structure**: Power concentration among popular facilitators without formal accountability\n\n## 2. Target Users\n\n- **Primary**: Event facilitators (individual practitioners, established collectives, venue owners)\n- **Secondary**: Participants in immersive collective gatherings\n- **Geographic focus**: Zurich, San Francisco, Bangalore, Goa (launch cities reflecting diverse cultural and economic contexts)\n\n## 3. Proposed Solution\n\nA digital platform designed to **strengthen physical community gatherings** (not replace them with virtual experiences). Core principle: Nothing on the platform is virtual—everything leads to people being in the same room together. The digital layer exists solely to facilitate physical togetherness.\n\n**Core mechanism**: Transparent sliding-scale pricing with visible surplus redistribution + formal governance structures.\n\n## 4. Key Features\n\n- **Transparent sliding-scale pricing** with publicly visible financial flows\n- **Dual-token system** separating reputation from governance power\n- **Distributed governance** with facilitator accountability\n- **Community feedback systems** formalized and integrated\n- **Financial transparency dashboards** showing where money goes\n- **Ethical oversight mechanisms** for vulnerable settings\n- **Multi-city coordination** while respecting local cultural contexts\n\n## 5. Differentiation\n\n- **Inverts digital-physical dynamic**: Uses digital infrastructure to serve physical community, not extract attention into virtual spaces\n- **Transparency-first**: Financial flows and governance visible vs. current opacity\n- **Formal accountability**: Structured oversight vs. informal trust networks\n- **Dual-token innovation**: Separates reputation (earned) from governance power (distributed)\n- **Cross-cultural design**: Launches simultaneously in economically and culturally diverse cities\n\n## 6. Success Criteria\n\n*(Implied from conversation)*\n- Facilitator adoption across 4 launch cities\n- Participants engage with transparent pricing model\n- Active community participation in feedback and governance mechanisms\n- Validation of core assumptions (willingness to pay transparently, care about governance, use feedback systems)\n- Beta audience demonstrates platform value before broader rollout\n\n## 7. Scope & Constraints\n\n**In scope for beta:**\n- Full system MVP built using AI agent teams (Claude Code Opus 4.6)\n- Multi-city launch infrastructure (4 cities)\n- Complete feature set including pricing, governance, transparency, and feedback\n\n**Out of scope initially:**\n- Low-tech validation phase (originally planned, now bypassed)\n- Phased rollout (going straight to multi-city beta)\n\n**Constraints:**\n- Need comprehensive technical specification for \"council\" review\n- Tension between thorough validation and rapid build-out (resolved in favor of full AI-powered build)\n- Managing operational complexity across 4 culturally diverse cities simultaneously during beta\n\n**Open questions:**\n- Timeline and resource requirements for AI build\n- Definition of \"council\" stakeholders and approval process\n- Feature prioritization: beta MVP vs. future phases\n- How to maintain data quality and comparable metrics across culturally different contexts\n\n---\n\n## Original Submission\n\nFOUNDATIONAL DESIGN DOCUMENT\nGlobal Foundation for Transparent Collective Gatherings\n\nVersion 2.0  —  February 2026\nIntegrating Meeting Notes, Design Research, and Systems Architecture\n\n\n\n\n\nLaunch Cities: Zurich  ·  Bangalore  ·  Goa  ·  San Francisco\n\nTable of Contents\n\n\n\n1. Vision and Problem Statement\n1.1 The Opportunity\nImmersive collective gatherings such as ecstatic dance, sound journeys, breathwork circles, and conscious raves are growing in cultural relevance globally. They represent a shift toward experience-driven active engagement and community connection in an era of digital isolation. Yet this growing movement operates in a deeply fragmented ecosystem, with facilitators running events through personal WhatsApp groups, word-of-mouth networks, and inconsistent pricing structures.\n1.2 The Problem\nThe current landscape lacks standardized financial transparency or disclosure, ethical oversight and accountability mechanisms, defined governance structures, formalized community feedback systems, and trust signals for participants. This creates compounding risks: opacity around where money goes, power concentration among popular facilitators without accountability, ethical ambiguity in vulnerable settings (breathwork, sound healing), and erosion of trust as participation scales beyond intimate circles.\n1.3 The Core Insight\nThe digital world has been pulling physical communities into virtual spaces (Facebook groups, Instagram followings). This platform inverts that dynamic: it uses digital infrastructure to strengthen and scale physical community gathering. The whole purpose of the digital layer is to facilitate physical togetherness, not to replace it with screen time. Nothing on this platform is virtual. Everything leads to people being in the same room together.\n\n2. Target Users and Launch Cities\n2.1 Primary User Groups\nEvent Facilitators: Individual practitioners, established collectives, and venue owners currently operating in isolation. They use personal messaging apps, lack discovery tools for new audiences, and handle all financial logistics manually. The platform gives them a community to be discovered by, transparent financial infrastructure, and the ability to travel to new cities and be visible to local communities instantly.\nParticipants: Seekers of trustworthy, experience-driven active engagement events. They currently rely on word of mouth, have no way to verify facilitator quality, and lack visibility into event economics. The platform gives them trust signals, community-driven quality ratings, and the power to shape the events they attend.\nCommunity Ambassadors: Local stewards (2–3 per city) who facilitate facilitator verification through screening, trial events, and co-facilitation requirements. They are the bridge between the global protocol and local community culture.\n2.2 Launch Cities\nThe four initial cities were chosen because the founders have local presence and existing community connections in each. This is critical because the platform requires physical community management, not remote administration.\nCity\nContext\nPurchasing Power Index\nKey Considerations\nZurich\nHigh-trust society, direct democracy culture, established wellness scene\nHigh (baseline)\nStrong overpayment potential, high governance participation expected\nSan Francisco\nLargest existing conscious events community, tech-savvy early adopters\nHigh (similar to Zurich)\nHighest initial adoption potential, competitive landscape\nBangalore\nRapidly growing urban wellness market, tech hub, price-sensitive\nLow (5–6x gap vs. Zurich)\nDual pricing challenge, strong community culture in apartment complexes like Brigade\nGoa\nTourist economy with dual-pricing norms, established retreat culture\nLow (similar to Bangalore)\nSeasonal demand cycles, transient vs. resident population split\n\n\n2.3 Community Structure Within Cities\nBased on the design discussions, the community hierarchy operates across three levels. City-level is the primary organizational unit, with all facilitators and participants indexed by city. Interest-based subcommunities form within each city, grouping around activity types such as sound healing, ecstatic dance, breathwork, and painting. Location-based clusters emerge organically within interest groups, reflecting physical neighborhoods like the Brigade apartment complex in Bangalore, where multiple facilitators may offer similar services and participants choose based on proximity, ratings, and personal preference.\nThis means a participant in Brigade who wants sound healing will see the Bangalore sound healing subcommunity filtered by proximity, with multiple facilitators to choose from, each with their own ratings, verification tier, and transparent pricing history.\n\n3. Proposed Solution\nA nonprofit Foundation that establishes and stewards a global protocol for transparent, community-governed collective gatherings. The Foundation operates through a public charter defining transparency, ethical, and governance standards, city-based nodes with local community ambassadors, facilitator verification with progressive trust levels, independent oversight and accountability structures, economic transparency requirements for all affiliated gatherings, a skills and talent marketplace connecting facilitators with communities, and community crowdfunding to enable demand-driven event programming.\n3.1 Technical Foundation\nThe platform builds on Open Collective’s MIT-licensed open-source codebase, which provides battle-tested transparent financial infrastructure. Open Collective already enables real-time financial dashboards, expense submissions with receipts, transparent budget tracking, and fiscal hosting capabilities. The Foundation will fork this codebase and build additional layers on top: the facilitator verification and rating system, the community governance and voting mechanisms, the skills marketplace and crowdfunding engine, the event management and post-event transparency loop, and the dual-token reputation and governance system.\nOpen Collective’s existing model also aligns philosophically: when a collective on their platform does not charge for events, Open Collective does not charge either. When money flows, they take 15% of the facilitator’s share. This same principle can be adopted and refined for this platform.\n3.2 Data and Infrastructure Approach\nThe platform is intentionally lightweight on data. There is no video streaming, no audio hosting, no heavy media storage. Content is external: facilitators link to their YouTube, Instagram, or SoundCloud profiles. The platform stores primarily text, images, transaction records, and ratings. This means infrastructure costs remain low even at millions of users. A peer-to-peer or federated node architecture is feasible, where city nodes can host portions of the platform on local infrastructure, reducing centralization and keeping costs distributed.\n\n4. Economic Model and Surplus Distribution\n4.1 The Pay-What-Feels-Right Model\nThe economic model operates through a transparent sliding-scale mechanism designed in collaboration with research from Harvard Business School (which found that cost transparency increases purchase likelihood by 21%) and pay-what-you-want literature (which shows that combining PWYW with a charitable component nearly doubles average payment).\nThe participant experience unfolds across four phases. In the pre-event phase, participants see an estimated cost breakdown and a suggested average contribution. The facilitator publishes expected costs including venue rental, materials, collaborator fees, and their own time. Participants register with a commitment to pay after the event. During the event itself, the facilitator and any collaborators deliver the experience. Costs accumulate in real time on the platform as the facilitator logs actual expenses with receipts and invoices. In the post-event settlement phase, which occurs within 24 hours, participants receive a dashboard showing actual costs incurred and the average share per participant. Each participant chooses to pay at, below, or above the average, using a clear sliding scale interface. A live dashboard shows collection progress in real time. Finally, during a reconciliation window that lasts 24 hours after the event, a final summary is published. If there is a deficit, the community is invited to make up the difference. If there is a surplus, the predefined redistribution rules apply automatically. After 24 hours, no further payments are requested.\n4.2 Per-Event Revenue Flow\nDrawing from cooperative economics models used by Stocksy, Resonate, Fairbnb, and the Mondragon Corporation, the following revenue distribution applies to every event on the platform.\nRevenue Layer\nAllocation\nRationale\nFacilitator compensation\n65% of ticket revenue\nCreators capture the majority of value (Stocksy/Resonate principle)\nVenue and production costs\n15–20% (pass-through)\nActual costs verified by uploaded invoices/receipts\nPlatform fee\n15–20%\nSplit into four transparent sub-buckets detailed below\n\n\n4.3 Platform Fee Allocation\nThe platform fee itself is allocated transparently across four sub-buckets, each serving a distinct purpose in the ecosystem. Every participant can see exactly where their contribution goes.\nSub-bucket\nShare of Platform Fee\nPurpose\nPrecedent\nPlatform operations\n50%\nTechnology, administration, insurance, staff salaries\nFairbnb operational share model\nCity community fund\n25%\nLocal community initiatives, accessibility subsidies, venue improvements\nFairbnb 50/50 local community model\nGlobal commons fund\n15%\nCross-city platform development, knowledge sharing, global governance\nMondragon 14% central contribution\nReserve fund\n10%\nEmergency buffer, indivisible cooperative reserves\nICA Cooperative Principles\n\n\n4.4 Surplus Redistribution\nWhen an event collects more than its costs (including facilitator compensation), the surplus follows a predefined and transparent redistribution path. This is not arbitrary: every participant knows before the event exactly what will happen with any surplus. The facilitator receives a bonus of 30% of the surplus, recognizing that popular and high-quality facilitation should be rewarded. The city community fund receives 40%, supporting local community initiatives, subsidizing access for lower-income participants, and building shared resources. The global commons fund receives 20%, enabling cross-city knowledge transfer, platform development, and supporting newer nodes. Finally, 10% enters the reserve fund as an indivisible buffer that can never be distributed, ensuring long-term organizational resilience.\nParticipants who contributed above the average receive karma tokens proportional to their generosity, which serve as reputation signals rather than financial instruments. These tokens are detailed in Section 6.\n4.5 Expense Transparency Requirements\nEvery facilitator must upload actual cost documentation to the platform. For material costs such as venue rental, equipment, and supplies, facilitators provide invoices or receipts. For labor and time, facilitators declare hours and rates in a standardized format. The platform may incorporate expense-scanning functionality similar to tools like Fyle, reading uploaded receipts and auto-populating cost breakdowns. The community can see all expense documentation for every event, and when one facilitator charges significantly more than another for comparable venues or materials, the comparison becomes self-evident through the transparency layer.\n4.6 Can a Facilitator Make a Living?\nYes. A popular facilitator running sessions across multiple neighborhoods or cities full-time can sustain themselves because the platform fee is proportional, not fixed per event. A facilitator who runs three sessions per week at an average of 20 participants paying an average of CHF 30 in Zurich would earn approximately CHF 5,850 per month from facilitation alone (65% of gross). In Bangalore, at equivalent purchasing-power-adjusted rates of approximately 500 INR per participant, the same activity pattern yields roughly INR 78,000 per month. The platform also does not create incentives to take communities off-platform, because the facilitator gains discovery, reputation, cross-city visibility, and financial infrastructure they cannot replicate with a WhatsApp group.\n\n5. Skills Marketplace and Community Crowdfunding\n5.1 The Marketplace Concept\nThe skills and talent marketplace is a discovery layer where facilitators create rich profiles showcasing their abilities, experience, and body of work. It serves three critical functions. First, it solves the cold-start problem for facilitators traveling to new cities: a Distinguished sound healer from Goa becomes instantly visible to the Zurich community without needing to build a local WhatsApp network from scratch. Second, it enables communities to browse available talent when commissioning events through crowdfunding. Third, it creates a portfolio and reputation layer that makes facilitator quality visible and comparable.\n5.2 Facilitator Profile Structure\nEach marketplace profile contains several layers of information. The identity and verification layer shows the facilitator’s name, photo, location and travel availability, verification tier (Entry, Established, Distinguished, or Elder), and verification date. The skills and modalities section lists what they offer, whether that is ecstatic dance DJ sets, sound healing with singing bowls and gongs, holotropic breathwork facilitation, cacao ceremonies, movement therapy, or art workshops. The portfolio section links to external content such as YouTube videos, Instagram reels, SoundCloud mixes, and personal websites, as well as any on-platform event recordings or photo galleries. The platform track record shows the number of events facilitated, average participant rating, community endorsements from other verified facilitators, and transparent pricing history including average cost per participant across past events. Finally, the availability and rates section shows the facilitator’s calendar, base rate expectations, and willingness to accept crowdfunded or sliding-scale-only events.\nProfiles exist in two states. An unverified profile is open to anyone and clearly marked as such, allowing facilitators to showcase their work and be discovered but with a visible trust gap. A verified profile requires completing the platform’s onboarding process of screening, trial events, and co-facilitation, and carries the corresponding tier badge. Communities can engage either type, but verified facilitators naturally attract more trust and crowdfunding support.\n5.3 Community Crowdfunding\nThis mechanism flips the traditional event model. Instead of a facilitator announcing an event and hoping people come, a community collectively decides what experience they want and funds it into existence. The flow works as follows.\nIn the proposal phase, any community member can propose an event concept, for example: \"We want a cacao ceremony with live music in Brigade next Saturday evening.\" The proposal includes the type of experience, preferred date and location, and an estimated budget range. In the crowdfunding phase, community members pledge contributions toward the event’s minimum viable budget, which covers venue, materials, and a guaranteed facilitator base fee. The sliding-scale model applies to pledges, so participants contribute what feels right. A progress bar shows funding status, and the event activates once the minimum budget is reached. During the matching phase, once funded, the community either selects a specific facilitator from the marketplace or opens it to proposals from interested facilitators. The community can review marketplace profiles, watch portfolio content, and compare transparent pricing histories before selecting. In the case of multi-provider events, a lead facilitator can assemble an ensemble from the marketplace, for example pairing a sound healer with a live musician. The full team and cost breakdown are visible to funders before final confirmation. After the event, the standard post-event transparency loop applies: actual costs are disclosed, the sliding scale settles individual contributions, and any surplus follows the predefined redistribution rules.\n5.4 Cross-City Commissioning\nOne of the most powerful features enabled by the marketplace is cross-city commissioning. The Zurich community can crowdfund bringing a Distinguished facilitator from Goa for a special event, with the marketplace handling discovery and the platform handling transparent economics including travel cost allocation. This creates opportunities for facilitators to build a global following and for communities to access talent beyond their local pool, while keeping all economics visible and community-governed.\n5.5 Interaction with the Token System\nThe marketplace creates additional surfaces for the reputation economy. Community members who contribute to crowdfunding campaigns earn karma for community building. Facilitators who accept crowdfunded gigs, which may pay less than private bookings, earn karma for accessibility and community service. Facilitators who offer reduced rates or donate their time earn karma that translates into better platform visibility, accelerated tier progression, and stronger governance participation rights. The marketplace and crowdfunding layer thus reinforce the platform’s core value proposition: the more you contribute to the community, the more the community recognizes and elevates you.\n\n6. Dual Token System: Karma and Voice\nThe platform uses two distinct token types to separate reputation from governance power. This design is grounded in research from SourceCred’s dual-token architecture, a16z’s framework for reputation-based systems, and the universal cooperative principle that money must never buy votes.\n6.1 Karma Tokens (Reputation)\nKarma tokens are non-transferable reputation signals that reflect a member’s contribution to the community. They cannot be bought, sold, or traded. They are earned exclusively through verified actions on the platform.\nKarma is earned through several channels. Attendance consistency rewards regular event participation, with recurring attendance earning more than sporadic visits. Financial generosity recognizes those who pay above the sliding-scale average, without exposing exact amounts; the system shows that someone was generous, not how generous. Volunteering covers practical community contributions like event setup, teardown, greeting, sound checks, and space holding. Community building recognizes bringing new members to the platform and facilitating connections. Crowdfunding contribution rewards those who fund community-proposed events through the marketplace. Content contribution covers sharing playlists, writing event guidelines, creating community resources, and facilitating knowledge exchange.\nA critical design principle is that karma must decay over time. An exponential decay with a 90-day half-life ensures that governance rights reflect current engagement rather than historical accumulation. Reputation earned three months ago counts half as much as today’s contribution. This prevents early adopters from permanently dominating governance and keeps the system oriented toward active participation. Weekly earning caps per category prevent binge-accumulation, and the financial generosity category is specifically capped at 2x the standard contribution equivalent to prevent wealthy participants from gaming the reputation system.\n6.2 Voice Tokens (Governance)\nVoice tokens represent governance participation rights. They are activated by reaching a karma threshold, not by purchasing them. The activation criteria require a minimum of three events attended and contributions in at least two karma categories. Once activated, the baseline principle for constitutional decisions is one-member-one-vote, following the universal cooperative princ\n\n... [original document truncated — 41,186 chars total]\n\n---\n\n## Concept Refinement Chat\n\n**Analyst:** This is remarkably thorough — you've clearly thought deeply about the economic model, governance structure, and cultural dynamics. The transparent sliding-scale approach with surplus redistribution is compelling, and the dual-token system shows sophistication around separating reputation from power.\n\nOne tension I notice: You emphasize testing assumptions with simple tools (Google Forms, WhatsApp, Sheets) before building technology, but you're also planning to launch across 4 cities simultaneously in Year 1. That's a lot of operational complexity to manage manually while validating core assumptions.\n\n**How do you plan to maintain quality and gather comparable data across 4 very different cultural contexts (Zurich, SF, Bangalore, Goa) during the testing phase — especially when purchasing power, trust culture, and community organizing norms vary so dramatically between them?**\n\n**User:** we will build a mvp using claude code opus 4.6 agent teams for a beta audience to validate the concept\n\n**Analyst:** Interesting pivot — from low-tech validation to an AI-built MVP.\n\nBefore committing to that path: **What specific assumptions about the platform can only be validated with working software that you couldn't test with a Sheets-based prototype and manual process for your first 5-10 events?**\n\nThe risk is building infrastructure before proving people will actually use transparent pricing, submit feedback, or care about governance — things you could test at a single location with zero code.\n\n**User:** i will build the full system with AI for beta, thats the goal. Prepare the full spec for council\n\n**User:** Can you summarize what you understand so far about this project?\n\n**Analyst:** ## What I Understand So Far\n\n**Core Concept:**\nYou're building a platform for transparent, accountable immersive collective gatherings (ecstatic dance, breathwork, sound healing, etc.) — addressing fragmentation, financial opacity, and lack of ethical oversight in a growing movement.\n\n**Key Mechanisms:**\n- **Transparent sliding-scale pricing** with visible surplus redistribution\n- **Dual-token system** (reputation vs. governance power)\n- **Distributed governance** with facilitator accountability and community feedback\n- **Financial transparency** showing where money flows\n\n**Scope:**\n- Multi-city launch (Zurich, SF, Bangalore, Goa)\n- Beta validation with working MVP\n- Full system build using AI agent teams (Claude Code Opus 4.6)\n\n**Next Step:**\nYou want a **full technical specification** ready for \"council\" — presumably stakeholders, advisors, or governance body.\n\n---\n\n**What's less clear:**\n- Who exactly is \"council\" and what level of detail they need\n- Whether the spec should cover full production system or just beta MVP scope\n- Timeline/resource constraints for the AI build\n- Specific features prioritized for beta vs. later phases\n\nShould I assume the spec is for a **comprehensive production-ready system**, or focus on a **limited beta MVP** to validate core assumptions first?",
    "council_verdict": {
      "recommendation": "reject",
      "overall_score": 4.6,
      "evaluations": [
        {
          "agent_name": "Community Governance & Token Mechanism Designer",
          "score": 5,
          "reasoning": "The dual-token architecture (Karma/Voice) shows theoretical sophistication by separating reputation from governance power, which addresses the core cooperative principle that money shouldn't buy votes. However, the design contains several critical vulnerabilities:\n\n**Token Economics (Mixed):**\n- The karma decay mechanism (90-day half-life) is sound and prevents legacy accumulation\n- Weekly earning caps per category help prevent gaming\n- BUT: The 2x cap on financial generosity is gameable by wealthy participants who can max out multiple categories simultaneously\n- The 'three events + two categories' threshold for Voice activation is low and creates sybil attack surface\n\n**Governance Capture Risks (High):**\n- Popular facilitators will naturally accumulate karma faster through attendance consistency, content creation, and community building\n- The system lacks protection against facilitator cartels: 3-5 established facilitators could coordinate to dominate all governance decisions\n- No mechanism described to prevent vote buying through off-platform social pressure in tight-knit communities\n- The 'Elder' verification tier creates a privileged class with unclear accountability\n\n**Accountability Mechanisms (Weak):**\n- Financial transparency is strong (Open Collective fork)\n- BUT: No clear dispute resolution process for ethical violations\n- Community feedback is mentioned but not structurally enforced in governance\n- Facilitator removal process undefined\n- 'Community Ambassadors' have gatekeeping power (verification) without defined accountability to the community they serve\n\n**Scalability Concerns (Significant):**\n- Launching 4 cities simultaneously with manual community management (2-3 ambassadors per city) creates operational fragility\n- No clear mechanism for how city-level governance interfaces with global protocol decisions\n- The 25% city fund / 15% global fund split could create city-vs-platform conflicts as cities grow\n- Cross-city facilitator mobility creates karma portability questions: does reputation earned in Goa transfer to Zurich?\n\n**Facilitator Incentive Alignment (Moderate):**\n- 65% revenue share is competitive\n- Surplus redistribution (30% facilitator bonus) rewards quality\n- BUT: No protection against facilitators building reputation on-platform then moving high-value clients off-platform\n- Platform fee of 15-20% may be high relative to WhatsApp (free) for established facilitators with existing communities\n\n**Fatal Flaw:**\nThe governance system assumes rational, good-faith participation but operates in vulnerable, intimate settings where social dynamics, charisma, and power imbalances are heightened. A popular breathwork facilitator with 500+ karma could dominate governance in ways that aren't visible to participants who lack context about the power dynamics.",
          "concerns": [
            "Sybil attack surface: Low barrier to Voice activation (3 events) allows coordinated groups to manufacture governance power",
            "Facilitator cartel risk: No structural protection against coordination by established facilitators to exclude newcomers or capture governance",
            "Ambassador accountability gap: Gatekeepers (community ambassadors) have verification power without clear community oversight or removal mechanisms",
            "Karma gaming via multi-category maxing: Wealthy participants can hit caps in financial generosity + volunteering + content simultaneously",
            "Off-platform vote buying: Tight-knit communities create social pressure vectors that the token system can't see or prevent",
            "Cross-city governance conflicts: Unclear how city-level priorities (using 25% local fund) interface with global protocol decisions requiring coordination",
            "Facilitator exit risk: Platform builds reputation for facilitators but has no lock-in once they've established local community—what prevents them moving high-value relationships off-platform?",
            "Dispute resolution vacuum: Ethical violations in vulnerable settings (breathwork, bodywork) lack clear adjudication process or appeals mechanism",
            "Operational fragility: 4-city simultaneous launch with manual community management creates single points of failure (what if one ambassador quits?)",
            "Karma portability ambiguity: Does reputation earned facilitating in Bangalore transfer when traveling to Zurich? If yes, creates gaming incentive; if no, reduces facilitator mobility benefit"
          ]
        },
        {
          "agent_name": "Trust & Safety in Embodied Practice Spaces",
          "score": 4,
          "reasoning": "This platform addresses real coordination and transparency problems in collective gatherings, but demonstrates critical blind spots in participant protection systems. While it explicitly acknowledges 'vulnerable settings' and 'ethical oversight mechanisms,' it provides almost no concrete infrastructure for preventing or addressing harm. The 41,000+ character document dedicates extensive detail to financial flows, token economics, and governance structures, but remains dangerously vague on safety protocols. The verification system for facilitators focuses on community reputation and trial events, but nowhere specifies trauma-informed training requirements, contraindications screening competency, or boundary ethics. There is no described incident reporting pathway independent of the facilitators' own community networks—meaning someone harmed by a 'Distinguished' facilitator must report through systems that elevated that person. The post-event rating system is reactive, not preventive, and financial transparency does nothing to surface boundary violations, consent failures, or psychological harm. The dual-token reputation system could actually amplify risk: popular facilitators accumulating karma and governance power creates the exact power concentration the platform claims to address, without corresponding accountability structures for misconduct. Community ambassadors perform 'screening,' but screening criteria aren't specified. The platform will operate across cultures with vastly different consent norms (Zurich vs. Goa) with no articulated framework for navigating those differences in high-stakes intimate settings.",
          "concerns": [
            "No formal incident reporting mechanism for boundary violations, consent failures, or psychological harm independent of facilitator networks",
            "Verification tiers emphasize reputation and community endorsement but don't specify safety training, trauma-informed practice competency, or ethics requirements",
            "No informed consent protocols for practices that alter consciousness (breathwork, sound healing) or involve physical vulnerability",
            "No contraindications screening requirements (mental health history, trauma, medications that interact with intense breathwork)",
            "Reputation system (karma tokens) could concentrate power among charismatic facilitators without corresponding accountability for misconduct",
            "Post-event ratings are reactive; no preventive mechanisms to identify facilitators with patterns of boundary violations before widespread harm",
            "Cross-cultural launch (Zurich/SF/Bangalore/Goa) with no articulated framework for consent and touch norms that vary dramatically across these contexts",
            "No emergency response protocols for psychological crises during sessions (panic attacks, dissociation, trauma activation)",
            "Community ambassadors as gatekeepers creates local power concentration without clear checks; who watches the watchers?",
            "Platform incentivizes facilitator popularity (marketplace visibility, crowdfunding) but doesn't balance with participant vulnerability protection",
            "No clear process for removing facilitators who cause harm, especially if they've achieved 'Distinguished' or 'Elder' status with governance power",
            "Financial transparency is emphasized but safety/consent transparency is not—no requirement to disclose facilitator's training, insurance, safety track record"
          ]
        },
        {
          "agent_name": "Transparent Pricing & Financial Behavior Analyst",
          "score": 4,
          "reasoning": "The transparent pricing model shows theoretical sophistication but faces severe practical sustainability risks. **Strengths:** Post-consumption PWYW performs better than pre-payment; charitable surplus component can increase contributions 40-90% per research; separating costs from peer payments reduces social comparison anxiety. **Critical concerns:** (1) **Free-rider problem scales badly** - PWYW research shows payments decline as group size and anonymity increase; intimate 12-person circles subsidize 50-person events. (2) **Facilitator income volatility is unsustainable** - claiming CHF 5,850/month assumes consistent 20-person turnout at CHF 30 average, but PWYW payments typically start 70-80% of suggested price and decline 15-30% over 6-12 months as novelty fades and norms shift downward. A facilitator earning CHF 390/session (65% of CHF 600 gross) one week might earn CHF 180 the next with identical delivery. (3) **Transparency paradox** - visible cost breakdowns can anchor expectations downward if facilitator time seems undervalued OR create resistance if costs seem inflated vs. competitors. Real-time surplus dashboards create perverse late-payer advantage (wait to see if event is already funded before contributing). (4) **Cross-cultural mismatch** - Zurich's high-trust, reserved culture vs. Goa's dual-pricing tourism economy vs. Bangalore's price-sensitive, community-oriented norms will produce incomparable data and create internal arbitrage pressure. (5) **Cognitive burden** - asking participants post-event to review expense documentation, calculate fair share, consider governance implications, and allocate karma is massive friction when people just want to integrate their experience and go home. (6) **Surplus incentive distortion** - facilitators receive 30% of surplus, creating motivation to underestimate costs; participants who pay early lack information late payers have about funding status.",
          "concerns": [
            "Free-rider problem will compound as events scale beyond intimate circles (15-20 people); anonymity increases defection rates significantly",
            "Facilitator income volatility makes professional facilitation unsustainable; PWYW payments typically decline 15-30% over first year as norms shift",
            "Transparent cost comparisons across facilitators may create race-to-bottom pressure on rates, harming facilitator sustainability",
            "Cross-cultural payment psychology varies dramatically (collectivist guilt vs individualist fairness vs tourist-local dynamics); launching 4 cities simultaneously makes pattern recognition nearly impossible",
            "Real-time surplus visibility creates strategic late-payer behavior (wait to see if event is funded before contributing minimally)",
            "Post-event cognitive burden is high: participants must engage with expense documentation, sliding scales, governance, and karma systems when they want to integrate and leave",
            "Surplus distribution (30% to facilitator) creates perverse incentive to underestimate costs or inflate attendance projections",
            "Model assumes stable average payments over time; behavioral research shows PWYW contributions decay as novelty fades and lower-payment norms become established",
            "No plan for handling systemic underfunding; 24-hour deficit appeals may normalize shortfalls and train community to wait for others to cover gaps"
          ]
        },
        {
          "agent_name": "Cross-Cultural Platform Coordination Specialist",
          "score": 4,
          "reasoning": "The simultaneous 4-city launch faces severe operational and cultural challenges that could undermine core platform assumptions. **Economic disparity** (5-6x purchasing power gap) creates fundamental tension: transparent pricing visibility across cities risks resentment ('Why do Zurich participants pay 6x what I pay?') and confusion about fairness. The document acknowledges this but doesn't solve it—currency conversion, visible 'suggested contributions,' and cross-city comparisons will be constant friction. **Cultural norm conflicts** are understated: Switzerland's direct democracy and high-trust culture is ideal for transparency, but India's more hierarchical society, strong financial privacy norms, and established bargaining culture may resist the 'pay-what-feels-right-and-show-everyone' model. Goa's tourist dual-pricing economy directly contradicts the platform's transparency ethos. **Operational coordination** with 4 cities from day 1 is extremely ambitious—different time zones (SF to Bangalore = 13.5 hours), manual facilitator verification ('screening, trial events, co-facilitation') managed by 2-3 ambassadors per city, and platform moderation across languages/contexts. This requires massive coordination bandwidth before proving product-market fit. **Local governance adaptation** isn't addressed: Swiss nonprofit law ≠ US ≠ Indian regulations; tax implications vary wildly; decision-making culture differs (Swiss consensus vs. US majority-rule vs. Indian hierarchical). A single global governance model may not translate. **Data quality comparability** is problematic: expense transparency assumes comparable cost structures, but venue rental in Zurich vs. Bangalore means nothing—what's 'fair' facilitator compensation varies 5-6x, making cross-city ratings/karma/metrics culturally non-comparable. The document states 'founders have local presence in each city,' which is critical, but beta-phase simultaneous launch means debugging these issues across 4 contexts at once rather than iterating in one city first.",
          "concerns": [
            "5-6x purchasing power disparity creates cross-city resentment when prices are visible globally—transparent economics may backfire across economic contexts",
            "Cultural resistance to financial transparency in India (privacy norms, bargaining culture, hierarchical society) conflicts with Swiss/US high-trust assumptions",
            "Operational bandwidth: 4 cities × 2-3 ambassadors × manual verification processes × time zone coordination from day 1 beta = unsustainable workload",
            "Legal/regulatory adaptation not addressed—Swiss nonprofit law vs. US vs. Indian tax/governance implications require separate entity structures",
            "Data comparability: ratings, karma, expense 'fairness' judgments are culturally relative—metrics mean different things in Bangalore vs. Zurich, undermining platform-wide reputation system",
            "Goa's tourist dual-pricing economy directly contradicts transparency principle—how do you reconcile local norms with global protocol?",
            "Single global governance model (one-member-one-vote) may not translate to hierarchical Indian community culture or Swiss consensus traditions"
          ]
        },
        {
          "agent_name": "Physical-Digital Integration Architect",
          "score": 6,
          "reasoning": "The platform demonstrates genuine commitment to physical-first design by avoiding content hosting, social networking features, and algorithmic feeds. The digital-to-physical time ratio (1:6 to 1:18) is favorable, and the economic model thoughtfully resists extraction. However, the governance complexity (dual tokens with decay mechanics, quadratic voting) and transparency maximalism (real-time dashboards, detailed expense auditing) create ongoing digital engagement requirements that undermine the anti-extractive principle. The marketplace risks becoming a browsing destination rather than simple discovery tool. Most critically, the platform solves coordination-at-scale problems using mechanisms (token-based reputation, distributed governance) that inherently require sustained platform engagement—creating a structural tension between stated values and implementation. This works for power users but may extract more attention from casual participants than necessary to serve their actual need (find trustworthy gatherings, pay fairly, show up).",
          "concerns": [
            "Karma token decay (90-day half-life) pressures continuous platform engagement even for users whose natural gathering rhythm is less frequent",
            "Governance complexity (dual tokens, quadratic voting) requires cognitive overhead disproportionate to casual participant needs",
            "Marketplace with rich facilitator profiles and portfolio links creates browsing rabbit holes—especially when comparing options across cities",
            "Real-time transparency dashboards during 24-hour settlement window risk compulsive checking behavior",
            "Verification tier system (Entry → Distinguished → Elder) combined with transparent ratings creates attention concentration around high-status facilitators",
            "Platform reputation lock-in (karma, ratings, verification tier) makes leaving costly, creating structural dependency that feels voluntary but is coercive",
            "Cross-city discovery optimizes for 'distinguished' imported facilitators over local community builders, potentially fragmenting rather than strengthening neighborhood-level gathering culture",
            "Transparency maximalism (detailed expense audits, surplus tracking) creates work that most users don't want and doesn't meaningfully improve trust compared to simpler 'certified fair' verification"
          ]
        }
      ],
      "synthesized_reasoning": "This project addresses genuine coordination failures in the collective gatherings ecosystem—fragmentation, opacity, and accountability gaps are real problems. The financial transparency architecture (Open Collective fork) and physical-first design principles are solid. However, the proposal suffers from dangerous underspecification in safety systems and systematic overreach in scope. The 41,000-character document dedicates extraordinary detail to token economics and surplus redistribution formulas but remains alarmingly vague on participant protection in vulnerable settings like breathwork and bodywork. There is no concrete incident reporting mechanism independent of facilitator networks, no trauma-informed training requirements for verification, and no informed consent protocols for consciousness-altering practices. This is a critical gap for a platform operating in intimate, high-stakes environments. The governance system, while theoretically sophisticated in separating reputation from power, creates multiple attack surfaces: low barriers to Voice activation (3 events), no protection against facilitator cartels, and karma accumulation that concentrates power among charismatic practitioners without corresponding accountability for misconduct. The economic model faces structural sustainability issues—PWYW research shows payments decline 15-30% as novelty fades, free-rider problems compound at scale, and facilitator income volatility makes professional work unsustainable. The 4-city simultaneous launch is operationally reckless: 5-6x purchasing power disparities create non-comparable metrics, cultural norms conflict fundamentally (Swiss transparency vs Indian privacy vs Goa dual-pricing tourism), and manual verification across time zones with 2-3 ambassadors per city is a fragile structure to debug complex cultural and safety issues across simultaneously. Most fundamentally, there's mission-design tension: the platform aims to minimize digital extraction but implements governance complexity (dual tokens with decay, quadratic voting, real-time dashboards) that requires sustained platform engagement—appropriate for power users, burdensome for casual participants who just want trustworthy gatherings. The pivot from low-tech validation to full AI-built MVP bypasses critical assumption testing about whether communities will actually use transparent pricing, submit meaningful feedback, or engage with governance—things testable with 5-10 events and Google Sheets before committing to complex infrastructure.",
      "next_steps": [
        "DO NOT proceed with 4-city simultaneous beta. Reduce scope to single city (recommend Zurich given high-trust culture alignment with transparency model) for 6-month validation phase.",
        "Develop comprehensive Trust & Safety protocol BEFORE any technical build: trauma-informed facilitator training requirements, contraindications screening, informed consent templates, independent incident reporting mechanism, facilitator removal process, emergency response protocols for psychological crises.",
        "Test core economic assumptions with manual process: Run 10-15 events using Google Sheets for transparent cost tracking and post-event PWYW collection. Track payment distributions, free-rider rates, participant cognitive burden, and facilitator income stability before building platform infrastructure.",
        "Radically simplify governance for beta: Replace dual-token system with basic facilitator verification tiers and simple community ratings. Test whether participants actually care about governance before building complex voting/karma mechanics.",
        "If validation succeeds in single city, expand to ONE additional city with contrasting culture (Bangalore) to surface cross-cultural tensions in controlled way before further scaling.",
        "Commission external expert review of safety protocols from trauma-informed practice specialists and consent educators before any public launch.",
        "Clarify 'council' stakeholder composition and decision authority—spec should address their specific concerns about risk, feasibility, and ethical oversight, not just technical architecture."
      ],
      "council_composition": [
        "Community Governance & Token Mechanism Designer",
        "Trust & Safety in Embodied Practice Spaces",
        "Transparent Pricing & Financial Behavior Analyst",
        "Cross-Cultural Platform Coordination Specialist",
        "Physical-Digital Integration Architect"
      ]
    }
  }
}